{
  "id": "amaranth-leaves",
  "commonName": "Amaranth Leaves",
  "scientificName": "Amaranthus spp. (Leafy Varieties, e.g., A. tricolor, A. viridis, A. cruentus)",
  "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRI4MGIXAMPdfkXnHGb_Iv5j8-naWFRmAxmoodvCNE2NQ&s",
  "description": "Amaranth leaves are the edible foliage of various species within the Amaranthus genus. These highly nutritious leafy greens are popular in many global cuisines, known for their mild, slightly sweet or earthy flavor and tender texture when cooked. Leaf colors range from green to vibrant red and variegated.",
  "origin": "Cosmopolitan, with different species native to the Americas, Asia, and Africa. Cultivation for leaves is ancient in many tropical and subtropical regions.",
  "localNames": [
    "Chinese Spinach (English common name)",
    "Callaloo (Caribbean)",
    "Tampala (India)",
    "Chaulai Saag (Hindi)",
    "Bayam (Malay/Indonesian)",
    "Kulitis (Tagalog)",
    "Rau dền (Vietnamese)"
  ],
  "regions": [
    "Asia (India, China, Indonesia, Philippines, Vietnam, Malaysia, Sri Lanka)",
    "Africa (Nigeria, Uganda, Kenya, Botswana)",
    "Caribbean Islands (Jamaica, Trinidad and Tobago)",
    "South America (Brazil)",
    "Europe (Greece)"
  ],
  "seasons": [
    "Primarily warm seasons (Spring, Summer, early Autumn) in most regions. Some species are very hardy and can have extended growing seasons or be grown year-round in tropical climates."
  ],
  "nutrition": {
    "calories": "21 kcal per 100g (cooked, boiled, drained)",
    "macronutrients": [
      {
        "name": "Protein",
        "value": 2.05,
        "unit": "g",
        "rdi": ""
      },
      {
        "name": "Carbohydrates",
        "value": 3.71,
        "unit": "g",
        "rdi": ""
      },
      {
        "name": "Fat",
        "value": 0.19,
        "unit": "g",
        "rdi": ""
      },
      {
        "name": "Fiber",
        "value": 2.1,
        "unit": "g",
        "rdi": ""
      }
    ],
    "vitamins": [
      {
        "name": "Vitamin K",
        "value": 1140.0,
        "unit": "µg",
        "rdi": "950%"
      },
      {
        "name": "Vitamin C",
        "value": 43.3,
        "unit": "mg",
        "rdi": "48%"
      },
      {
        "name": "Vitamin A",
        "value": 292.0,
        "unit": "µg RAE",
        "rdi": "32%"
      },
      {
        "name": "Folate (B9)",
        "value": 85.0,
        "unit": "µg",
        "rdi": "21%"
      },
      {
        "name": "Riboflavin (B2)",
        "value": 0.158,
        "unit": "mg",
        "rdi": "12%"
      },
      {
        "name": "Vitamin B6",
        "value": 0.116,
        "unit": "mg",
        "rdi": "7%"
      }
    ],
    "minerals": [
      {
        "name": "Manganese",
        "value": 0.851,
        "unit": "mg",
        "rdi": "37%"
      },
      {
        "name": "Calcium",
        "value": 215.0,
        "unit": "mg",
        "rdi": "17%"
      },
      {
        "name": "Potassium",
        "value": 411.0,
        "unit": "mg",
        "rdi": "9%"
      },
      {
        "name": "Magnesium",
        "value": 55.0,
        "unit": "mg",
        "rdi": "13%"
      },
      {
        "name": "Iron",
        "value": 2.1,
        "unit": "mg",
        "rdi": "12%"
      },
      {
        "name": "Phosphorus",
        "value": 50.0,
        "unit": "mg",
        "rdi": "4%"
      }
    ]
  },
  "healthBenefits": [
    "Exceptionally rich in Vitamin K, crucial for blood clotting and bone metabolism.",
    "Excellent source of Vitamin A (as carotenoids) and Vitamin C, both potent antioxidants that support immune function, vision, and skin health.",
    "Provides significant amounts of essential minerals including calcium for bone health, manganese for metabolic function, and iron for oxygen transport."
  ],
  "potentialAllergies": [
    {
      "name": "Oxalates",
      "severity": "Low to Moderate",
      "details": "Amaranth leaves contain oxalates, which may contribute to kidney stone formation in susceptible individuals if consumed in very large quantities regularly. Cooking can help reduce oxalate levels."
    },
    {
      "name": "Nitrates",
      "severity": "Low",
      "details": "Like many leafy greens, amaranth can accumulate nitrates from the soil. While generally not an issue for most, very high intake by infants or certain individuals could be a concern."
    }
  ],
  "cultivationProcess": "Amaranth grown for its leaves is typically a fast-growing annual plant. It is adaptable to various soil types but thrives in well-drained, fertile soil with full sun exposure. Seeds can be sown directly into the ground or started indoors for transplanting. Amaranth is known for its heat tolerance and can often be harvested multiple times using the 'cut-and-come-again' method, where outer leaves are taken, allowing inner leaves to continue growing.",
  "growthDuration": "Ready for first harvest of young leaves typically within 3-6 weeks (20-40 days) from sowing. Mature leaves can be harvested over an extended period, often up to 2-3 months, depending on the species and growing conditions.",
  "sustainabilityTips": [
    "Amaranth is a highly resilient and fast-growing crop, often tolerant of drought and poor soil conditions, making it a sustainable choice for diverse agricultural systems.",
    "It's well-suited for home gardening and small-scale farming, promoting local food security and reducing reliance on transported greens."
  ],
  "carbonFootprintInfo": "Locally grown amaranth leaves, especially when cultivated organically or with minimal inputs, have a very low carbon footprint. Commercially grown leaves that require significant transportation, packaging, or out-of-season greenhouse production will have a higher environmental impact.",
  "staticRecipes": [
    {
      "name": "Simple Stir-fried Amaranth Leaves with Garlic",
      "description": "A quick, nutritious, and flavorful way to prepare amaranth leaves, highlighting their tender texture and mild, slightly earthy taste. A staple in many Asian cuisines.",
      "ingredients": [
        "1 large bunch amaranth leaves (about 300-400g), tough stems trimmed or removed",
        "1-2 tablespoons cooking oil (e.g., vegetable oil, sesame oil, or peanut oil)",
        "2-4 cloves garlic, minced or thinly sliced",
        "1/2 teaspoon salt (or to taste)",
        "Optional: Pinch of sugar, a dash of soy sauce or fish sauce, a sprinkle of white pepper"
      ],
      "steps": [
        "Prepare the amaranth leaves: Wash the leaves thoroughly in several changes of cold water to remove any dirt, sand, or grit. If the stems are particularly thick or fibrous, you can remove them or chop them finely to cook for a bit longer before adding the leaves. Younger, tender stems can be cooked along with the leaves. Shake off excess water.",
        "Heat the cooking oil in a large skillet, wok, or wide pan over medium-high heat until the oil shimmers.",
        "Add the minced or sliced garlic to the hot oil. Stir-fry for about 20-30 seconds until the garlic becomes fragrant and lightly golden. Be careful not to burn the garlic, as it can turn bitter.",
        "Immediately add all the washed amaranth leaves to the skillet. The volume will seem large at first, but the leaves will wilt down significantly.",
        "Stir-fry continuously, tossing the leaves with the garlic and oil, for about 2-4 minutes. The leaves should wilt quickly and turn a vibrant green. If the pan seems too dry, you can add a tablespoon of water to help steam the leaves and prevent them from scorching.",
        "Season with salt. If using, add the optional pinch of sugar (to balance flavors) and a dash of soy sauce or fish sauce for umami. Stir well to distribute the seasonings.",
        "Continue to cook for another 1-2 minutes, or until the leaves are tender to your preference but still retain their bright color. Avoid overcooking, which can make them mushy.",
        "Remove from heat and transfer to a serving dish. Serve immediately as a nutritious side dish with rice, noodles, or other main courses."
      ]
    }
  ]
}
