{
  "id": "loquat",
  "commonName": "Loquat",
  "scientificName": "Eriobotrya japonica",
  "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRgmDPm3A7pxrwxLmjTR9ZDbRxYH6oG8Q083NS3v7FE0A&s",
  "description": "The loquat (Eriobotrya japonica) is a large evergreen shrub or small tree known for its clusters of small, oval or pear-shaped orange-yellow fruits. The fruit has a tangy, sweet to subacid flavor, with a succulent flesh that can be white, yellow, or orange.",
  "origin": "Native to the cooler hill regions of south-central China.",
  "localNames": [
    "Pípá (枇杷 - Chinese)",
    "Biwa (ビワ - Japanese)",
    "Níspero Japonés (Spanish)",
    "Nèfle du Japon (French)",
    "Japanische Mispel (German)",
    "Japanese Plum (English)"
  ],
  "regions": [
    "China (major producer)",
    "Japan",
    "Spain (major producer)",
    "Turkey",
    "Pakistan",
    "India",
    "Mediterranean countries (Italy, Greece, Israel, Lebanon)",
    "United States (California, Florida, Hawaii)",
    "Brazil",
    "Chile",
    "Australia"
  ],
  "seasons": [
    "Late winter to early summer (typically flowering in autumn/winter and fruiting in spring/early summer, depending on the climate)"
  ],
  "nutrition": {
    "calories": "47 kcal per 100g",
    "macronutrients": [
      {
        "name": "Protein",
        "value": 0.43,
        "unit": "g"
      },
      {
        "name": "Carbohydrates",
        "value": 12.14,
        "unit": "g"
      },
      {
        "name": "Fat",
        "value": 0.2,
        "unit": "g"
      },
      {
        "name": "Fiber",
        "value": 1.7,
        "unit": "g"
      }
    ],
    "vitamins": [
      {
        "name": "Vitamin A",
        "value": 76,
        "unit": "µg",
        "rdi": "8%"
      },
      {
        "name": "Vitamin B6",
        "value": 0.1,
        "unit": "mg",
        "rdi": "6%"
      },
      {
        "name": "Vitamin C",
        "value": 1,
        "unit": "mg",
        "rdi": "1%"
      },
      {
        "name": "Folate (B9)",
        "value": 14,
        "unit": "µg",
        "rdi": "4%"
      }
    ],
    "minerals": [
      {
        "name": "Potassium",
        "value": 266,
        "unit": "mg",
        "rdi": "6%" 
      },
      {
        "name": "Manganese",
        "value": 0.148,
        "unit": "mg",
        "rdi": "7%" 
      },
      {
        "name": "Iron",
        "value": 0.28,
        "unit": "mg",
        "rdi": "2%"
      },
      {
        "name": "Magnesium",
        "value": 13,
        "unit": "mg",
        "rdi": "3%"
      },
      {
        "name": "Phosphorus",
        "value": 27,
        "unit": "mg",
        "rdi": "2%"
      },
      {
        "name": "Calcium",
        "value": 16,
        "unit": "mg",
        "rdi": "1%"
      }
    ]
  },
  "healthBenefits": [
    "Good source of Vitamin A, which is essential for good vision, immune function, and skin health.",
    "Contains dietary fiber, aiding digestion, promoting satiety, and helping to regulate blood sugar levels.",
    "Provides potassium, an important mineral for maintaining healthy blood pressure and heart function."
  ],
  "potentialAllergies": [
    {
      "name": "Cyanogenic glycosides in seeds",
      "severity": "Low to Moderate (if seeds ingested in quantity)",
      "details": "Loquat seeds (pips) and young leaves contain small amounts of cyanogenic glycosides like amygdalin, which can release cyanide if chewed and ingested in significant quantities. The bitter taste usually prevents consumption of enough seeds to cause harm. The fruit flesh is safe."
    }
  ],
  "cultivationProcess": "Loquat trees are evergreen and adapt to subtropical to mild temperate climates. They are unique in that they flower in autumn or early winter and produce fruit in early spring to early summer. Loquats prefer well-drained soil and full sun for best fruit production. Propagation is often by grafting or budding to maintain cultivar characteristics, though they can be grown from seed. Pruning helps to manage tree size and shape, and to improve fruit quality by thinning.",
  "growthDuration": "Grafted loquat trees can begin to bear fruit within 2-3 years, while seedling trees may take 5-8 years. Trees can grow 5-10 meters tall but are often kept smaller in cultivation. The fruit typically ripens about 90 days after full flower bloom.",
  "sustainabilityTips": [
    "Loquats are relatively drought-tolerant once established, making them a good choice for water-wise gardens in suitable climates.",
    "Support local growers or grow your own, as loquats have a short shelf life and are best consumed fresh, reducing the need for long-distance transport and preservation."
  ],
  "carbonFootprintInfo": "Loquats grown and consumed locally, especially from home gardens or small orchards with minimal inputs, have a low carbon footprint. Fruit imported from distant regions, particularly if air-freighted due to its perishability, will have a considerably higher environmental impact.",
  "staticRecipes": [
    {
      "name": "Simple Loquat Jam",
      "description": "A delightful homemade jam that captures the unique sweet-tart flavor of fresh loquats. It's excellent on toast, scones, or as a glaze.",
      "ingredients": [
        "1 kg ripe loquats, washed, halved, and seeds removed",
        "500g granulated sugar (adjust based on sweetness of fruit and preference)",
        "Juice of 1 large lemon (about 2-3 tablespoons)",
        "1/4 cup water (optional, use if loquats are not very juicy)"
      ],
      "steps": [
        "Prepare the loquats: After washing, halve the loquats and remove all seeds and the tough inner membrane. You can choose to peel the skin or leave it on (skin contains pectin which aids setting). Roughly chop if desired.",
        "Combine the prepared loquats, granulated sugar, lemon juice, and optional water in a large, heavy-bottomed stainless steel or enamel saucepan.",
        "Stir the mixture well and let it sit for about 30-60 minutes. This process, called maceration, helps the sugar to draw juice out of the fruit.",
        "Place the saucepan over medium-low heat. Cook, stirring gently and frequently, until the sugar has completely dissolved. Do not allow the mixture to boil at this stage.",
        "Once the sugar is dissolved, increase the heat to medium-high and bring the mixture to a rolling boil (a boil that continues bubbling even when you stir it).",
        "Continue to boil rapidly, stirring often to prevent the jam from sticking to the bottom of the pan. Cook for approximately 20-30 minutes, or until the jam reaches its setting point.",
        "To test for setting point: Remove the saucepan from the heat. Place a small spoonful of jam onto a chilled saucer (kept in the freezer). Allow it to cool for about 30 seconds, then gently push the jam with your fingertip. If the surface wrinkles, the jam is set. Alternatively, use a jam thermometer; the setting point is 105°C (221°F).",
        "Once the setting point is reached, remove the saucepan from the heat. Skim off any foam (scum) from the surface using a slotted spoon, if desired.",
        "Carefully ladle the hot jam into warm, sterilized glass jars, leaving about 1/4 inch (0.5 cm) of headspace at the top.",
        "Wipe the jar rims clean, place the lids on, and tighten the screw bands. Allow the jars to cool completely undisturbed. As the jam cools, you should hear the lids pop, indicating a good seal. The jam will thicken further as it cools."
      ]
    }
  ]
}
