{
  "id": "noni-fruit",
  "commonName": "Noni Fruit",
  "scientificName": "Morinda citrifolia",
  "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRhW3S0ivX4xly000jF6uk4bj2gw0jD28vgUsbEP0ORDQ&s",
  "description": "Noni (Morinda citrifolia) is a tropical fruit known for its distinctive bumpy appearance, strong pungent odor (often likened to rotten cheese) when ripe, and its historical use as a traditional medicine and famine food in various cultures. The fruit transitions from green to yellow-white as it matures.",
  "origin": "Southeast Asia and Australasia",
  "localNames": [
    "Indian Mulberry (English)",
    "Beach Mulberry (English)",
    "Vomit Fruit (English)",
    "Rotten Cheese Fruit (English)",
    "Noni (Hawaiian, and widely used)",
    "Nonu (Samoan, Tongan)",
    "Nono (Tahitian)",
    "Mengkudu (Malay, Indonesian)"
  ],
  "regions": [
    "Pacific Islands (Hawaii, Tahiti, Fiji, Samoa, Cook Islands)",
    "Southeast Asia (Indonesia, Malaysia, Philippines, Vietnam)",
    "Australasia (Australia - Queensland)",
    "India",
    "Caribbean",
    "South and Central America (limited cultivation)"
  ],
  "seasons": [
    "Year-round in tropical climates; trees can simultaneously bear flowers, immature fruit, and mature fruit."
  ],
  "nutrition": {
    "calories": "47 kcal per 100g",
    "macronutrients": [
      {
        "name": "Protein",
        "value": 0.43,
        "unit": "g",
        "rdi": ""
      },
      {
        "name": "Carbohydrates",
        "value": 11.3,
        "unit": "g",
        "rdi": ""
      },
      {
        "name": "Fat",
        "value": 0.1,
        "unit": "g",
        "rdi": ""
      },
      {
        "name": "Fiber",
        "value": 0.2,
        "unit": "g",
        "rdi": ""
      }
    ],
    "vitamins": [
      {
        "name": "Vitamin C",
        "value": 33.0,
        "unit": "mg",
        "rdi": "37%"
      }
    ],
    "minerals": [
      {
        "name": "Potassium",
        "value": 140.0,
        "unit": "mg",
        "rdi": "3%"
      }
    ]
  },
  "healthBenefits": [
    "Traditionally used in Polynesian and other indigenous cultures for a wide range of ailments and as a general health tonic.",
    "Source of Vitamin C, which contributes to immune function and antioxidant protection.",
    "Contains various phytochemicals, such as flavonoids and lignans, which are being researched for their antioxidant and other potential health effects (though clinical evidence for many traditional claims is limited)."
  ],
  "potentialAllergies": [
    {
      "name": "High Potassium Content",
      "severity": "Moderate to High",
      "details": "Noni products, especially juice, can be high in potassium. Individuals with kidney disease or those on potassium-restricted diets should consult a healthcare provider before consuming noni."
    },
    {
      "name": "Liver Toxicity Reports",
      "severity": "Moderate to High",
      "details": "There have been isolated case reports linking consumption of noni products (particularly concentrated supplements) to liver damage in susceptible individuals. It is advisable to use with caution and consult a healthcare provider, especially if there are pre-existing liver conditions."
    }
  ],
  "cultivationProcess": "Morinda citrifolia is a hardy tree or shrub that grows well in a variety of environments, including shady forests and open sandy or rocky shores. It tolerates saline soils, drought conditions, and secondary soils. Propagation can be done by seeds, cuttings, or air layering. The plant is resilient and often requires minimal care once established in a suitable tropical or subtropical climate.",
  "growthDuration": "Noni trees typically mature and begin fruiting within 12-18 months after planting. They can produce fruit year-round, with flowers, immature, and mature fruit often present on the tree simultaneously.",
  "sustainabilityTips": [
    "Noni is a resilient plant that can be grown with minimal inputs in its native regions, often contributing to local traditional ecosystems.",
    "When choosing noni products, consider those sourced from sustainable, organic farming practices that support local communities."
  ],
  "carbonFootprintInfo": "Fresh noni fruit consumed locally in its growing regions has a relatively low carbon footprint. However, processed noni products (juices, powders, supplements) that are packaged and transported internationally will have a higher carbon footprint due to manufacturing, packaging, and long-distance shipping.",
  "staticRecipes": [
    {
      "name": "Traditional Fermented Noni Juice",
      "description": "A traditional method of preparing noni juice, involving natural fermentation. This process is believed to mellow the fruit's strong flavor and potentially enhance the bioavailability of its compounds. It is often consumed in small amounts for wellness purposes.",
      "ingredients": [
        "Ripe noni fruits (soft, translucent white/yellow)",
        "Clean glass jar with a non-airtight lid or cheesecloth cover"
      ],
      "steps": [
        "Wash ripe noni fruits thoroughly with clean water. Ensure they are free of dirt or debris.",
        "Place the whole, ripe noni fruits into the clean glass jar. Do not add any water, sugar, or other ingredients.",
        "Cover the jar. If using a lid, do not seal it completely airtight to allow fermentation gases to escape. Alternatively, cover the mouth of the jar with a piece of cheesecloth secured with a rubber band or string.",
        "Place the jar in a warm, dark place (like a cupboard) or, as some traditions prefer, in direct sunlight. The fermentation time can vary widely, from a few days to several weeks (e.g., 3 days to 8 weeks), depending on ambient temperature and desired potency/flavor.",
        "The fruit will gradually break down and release its juice. Natural fermentation will occur, evidenced by bubbling or changes in aroma.",
        "Once the desired fermentation period is complete, strain the juice from the fruit pulp using a clean cheesecloth or a fine-mesh sieve into another clean jar or bottle.",
        "Store the strained noni juice in the refrigerator. It is typically consumed in small quantities, such as 1-2 tablespoons (15-30ml) per day, often diluted with water or other juices due to its strong taste."
      ]
    }
  ]
}
