
[
  "Did you know? Storing apples with potatoes can prevent the potatoes from sprouting!",
  "Tomatoes are botanically fruits, but legally vegetables in the US due to a Supreme Court ruling!",
  "Broccoli contains more Vitamin C per serving than an orange.",
  "Carrots were originally purple before Dutch growers cultivated orange varieties in the 17th century.",
  "Bananas are slightly radioactive due to their potassium content, but you'd need to eat millions to feel any effect.",
  "The world's most popular fruit is the tomato.",
  "Planting marigolds near tomatoes can help deter certain pests.",
  "Honey never spoils. Archaeologists have found pots of honey in ancient Egyptian tombs that are over 3,000 years old and still perfectly edible.",
  "A single strawberry has, on average, 200 seeds on its surface.",
  "Bell peppers of different colors are just different stages of ripeness of the same fruit; green is unripe, then yellow, orange, and finally red.",
  "Pumpkins are 90% water.",
  "Avocados are berries, not vegetables.",
  "Garlic can help boost your immune system.",
  "Onions make you cry because they release a sulfur compound that irritates your eyes.",
  "Cucumbers are one of the most hydrating foods, composed of about 96% water.",
  "Spinach loses nutritional value rapidly after picking; eat it fresh!",
  "The heaviest pumpkin ever grown weighed over 2,600 pounds.",
  "Not all chili peppers are hot; bell peppers are a type of chili with no capsaicin.",
  "You can regrow spring onions by placing the root ends in water.",
  "Bees are crucial for pollinating about one-third of the food we eat, including many fruits and vegetables.",
  "Composting kitchen scraps reduces landfill waste and creates nutrient-rich soil for your garden.",
  "Rotating crops in your garden each year helps prevent soil depletion and pest buildup.",
  "Water your plants early in the morning to reduce evaporation and allow leaves to dry before nightfall.",
  "Mulching around plants helps retain soil moisture, suppress weeds, and regulate soil temperature.",
  "A single apple tree can produce up to 400 apples a year."
]
