
[
  {
    "id": "apple",
    "commonName": "Apple",
    "scientificName": "Malus domestica",
    "image": "https://placehold.co/600x401.png",
    "description": "A sweet, edible fruit produced by an apple tree. Apples are cultivated worldwide and are the most widely grown species in the genus Malus.",
    "origin": "Central Asia",
    "localNames": ["Manzana (Spanish)", "Pomme (French)", "Apfel (German)"],
    "regions": ["China", "United States", "Turkey", "Poland", "India"],
    "seasons": ["Autumn", "Winter"],
    "nutrition": {
      "calories": "52 kcal per 100g",
      "macronutrients": [
        { "name": "Protein", "value": 0.3, "unit": "g" },
        { "name": "Carbohydrates", "value": 14, "unit": "g" },
        { "name": "Fat", "value": 0.2, "unit": "g" },
        { "name": "Fiber", "value": 2.4, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 4.6, "unit": "mg", "rdi": "8%" },
        { "name": "Vitamin K", "value": 2.2, "unit": "µg", "rdi": "3%" }
      ],
      "minerals": [
        { "name": "Potassium", "value": 107, "unit": "mg", "rdi": "3%" }
      ]
    },
    "healthBenefits": [
      "Rich in fiber, aiding digestion and promoting satiety, which can be beneficial for weight management.",
      "Contains antioxidants like quercetin, which may protect brain cells from oxidative stress.",
      "Soluble fiber (pectin) can help lower LDL (bad) cholesterol levels, supporting heart health.",
      "May help regulate blood sugar levels, potentially reducing the risk of type 2 diabetes."
    ],
    "potentialAllergies": [
      { "name": "Oral Allergy Syndrome (OAS)", "severity": "Mild", "details": "Often linked to birch pollen allergy. Symptoms include itching or swelling of the mouth, lips, tongue, and throat." },
      { "name": "Pesticide Residues", "severity": "Varies", "details": "Conventionally grown apples can have pesticide residues. Opting for organic or thorough washing is recommended." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Planting: Plant bare-root trees in early spring or container-grown trees anytime soil is workable. Choose a sunny location with good air circulation.\n2. Soil: Apples prefer well-drained, loamy soil with a slightly acidic to neutral pH (6.0-7.0). Amend soil with compost before planting.\n3. Watering: Water young trees regularly, especially during dry periods (1-2 inches per week). Mature trees are more drought-tolerant but benefit from deep watering during prolonged drought.\n4. Fertilizing: Apply a balanced fertilizer in early spring before new growth begins. Avoid over-fertilizing.\n5. Pruning: Prune annually during dormancy (late winter/early spring) to maintain shape and encourage fruit production.\n6. Pollination: Most apple varieties require cross-pollination. Ensure a suitable pollinator is nearby.",
    "growthDuration": "Typically 3-5 years for a young tree to bear its first significant fruit crop. Fruits mature in 100-200 days from bloom.",
    "sustainabilityTips": [
        "Store in the fridge to prolong freshness, not in a fruit bowl.",
        "Compost apple cores or use them to make apple cider vinegar.",
        "Buy local apples in season to reduce food miles."
    ],
    "carbonFootprintInfo": "Apples generally have a low carbon footprint (around 0.3-0.5 kg CO2e/kg), especially when sourced locally and in season.",
    "staticRecipes": [
      {
        "name": "Classic Apple Crumble",
        "description": "A warm and comforting dessert with a sweet apple filling and a crunchy oat topping.",
        "ingredients": ["6 medium apples, peeled, cored and sliced", "1/2 cup granulated sugar", "1 tsp cinnamon", "1 cup all-purpose flour", "1/2 cup brown sugar", "1/2 cup cold butter, cubed", "1/2 cup rolled oats"],
        "steps": ["Preheat oven to 375°F (190°C).", "In a large bowl, toss sliced apples with granulated sugar and cinnamon. Transfer to a baking dish.", "In another bowl, combine flour and brown sugar. Cut in butter until mixture resembles coarse crumbs. Stir in oats.", "Sprinkle topping evenly over apples.", "Bake for 30-40 minutes, or until topping is golden brown and apples are tender."]
      },
      {
        "name": "Homemade Applesauce",
        "description": "Simple and delicious applesauce, perfect as a side or a healthy snack.",
        "ingredients": ["4 large apples, peeled, cored, and quartered", "1/4 cup water", "1-2 tbsp sugar (optional)", "1/2 tsp cinnamon (optional)"],
        "steps": ["Combine apples and water in a saucepan.", "Bring to a boil, then reduce heat, cover, and simmer for 15-20 minutes, or until apples are very tender.", "Remove from heat. Mash with a potato masher or fork for chunky applesauce, or process in a blender for smooth applesauce.", "Stir in sugar and cinnamon if desired. Serve warm or chilled."]
      },
      {
        "name": "Apple Walnut Salad",
        "description": "A refreshing salad with crisp apples, crunchy walnuts, and a light vinaigrette.",
        "ingredients": ["2 crisp apples, cored and diced", "1/2 cup chopped walnuts, toasted", "2 celery stalks, thinly sliced", "1/4 cup dried cranberries", "For dressing: 3 tbsp olive oil, 1 tbsp apple cider vinegar, 1 tsp honey, salt and pepper to taste"],
        "steps": ["In a large bowl, combine diced apples, toasted walnuts, celery, and dried cranberries.", "In a small bowl, whisk together olive oil, apple cider vinegar, honey, salt, and pepper.", "Pour dressing over the salad and toss gently to coat.", "Serve immediately or chill for later."]
      }
    ]
  },
  {
    "id": "banana",
    "commonName": "Banana",
    "scientificName": "Musa spp.",
    "image": "https://placehold.co/600x402.png",
    "description": "An elongated, edible fruit – botanically a berry – produced by several kinds of large herbaceous flowering plants in the genus Musa.",
    "origin": "Southeast Asia and Australia",
    "localNames": ["Plátano (Spanish)", "Banane (French/German)"],
    "regions": ["India", "China", "Indonesia", "Brazil", "Ecuador"],
    "seasons": ["Year-round"],
    "nutrition": {
      "calories": "89 kcal per 100g",
      "macronutrients": [
        { "name": "Protein", "value": 1.1, "unit": "g" },
        { "name": "Carbohydrates", "value": 23, "unit": "g" },
        { "name": "Fat", "value": 0.3, "unit": "g" },
        { "name": "Fiber", "value": 2.6, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 8.7, "unit": "mg", "rdi": "15%" },
        { "name": "Vitamin B6", "value": 0.4, "unit": "mg", "rdi": "20%" }
      ],
      "minerals": [
        { "name": "Potassium", "value": 358, "unit": "mg", "rdi": "10%" },
        { "name": "Magnesium", "value": 27, "unit": "mg", "rdi": "7%" }
      ]
    },
    "healthBenefits": [
      "High potassium content supports healthy blood pressure levels and cardiovascular function.",
      "Provides readily available carbohydrates, making it a great natural energy booster for athletes.",
      "Contains pectin and resistant starch, which may moderate blood sugar levels and improve digestive health.",
      "Good source of Vitamin B6, important for brain development and function."
    ],
    "potentialAllergies": [
      { "name": "Latex-Fruit Syndrome", "severity": "Moderate", "details": "Individuals allergic to latex may also react to bananas. Symptoms can range from mild oral reactions to anaphylaxis in severe cases." },
      { "name": "Tyramine Content", "severity": "Mild", "details": "Can trigger migraines in sensitive individuals, especially when overripe." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Propagation: Bananas are typically grown from \"pups\" or suckers.\n2. Site Selection: Choose a location with full sun, protection from strong winds, and excellent drainage.\n3. Soil: Bananas thrive in rich, fertile, well-drained soil, high in organic matter. Ideal pH is 5.5-6.5.\n4. Planting: Plant pups ensuring the corm is well-covered.\n5. Watering: Bananas are heavy feeders and require consistent moisture.\n6. Fertilizing: Apply a balanced fertilizer rich in potassium regularly.\n7. De-suckering: Remove excess suckers, leaving only one or two strong ones.\n8. Harvesting: Fruit bunch is harvested when bananas are plump but still green.",
    "growthDuration": "Approximately 9-12 months from planting a pup to harvesting the first bunch of bananas.",
    "sustainabilityTips": [
        "Store at room temperature. Separate from other fruits if you want to slow their ripening.",
        "Freeze overripe bananas (peeled) for smoothies or banana bread.",
        "Compost banana peels."
    ],
    "carbonFootprintInfo": "Bananas often have a higher carbon footprint (around 0.5-0.8 kg CO2e/kg) due to long-distance refrigerated transport.",
    "staticRecipes": [
      {
        "name": "Classic Banana Bread",
        "description": "A moist and delicious banana bread, perfect for using up ripe bananas.",
        "ingredients": ["3 ripe bananas, mashed", "1/3 cup melted butter", "1/2 cup sugar", "1 egg, beaten", "1 tsp vanilla extract", "1 tsp baking soda", "Pinch of salt", "1 1/2 cups all-purpose flour"],
        "steps": ["Preheat oven to 350°F (175°C). Grease a loaf pan.", "In a mixing bowl, combine mashed bananas and melted butter. Stir in sugar, egg, and vanilla extract.", "Sprinkle baking soda and salt over the mixture and stir in. Add flour and mix until just combined.", "Pour batter into prepared loaf pan.", "Bake for 50-60 minutes, or until a toothpick inserted into the center comes out clean."]
      },
      {
        "name": "Simple Banana Smoothie",
        "description": "A quick and healthy smoothie, great for breakfast or a snack.",
        "ingredients": ["1 ripe banana, sliced", "1/2 cup milk (dairy or non-dairy)", "1/4 cup yogurt (optional)", "1 tsp honey or maple syrup (optional)", "Few ice cubes"],
        "steps": ["Combine banana, milk, yogurt (if using), honey (if using), and ice cubes in a blender.", "Blend until smooth and creamy.", "Pour into a glass and serve immediately."]
      },
      {
        "name": "Pan-Fried Cinnamon Bananas",
        "description": "A sweet and simple dessert or topping for pancakes or ice cream.",
        "ingredients": ["2 ripe but firm bananas, sliced", "1 tbsp butter", "1 tbsp brown sugar", "1/4 tsp cinnamon"],
        "steps": ["Melt butter in a skillet over medium heat.", "Add banana slices and cook for 1-2 minutes per side, until lightly golden.", "Sprinkle with brown sugar and cinnamon. Cook for another minute, stirring gently, until sugar is melted and bananas are coated.", "Serve warm."]
      }
    ]
  },
  {
    "id": "orange",
    "commonName": "Orange",
    "scientificName": "Citrus × sinensis",
    "image": "https://placehold.co/600x403.png",
    "description": "A round citrus fruit with a tough bright reddish-yellow rind and pulpy, edible flesh.",
    "origin": "Southeast Asia",
    "localNames": ["Naranja (Spanish)", "Orange (French/German)"],
    "regions": ["Brazil", "United States", "China", "India", "Mexico"],
    "seasons": ["Winter", "Spring"],
    "nutrition": {
      "calories": "47 kcal per 100g",
      "macronutrients": [
        { "name": "Protein", "value": 0.9, "unit": "g" },
        { "name": "Carbohydrates", "value": 12, "unit": "g" },
        { "name": "Fat", "value": 0.1, "unit": "g" },
        { "name": "Fiber", "value": 2.4, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 53.2, "unit": "mg", "rdi": "89%" },
        { "name": "Folate", "value": 30, "unit": "µg", "rdi": "8%" }
      ],
      "minerals": [
        { "name": "Potassium", "value": 181, "unit": "mg", "rdi": "5%" },
        { "name": "Calcium", "value": 40, "unit": "mg", "rdi": "4%" }
      ]
    },
    "healthBenefits": [
      "Excellent source of Vitamin C, boosting the immune system.",
      "Contains flavonoids, which have antioxidant and anti-inflammatory properties.",
      "May help lower blood pressure and cholesterol.",
      "Good source of fiber, promoting digestive health."
    ],
    "potentialAllergies": [
      { "name": "Citrus Allergy", "severity": "Mild", "details": "Can cause skin irritation or oral allergy symptoms in sensitive individuals." }
    ],
    "cultivationProcess": "Oranges grow on trees in warm climates. They require sunny conditions, well-drained soil, and regular watering. Trees are often grafted and pruned to improve fruit yield and quality.",
    "growthDuration": "3-5 years for trees to start bearing fruit, with fruit maturing over several months.",
    "sustainabilityTips": [
        "Store oranges at room temperature for a week or in the refrigerator for longer.",
        "Use the zest in cooking and baking before juicing.",
        "Compost peels."
    ],
    "carbonFootprintInfo": "Can vary significantly based on origin and transport (0.4-0.9 kg CO2e/kg). Local and seasonal oranges are best.",
    "staticRecipes": [
      {
        "name": "Fresh Squeezed Orange Juice",
        "description": "The purest way to enjoy oranges - refreshing and full of Vitamin C.",
        "ingredients": ["3-4 large oranges"],
        "steps": ["Wash oranges thoroughly.", "Cut oranges in half.", "Use a citrus juicer (manual or electric) to extract the juice.", "Strain if desired for a smoother juice. Serve immediately."]
      },
      {
        "name": "Orange Glazed Salmon",
        "description": "A flavorful and healthy main course featuring a sweet and tangy orange glaze.",
        "ingredients": ["2 salmon fillets", "For glaze: 1/4 cup orange juice, 1 tbsp soy sauce, 1 tbsp honey, 1 clove garlic (minced), 1/2 tsp ginger (grated)", "Salt and pepper to taste", "1 tbsp olive oil"],
        "steps": ["Preheat oven to 400°F (200°C).", "In a small bowl, whisk together orange juice, soy sauce, honey, minced garlic, and grated ginger for the glaze.", "Season salmon fillets with salt and pepper.", "Heat olive oil in an oven-safe skillet over medium-high heat. Sear salmon for 2-3 minutes per side.", "Pour glaze over salmon. Transfer skillet to the oven and bake for 8-12 minutes, or until salmon is cooked through.", "Spoon extra glaze over salmon before serving."]
      },
      {
        "name": "Simple Orange Salad",
        "description": "A light and refreshing salad that highlights the sweetness of oranges.",
        "ingredients": ["2 large oranges, peeled and sliced into rounds", "1/4 red onion, thinly sliced (optional)", "Handful of fresh mint leaves, chopped", "1 tbsp olive oil", "Pinch of salt"],
        "steps": ["Arrange orange slices on a plate.", "If using, scatter red onion slices over the oranges.", "Drizzle with olive oil and sprinkle with chopped mint and a pinch of salt.", "Serve immediately."]
      }
    ]
  },
  {
    "id": "strawberry",
    "commonName": "Strawberry",
    "scientificName": "Fragaria × ananassa",
    "image": "https://placehold.co/600x404.png",
    "description": "A widely grown hybrid species of the genus Fragaria, cultivated worldwide for its fruit.",
    "origin": "Brittany, France (cultivated hybrid)",
    "localNames": ["Fresa (Spanish)", "Fraise (French)", "Erdbeere (German)"],
    "regions": ["United States", "Mexico", "Turkey", "Spain", "Egypt"],
    "seasons": ["Spring", "Summer"],
    "nutrition": {
      "calories": "32 kcal per 100g",
      "macronutrients": [
        { "name": "Protein", "value": 0.7, "unit": "g" },
        { "name": "Carbohydrates", "value": 7.7, "unit": "g" },
        { "name": "Fat", "value": 0.3, "unit": "g" },
        { "name": "Fiber", "value": 2, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 58.8, "unit": "mg", "rdi": "98%" },
        { "name": "Manganese", "value": 0.4, "unit": "mg", "rdi": "19%" }
      ],
      "minerals": [
        { "name": "Potassium", "value": 153, "unit": "mg", "rdi": "4%" }
      ]
    },
    "healthBenefits": [
      "Rich in Vitamin C and antioxidants like anthocyanins.",
      "May improve heart health by lowering blood pressure and cholesterol.",
      "Anti-inflammatory properties.",
      "Can help regulate blood sugar."
    ],
    "potentialAllergies": [
      { "name": "Strawberry Allergy", "severity": "Mild", "details": "Can cause hives, itching, or oral allergy syndrome." }
    ],
    "cultivationProcess": "Strawberries are low-growing herbaceous plants. They prefer well-drained, slightly acidic soil and full sun. Often grown from runners or bare-root plants. Mulching helps retain moisture and keep fruit clean.",
    "growthDuration": "Plants can fruit in their first year. Main harvest typically in late spring/early summer.",
    "sustainabilityTips": [
        "Store unwashed in the fridge, in a single layer on a paper towel.",
        "Wash just before eating.",
        "Freeze excess strawberries for smoothies or desserts."
    ],
    "carbonFootprintInfo": "Highly variable. Local, field-grown strawberries have a lower footprint (0.5-1.5 kg CO2e/kg). Out-of-season, air-freighted, or greenhouse-grown strawberries have a much higher footprint.",
    "staticRecipes": [
      {
        "name": "Classic Strawberry Shortcake",
        "description": "A beloved dessert featuring fresh strawberries, sweet biscuits, and whipped cream.",
        "ingredients": ["For biscuits: 2 cups all-purpose flour, 2 tbsp sugar, 1 tbsp baking powder, 1/2 tsp salt, 1/2 cup cold butter (cubed), 3/4 cup milk", "For filling: 1 quart fresh strawberries (hulled and sliced), 1/4 cup sugar", "Whipped cream for topping"],
        "steps": ["Preheat oven to 425°F (220°C). Line a baking sheet with parchment paper.", "Biscuits: In a large bowl, whisk together flour, sugar, baking powder, and salt. Cut in butter until mixture resembles coarse crumbs. Stir in milk until just combined. Drop by spoonfuls onto baking sheet.", "Bake biscuits for 12-15 minutes, or until golden brown.", "Filling: In a medium bowl, gently toss sliced strawberries with sugar. Let sit for 15-20 minutes to release juices.", "To assemble: Split warm biscuits in half. Spoon strawberries and their juice over the bottom half. Top with whipped cream and the other biscuit half."]
      },
      {
        "name": "Easy Strawberry Jam",
        "description": "Homemade strawberry jam with just a few ingredients.",
        "ingredients": ["2 pounds fresh strawberries, hulled and crushed", "4 cups granulated sugar", "1/4 cup lemon juice"],
        "steps": ["Combine strawberries, sugar, and lemon juice in a large, heavy-bottomed pot.", "Bring to a rolling boil over high heat, stirring constantly.", "Continue to boil, stirring frequently, until mixture reaches 220°F (105°C) on a candy thermometer, or until a small amount dropped onto a chilled plate gels. This usually takes 10-20 minutes.", "Skim off any foam. Ladle hot jam into sterilized jars, leaving 1/4-inch headspace. Seal and process in a boiling water bath if desired for longer storage, or store in refrigerator."]
      },
      {
        "name": "Strawberry Spinach Salad",
        "description": "A vibrant and healthy salad with sweet strawberries, tender spinach, and a tangy poppy seed dressing.",
        "ingredients": ["6 cups fresh spinach", "1 pint fresh strawberries, sliced", "1/4 cup sliced almonds, toasted", "1/4 red onion, thinly sliced (optional)", "For dressing: 1/4 cup olive oil, 2 tbsp balsamic vinegar, 1 tbsp honey, 1 tsp poppy seeds, salt and pepper to taste"],
        "steps": ["In a large salad bowl, combine spinach, sliced strawberries, toasted almonds, and red onion (if using).", "In a small bowl or jar, whisk or shake together olive oil, balsamic vinegar, honey, poppy seeds, salt, and pepper.", "Pour dressing over salad and toss gently to combine.", "Serve immediately."]
      }
    ]
  },
  {
    "id": "grapes",
    "commonName": "Grapes",
    "scientificName": "Vitis vinifera",
    "image": "https://placehold.co/600x405.png",
    "description": "A fruit, botanically a berry, of the deciduous woody vines of the flowering plant genus Vitis.",
    "origin": "Near East",
    "localNames": ["Uva (Spanish)", "Raisin (French - refers to grape, not dried)", "Traube (German)"],
    "regions": ["China", "Italy", "United States", "Spain", "France"],
    "seasons": ["Summer", "Autumn"],
    "nutrition": {
      "calories": "69 kcal per 100g",
      "macronutrients": [
        { "name": "Protein", "value": 0.7, "unit": "g" },
        { "name": "Carbohydrates", "value": 18, "unit": "g" },
        { "name": "Fat", "value": 0.2, "unit": "g" },
        { "name": "Fiber", "value": 0.9, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin K", "value": 14.6, "unit": "µg", "rdi": "18%" },
        { "name": "Vitamin C", "value": 3.2, "unit": "mg", "rdi": "5%" }
      ],
      "minerals": [
        { "name": "Potassium", "value": 191, "unit": "mg", "rdi": "5%" }
      ]
    },
    "healthBenefits": [
      "Contain antioxidants, including resveratrol (especially in red grapes).",
      "May support heart health.",
      "Can benefit eye health.",
      "May help regulate blood sugar levels."
    ],
    "potentialAllergies": [
      { "name": "Grape Allergy", "severity": "Rare", "details": "Uncommon, but can occur." }
    ],
    "cultivationProcess": "Grapes grow on vines, typically trained on trellises. They require full sun, well-drained soil, and pruning to manage growth and fruit production. Different varieties have different climate needs.",
    "growthDuration": "Vines take 2-4 years to produce a good crop. Fruit ripens in late summer to autumn.",
    "sustainabilityTips": [
        "Store unwashed in the refrigerator.",
        "Choose organic grapes to avoid pesticide residues, as they are often on the 'Dirty Dozen' list.",
        "Freeze grapes for a cool snack."
    ],
    "carbonFootprintInfo": "Footprint depends on origin and transport (0.6-1.2 kg CO2e/kg). Locally grown grapes in season are more sustainable.",
    "staticRecipes": [
      {
        "name": "Chicken Salad with Grapes",
        "description": "A classic creamy chicken salad with the sweet burst of fresh grapes.",
        "ingredients": ["2 cups cooked chicken, shredded or diced", "1/2 cup halved seedless grapes (red or green)", "1/4 cup chopped celery", "1/4 cup chopped pecans or walnuts (optional)", "1/2 cup mayonnaise", "1 tbsp lemon juice", "Salt and pepper to taste"],
        "steps": ["In a medium bowl, combine shredded chicken, grapes, celery, and nuts (if using).", "In a small bowl, mix together mayonnaise, lemon juice, salt, and pepper.", "Add the mayonnaise mixture to the chicken mixture and stir until well combined.", "Serve on lettuce leaves, in sandwiches, or with crackers."]
      },
      {
        "name": "Roasted Grapes with Rosemary",
        "description": "A simple yet elegant side dish or appetizer, bringing out the sweetness of grapes.",
        "ingredients": ["2 cups seedless grapes (red or black recommended)", "1 tbsp olive oil", "1 sprig fresh rosemary, chopped (or 1/2 tsp dried)", "Pinch of salt", "Pinch of black pepper"],
        "steps": ["Preheat oven to 400°F (200°C).", "In a bowl, toss grapes with olive oil, chopped rosemary, salt, and pepper.", "Spread grapes in a single layer on a baking sheet.", "Roast for 15-20 minutes, or until grapes are slightly softened and beginning to caramelize.", "Serve warm as a side, with cheese, or on crostini."]
      },
      {
        "name": "Grape and Feta Salad",
        "description": "A refreshing salad combining sweet grapes, salty feta, and crisp greens.",
        "ingredients": ["4 cups mixed greens (spinach, arugula, etc.)", "1 cup halved seedless grapes", "1/2 cup crumbled feta cheese", "1/4 cup toasted slivered almonds", "For dressing: 3 tbsp olive oil, 1 tbsp red wine vinegar, 1 tsp Dijon mustard, salt and pepper to taste"],
        "steps": ["In a large salad bowl, combine mixed greens, grapes, feta cheese, and toasted almonds.", "In a small bowl, whisk together olive oil, red wine vinegar, Dijon mustard, salt, and pepper.", "Drizzle dressing over the salad and toss gently to combine.", "Serve immediately."]
      }
    ]
  },
  {
    "id": "mango",
    "commonName": "Mango",
    "scientificName": "Mangifera indica",
    "image": "https://placehold.co/600x411.png",
    "description": "A tropical stone fruit, juicy and sweet, with a range of colors including yellow, orange, red, or green. Known as the 'king of fruits' in some regions.",
    "origin": "South Asia (India, Myanmar)",
    "localNames": ["Aam (Hindi)", "Manga (Spanish/Portuguese)", "Mangue (French)"],
    "regions": ["India", "China", "Thailand", "Mexico", "Indonesia", "Pakistan", "Brazil"],
    "seasons": ["Summer"],
    "nutrition": {
      "calories": "60 kcal per 100g",
      "macronutrients": [
        { "name": "Protein", "value": 0.8, "unit": "g" },
        { "name": "Carbohydrates", "value": 15, "unit": "g" },
        { "name": "Fat", "value": 0.4, "unit": "g" },
        { "name": "Fiber", "value": 1.6, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 36.4, "unit": "mg", "rdi": "61%" },
        { "name": "Vitamin A (from Beta-carotene)", "value": 54, "unit": "µg RAE", "rdi": "6%" },
        { "name": "Folate", "value": 43, "unit": "µg", "rdi": "11%" },
        { "name": "Vitamin E", "value": 0.9, "unit": "mg", "rdi": "6%" }
      ],
      "minerals": [
        { "name": "Potassium", "value": 168, "unit": "mg", "rdi": "5%" }
      ]
    },
    "healthBenefits": [
      "Rich in Vitamin C, boosting immunity and promoting skin health.",
      "Good source of Vitamin A (as beta-carotene), crucial for vision and immune function.",
      "Contains antioxidants like mangiferin, which may protect against chronic diseases.",
      "Dietary fiber aids in digestion and can help regulate blood sugar levels."
    ],
    "potentialAllergies": [
      { "name": "Latex-Fruit Syndrome", "severity": "Mild", "details": "Some individuals with latex allergy may react to mangoes, particularly the skin. Symptoms usually involve oral itching." },
      { "name": "Urushiol Sensitivity", "severity": "Mild", "details": "Mango skin, leaves, and sap contain urushiol (similar to poison ivy); can cause contact dermatitis in sensitive individuals. The flesh itself is generally safe." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Mangoes thrive in tropical and subtropical climates with distinct wet and dry seasons and protection from frost.\n2. Soil: Prefer deep, well-drained, loamy soil with a pH between 5.5 and 7.5.\n3. Planting: Usually propagated from grafted seedlings for fruit quality. Plant in full sun with ample space.\n4. Watering: Young trees need regular watering. Mature trees are relatively drought-tolerant but require irrigation during fruit development for best yield.\n5. Fertilizing: Apply balanced fertilizer during active growth periods, especially when young and during fruit set.\n6. Pruning: Prune to shape the tree, remove dead or diseased wood, and improve air circulation and light penetration.\n7. Pest & Disease Control: Monitor for common issues like mango hoppers, fruit flies, and anthracnose.",
    "growthDuration": "Grafted trees may start bearing fruit in 3-5 years. Fruit matures 100-150 days after flowering, depending on the variety and climate.",
    "sustainabilityTips": [
      "Choose locally grown mangoes when in season to reduce food miles.",
      "Compost mango peels and seeds, or try growing a tree from the seed (though fruit quality may vary).",
      "Freeze ripe mango chunks for later use in smoothies or desserts."
    ],
    "carbonFootprintInfo": "Varies widely based on origin and transport method (0.5-1.5 kg CO2e/kg). Air-freighted mangoes have a significantly higher footprint.",
    "staticRecipes": [
      {
        "name": "Classic Mango Lassi",
        "description": "A refreshing and creamy yogurt-based drink popular in India.",
        "ingredients": ["1 cup ripe mango pulp (fresh or canned)", "1 cup plain yogurt", "1/2 cup milk (or water for a lighter version)", "2-4 tbsp sugar or honey (to taste)", "A pinch of cardamom powder (optional)", "Ice cubes"],
        "steps": ["Combine mango pulp, yogurt, milk, sugar/honey, and cardamom powder (if using) in a blender.", "Blend until smooth and creamy.", "Add ice cubes and blend again briefly until desired consistency.", "Pour into glasses and serve chilled. Garnish with a mint sprig if desired."]
      },
      {
        "name": "Fresh Mango Salsa",
        "description": "A vibrant and flavorful salsa perfect with grilled fish, chicken, or as a dip with tortilla chips.",
        "ingredients": ["2 ripe mangoes, peeled, pitted, and diced", "1/2 red onion, finely chopped", "1 jalapeño, minced (seeds removed for less heat, optional)", "1/2 red bell pepper, diced", "1/4 cup chopped fresh cilantro", "Juice of 1 lime", "Salt to taste"],
        "steps": ["In a medium bowl, gently combine diced mangoes, red onion, jalapeño (if using), and red bell pepper.", "Add chopped cilantro and fresh lime juice.", "Season with salt to taste and stir gently to combine all ingredients.", "For best flavor, cover and refrigerate for at least 15-30 minutes to allow flavors to meld. Serve chilled or at room temperature."]
      },
      {
        "name": "Mango Sticky Rice",
        "description": "A popular Thai dessert made with glutinous rice, fresh mango, and a sweet coconut milk sauce.",
        "ingredients": ["1 cup glutinous (sweet) rice, soaked in water for at least 4 hours or overnight", "1 cup coconut milk, full-fat", "1/2 cup granulated sugar (or to taste)", "1/4 tsp salt", "2 ripe mangoes, peeled, pitted, and sliced", "Toasted sesame seeds or a sprig of mint for garnish (optional)"],
        "steps": ["Drain the soaked glutinous rice. Steam the rice for 20-25 minutes, or until tender and cooked through (it should be translucent).", "While rice is steaming, prepare the coconut sauce: In a small saucepan, heat coconut milk, sugar, and salt over medium-low heat. Stir constantly until the sugar and salt are completely dissolved. Do not boil. Reserve about 1/4 cup of this sauce for drizzling.", "Once the rice is cooked, transfer it to a bowl. Gradually pour the remaining warm coconut milk mixture (not the reserved portion) over the hot rice, stirring gently to combine. Cover the bowl and let the rice sit for 20-30 minutes to allow it to absorb the coconut milk and become creamy.", "To serve, place a portion of the sweet sticky rice on a plate. Arrange fresh mango slices alongside. Drizzle with a little of the reserved coconut sauce and garnish with toasted sesame seeds or mint if desired."]
      }
    ]
  },
  {
    "id": "papaya",
    "commonName": "Papaya",
    "scientificName": "Carica papaya",
    "image": "https://placehold.co/600x412.png",
    "description": "A tropical fruit with a sweet, musky flavor and soft, butter-like consistency. The flesh is typically orange or pinkish, with numerous small black seeds in the central cavity.",
    "origin": "Southern Mexico and Central America",
    "localNames": ["Lechosa (Spanish in some regions)", "Pawpaw (in some regions, can be confusing)", "Fruit à bombes (French Caribbean)"],
    "regions": ["India", "Brazil", "Indonesia", "Nigeria", "Mexico"],
    "seasons": ["Year-round in tropical climates, peak in early summer/fall"],
    "nutrition": {
      "calories": "43 kcal per 100g",
      "macronutrients": [
        { "name": "Protein", "value": 0.5, "unit": "g" },
        { "name": "Carbohydrates", "value": 11, "unit": "g" },
        { "name": "Fat", "value": 0.3, "unit": "g" },
        { "name": "Fiber", "value": 1.7, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 60.9, "unit": "mg", "rdi": "102%" },
        { "name": "Vitamin A (from carotenoids)", "value": 47, "unit": "µg RAE", "rdi": "5%" },
        { "name": "Folate", "value": 37, "unit": "µg", "rdi": "9%" }
      ],
      "minerals": [
        { "name": "Potassium", "value": 182, "unit": "mg", "rdi": "5%" }
      ]
    },
    "healthBenefits": [
      "Rich in Vitamin C, boosting the immune system.",
      "Contains papain, an enzyme that aids in protein digestion.",
      "Good source of antioxidants like carotenoids and flavonoids.",
      "May improve heart health and reduce inflammation."
    ],
    "potentialAllergies": [
      { "name": "Latex-Fruit Syndrome", "severity": "Mild", "details": "Individuals with latex allergies may react to papaya." },
      { "name": "Papain Sensitivity", "severity": "Rare", "details": "Some people may be sensitive to the papain enzyme, causing oral irritation." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Papayas are tropical plants needing warm weather, full sun, and protection from frost.\n2. Soil: Well-drained, fertile soil rich in organic matter. pH 6.0-6.5.\n3. Propagation: Grown from seeds. Plant seeds in pots or directly in the ground.\n4. Watering: Requires regular watering, especially during dry periods, but dislikes waterlogged soil.\n5. Fertilizing: Feed regularly with a balanced fertilizer.\n6. Sexing Plants: Papaya plants can be male, female, or hermaphrodite. Hermaphrodite plants are preferred for fruit production. Usually, multiple seedlings are planted and thinned later.\n7. Harvesting: Fruits are harvested when they start showing yellow/orange color and yield slightly to pressure.",
    "growthDuration": "Can bear fruit within 6-12 months from seed under ideal conditions.",
    "sustainabilityTips": [
        "Store unripe papayas at room temperature; ripe papayas in the refrigerator.",
        "Papaya seeds are edible and have a peppery taste; can be dried and ground.",
        "Compost papaya skin."
    ],
    "carbonFootprintInfo": "Moderate carbon footprint, largely dependent on transport from tropical regions (0.6-1.2 kg CO2e/kg).",
    "staticRecipes": [
      {
        "name": "Simple Papaya Boat",
        "description": "A refreshing and easy way to enjoy papaya, often served with lime.",
        "ingredients": ["1 ripe papaya", "1 lime, cut into wedges"],
        "steps": ["Cut the papaya in half lengthwise.", "Scoop out the black seeds from the center cavity of each half.", "Squeeze fresh lime juice over the papaya flesh.", "Serve immediately with a spoon to scoop out the flesh."]
      },
      {
        "name": "Papaya Smoothie",
        "description": "A tropical and nutritious smoothie.",
        "ingredients": ["1 cup ripe papaya chunks, frozen or fresh", "1/2 banana (optional, for creaminess)", "1/2 cup coconut water or milk", "1 tbsp lime juice", "Honey or agave to taste (optional)"],
        "steps": ["Combine papaya chunks, banana (if using), coconut water/milk, and lime juice in a blender.", "Blend until smooth and creamy.", "Taste and add honey or agave if a sweeter smoothie is desired. Blend again briefly.", "Pour into a glass and serve immediately."]
      },
      {
        "name": "Green Papaya Salad (Som Tum Style)",
        "description": "A zesty and spicy salad made with unripe papaya, common in Southeast Asian cuisine (simplified version).",
        "ingredients": ["1 small green (unripe) papaya, peeled, seeded, and shredded or julienned", "2-3 cherry tomatoes, halved", "1-2 tbsp crushed roasted peanuts", "For the dressing: 1 tbsp lime juice, 1 tbsp fish sauce (or soy sauce for vegetarian), 1 tsp sugar, 1 small chili, minced (optional)"],
        "steps": ["Prepare the dressing: In a small bowl, whisk together lime juice, fish sauce (or soy sauce), sugar, and minced chili (if using) until sugar is dissolved.", "In a larger bowl (or traditionally a mortar and pestle), combine the shredded green papaya and cherry tomatoes.", "Pour the dressing over the papaya mixture. Toss well to combine. If using a mortar, gently pound to bruise the ingredients and help them absorb the dressing.", "Transfer to a serving plate and garnish with crushed roasted peanuts. Serve immediately for best texture."]
      }
    ]
  },
  {
    "id": "guava",
    "commonName": "Guava",
    "scientificName": "Psidium guajava",
    "image": "https://placehold.co/600x413.png",
    "description": "A tropical fruit, typically round or pear-shaped, with green or yellow skin and pink or white flesh containing many small, hard seeds. Known for its strong, sweet fragrance.",
    "origin": "Tropical Americas (Mexico to northern South America)",
    "localNames": ["Guayaba (Spanish)", "Goyave (French)", "Amrood (Hindi)"],
    "regions": ["India", "China", "Thailand", "Pakistan", "Mexico", "Brazil", "Egypt"],
    "seasons": ["Varies by region, often multiple crops per year; common in late summer/fall"],
    "nutrition": {
      "calories": "68 kcal per 100g",
      "macronutrients": [
        { "name": "Protein", "value": 2.6, "unit": "g" },
        { "name": "Carbohydrates", "value": 14, "unit": "g" },
        { "name": "Fat", "value": 1, "unit": "g" },
        { "name": "Fiber", "value": 5.4, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 228.3, "unit": "mg", "rdi": "381%" },
        { "name": "Vitamin A (from carotenoids)", "value": 31, "unit": "µg RAE", "rdi": "3%" },
        { "name": "Folate", "value": 49, "unit": "µg", "rdi": "12%" }
      ],
      "minerals": [
        { "name": "Potassium", "value": 417, "unit": "mg", "rdi": "12%" }
      ]
    },
    "healthBenefits": [
      "Exceptionally high in Vitamin C, a powerful antioxidant that boosts the immune system.",
      "Rich in dietary fiber, aiding digestion and promoting satiety.",
      "May help lower blood sugar levels and improve insulin resistance.",
      "Contains antioxidants that can protect against cell damage."
    ],
    "potentialAllergies": [
      { "name": "Guava Allergy", "severity": "Rare", "details": "Allergies to guava are uncommon but can occur." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Guavas are tropical and subtropical plants, sensitive to cold. Prefer full sun.\n2. Soil: Adaptable to various soils but prefer well-drained, fertile loam with pH 5-7.\n3. Propagation: Can be grown from seeds, cuttings, or air layering. Seeds may not grow true to type.\n4. Watering: Young trees need regular watering. Mature trees are drought-tolerant but fruit better with consistent moisture.\n5. Fertilizing: Apply balanced fertilizer regularly, especially during growth and fruiting stages.\n6. Pruning: Prune to maintain shape, remove dead/diseased wood, and encourage fruiting.\n7. Harvesting: Fruits are picked when they change color (usually from dark green to light green or yellow) and emit a strong fragrance. They soften after picking.",
    "growthDuration": "Seedling trees may fruit in 2-4 years. Fruit ripens 3-5 months after flowering.",
    "sustainabilityTips": [
        "Guava is often eaten fresh, skin and seeds included (for some varieties).",
        "Ripe guavas are fragile; handle with care and consume quickly or refrigerate.",
        "Can be used to make juices, jams, and jellies."
    ],
    "carbonFootprintInfo": "Moderate, similar to other tropical fruits, depending on transport (0.6-1.3 kg CO2e/kg).",
    "staticRecipes": [
      {
        "name": "Guava Juice (Agua de Guayaba)",
        "description": "A refreshing and popular Latin American fruit drink.",
        "ingredients": ["4-5 ripe guavas, washed and roughly chopped (ends trimmed)", "4 cups water", "1/2 cup sugar (or to taste)", "Juice of 1/2 lime (optional)"],
        "steps": ["Combine chopped guavas and 2 cups of water in a blender.", "Blend until smooth.", "Strain the mixture through a fine-mesh sieve into a pitcher, pressing on the solids to extract as much juice as possible. Discard the pulp and seeds.", "Add the remaining 2 cups of water, sugar, and lime juice (if using) to the pitcher. Stir well until the sugar is dissolved.", "Taste and adjust sweetness if necessary. Serve chilled over ice."]
      },
      {
        "name": "Guava Paste (Goiabada / Bocadillo)",
        "description": "A thick, sweet paste made from guava, often served with cheese.",
        "ingredients": ["2 lbs ripe guavas, washed, ends trimmed, and quartered", "1 cup sugar (or more, depending on guava sweetness and desired firmness)", "Juice of 1 lime"],
        "steps": ["Place guava quarters in a saucepan with about 1/2 cup of water. Bring to a simmer, cover, and cook for 15-20 minutes, or until very soft.", "Allow to cool slightly, then pass the cooked guavas through a food mill or press through a sieve to remove seeds and create a smooth pulp.", "Measure the pulp. For every cup of pulp, add about 3/4 to 1 cup of sugar (adjust to taste) and the lime juice. Combine in a heavy-bottomed saucepan.", "Cook over medium-low heat, stirring constantly, until the mixture thickens significantly and pulls away from the sides of the pan. This can take 30-60 minutes. Be careful as it may splatter.", "Pour the hot paste into a lightly greased mold or a shallow dish lined with parchment paper. Smooth the top.", "Allow to cool completely at room temperature, then refrigerate until firm. Cut into squares or slices to serve."]
      },
      {
        "name": "Spiced Guava Slices",
        "description": "A simple way to enjoy fresh guava with a touch of spice.",
        "ingredients": ["2 ripe guavas", "Pinch of salt", "Pinch of chili powder or cayenne pepper (optional)", "Lime wedge for squeezing (optional)"],
        "steps": ["Wash the guavas thoroughly.", "Slice the guavas into wedges or rounds, as preferred. You can eat the skin and seeds of most common varieties.", "Arrange the guava slices on a plate.", "Sprinkle lightly with salt and chili powder (if using).", "Squeeze a bit of fresh lime juice over the top if desired. Serve immediately."]
      }
    ]
  },
  {
    "id": "watermelon",
    "commonName": "Watermelon",
    "scientificName": "Citrullus lanatus",
    "image": "https://placehold.co/600x414.png",
    "description": "A large, sweet fruit originally from southern Africa. It's known for its high water content and refreshing taste, typically with green rind and red, juicy flesh.",
    "origin": "Southern Africa (Kalahari Desert region)",
    "localNames": ["Sandía (Spanish)", "Pastèque (French)", "Wassermelone (German)"],
    "regions": ["China", "Turkey", "Iran", "Brazil", "United States"],
    "seasons": ["Summer"],
    "nutrition": {
      "calories": "30 kcal per 100g",
      "macronutrients": [
        { "name": "Protein", "value": 0.6, "unit": "g" },
        { "name": "Carbohydrates", "value": 7.6, "unit": "g" },
        { "name": "Fat", "value": 0.2, "unit": "g" },
        { "name": "Fiber", "value": 0.4, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 8.1, "unit": "mg", "rdi": "14%" },
        { "name": "Vitamin A (from carotenoids)", "value": 28, "unit": "µg RAE", "rdi": "3%" }
      ],
      "minerals": [
        { "name": "Potassium", "value": 112, "unit": "mg", "rdi": "3%" },
        { "name": "Lycopene (antioxidant)", "value": 4532, "unit": "µg" }
      ]
    },
    "healthBenefits": [
      "Excellent for hydration due to high water content (about 92%).",
      "Good source of lycopene, an antioxidant linked to heart health and cancer prevention.",
      "Contains citrulline, an amino acid that may improve blood flow and reduce muscle soreness.",
      "Provides Vitamin C, supporting immune function."
    ],
    "potentialAllergies": [
      { "name": "Oral Allergy Syndrome (OAS)", "severity": "Mild", "details": "Rare, but can occur in individuals with ragweed pollen allergy." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Watermelons are warm-season crops, requiring long, hot summers. Full sun is essential.\n2. Soil: Prefer sandy loam soil that is well-drained and rich in organic matter. pH 6.0-6.8.\n3. Planting: Typically grown from seeds, started indoors in cooler climates or sown directly when soil is warm.\n4. Spacing: Vines need ample space to spread. Plant hills 6-8 feet apart.\n5. Watering: Consistent and deep watering is crucial, especially during fruit set and development. Reduce watering as fruits ripen.\n6. Fertilizing: Benefit from fertilizers rich in potassium and phosphorus.\n7. Pollination: Bees are essential for pollinating watermelon flowers.\n8. Harvesting: Judged by a dull sound when thumped, drying of the tendril nearest the fruit, and a yellowing of the underside where it touches the ground.",
    "growthDuration": "70-90 days from sowing to harvest, depending on variety.",
    "sustainabilityTips": [
        "Store uncut watermelon at room temperature; cut watermelon in the refrigerator.",
        "Use the entire watermelon: rind can be pickled or candied, seeds can be roasted.",
        "Choose locally grown watermelons in season for best flavor and lower impact."
    ],
    "carbonFootprintInfo": "Generally low (0.2-0.4 kg CO2e/kg) if field-grown and consumed locally. Transport can increase this significantly.",
    "staticRecipes": [
      {
        "name": "Classic Watermelon Slices",
        "description": "The simplest and most refreshing way to enjoy watermelon.",
        "ingredients": ["1 ripe watermelon"],
        "steps": ["Wash the outside of the watermelon thoroughly.", "Place the watermelon on a sturdy cutting board.", "Using a large, sharp knife, cut the watermelon in half lengthwise or crosswise.", "Lay each half cut-side down and slice into wedges or rounds of desired thickness.", "Serve immediately or chill for later."]
      },
      {
        "name": "Watermelon Feta Mint Salad",
        "description": "A refreshing and flavorful salad combining sweet watermelon, salty feta, and fresh mint.",
        "ingredients": ["4 cups cubed seedless watermelon", "1/2 cup crumbled feta cheese", "1/4 cup fresh mint leaves, chopped or torn", "1-2 tbsp olive oil", "1 tbsp lime juice or red wine vinegar", "Pinch of salt and black pepper (optional)"],
        "steps": ["In a large bowl, gently combine cubed watermelon, crumbled feta cheese, and fresh mint.", "In a small bowl, whisk together olive oil and lime juice or red wine vinegar. Season lightly with salt and pepper if desired (feta is already salty).", "Drizzle the dressing over the watermelon mixture.", "Toss gently to combine. Serve immediately or chilled. For best results, assemble just before serving as watermelon can release a lot of water."]
      },
      {
        "name": "Refreshing Watermelon Juice/Agua Fresca",
        "description": "A simple and hydrating drink perfect for hot days.",
        "ingredients": ["4-5 cups cubed seedless watermelon", "1/2 cup water (optional, for easier blending)", "Juice of 1/2 to 1 lime (to taste)", "1-2 tbsp sugar or agave (optional, to taste)", "Fresh mint sprigs for garnish (optional)"],
        "steps": ["Place cubed watermelon into a blender. Add water if your watermelon isn't very juicy or to help with blending.", "Blend until smooth.", "Strain the mixture through a fine-mesh sieve into a pitcher if you prefer a very smooth juice, pressing gently on the solids. For a more rustic agua fresca, straining is optional.", "Stir in lime juice and sweetener (if using) to taste.", "Serve chilled over ice, garnished with a mint sprig if desired."]
      }
    ]
  },
  {
    "id": "muskmelon",
    "commonName": "Muskmelon (Cantaloupe)",
    "scientificName": "Cucumis melo var. cantalupensis",
    "image": "https://placehold.co/600x415.png",
    "description": "A type of melon with a rough, webbed or netted rind, typically with sweet, orange flesh. Cantaloupe is a common variety of muskmelon.",
    "origin": "Persia (Iran) or Africa",
    "localNames": ["Cantalupo (Spanish/Italian)", "Kharbooja (Hindi)"],
    "regions": ["China", "Turkey", "Iran", "United States", "Egypt", "India", "Spain"],
    "seasons": ["Summer"],
    "nutrition": {
      "calories": "34 kcal per 100g",
      "macronutrients": [
        { "name": "Protein", "value": 0.8, "unit": "g" },
        { "name": "Carbohydrates", "value": 8.2, "unit": "g" },
        { "name": "Fat", "value": 0.2, "unit": "g" },
        { "name": "Fiber", "value": 0.9, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 36.7, "unit": "mg", "rdi": "61%" },
        { "name": "Vitamin A (from Beta-carotene)", "value": 169, "unit": "µg RAE", "rdi": "19%" }
      ],
      "minerals": [
        { "name": "Potassium", "value": 267, "unit": "mg", "rdi": "8%" }
      ]
    },
    "healthBenefits": [
      "Excellent source of Vitamin A (as beta-carotene) and Vitamin C, supporting vision, immune function, and skin health.",
      "Good source of potassium, which helps regulate blood pressure.",
      "High water content contributes to hydration.",
      "Contains antioxidants that protect against cell damage."
    ],
    "potentialAllergies": [
      { "name": "Oral Allergy Syndrome (OAS)", "severity": "Mild", "details": "May occur in individuals allergic to ragweed or grass pollens." },
      { "name": "Listeria/Salmonella Risk", "severity": "Varies", "details": "The netted rind can harbor bacteria; thorough washing of the rind before cutting is crucial."}
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Warm-season crop requiring plenty of sun and warm temperatures.\n2. Soil: Prefers well-drained, sandy loam soil rich in organic matter, pH 6.0-6.8.\n3. Planting: Sow seeds directly after the last frost or start indoors 3-4 weeks prior.\n4. Spacing: Vines need space; plant in hills or rows with adequate spacing.\n5. Watering: Consistent watering is needed, especially during fruit development. Avoid wetting foliage if possible.\n6. Fertilizing: Benefit from balanced fertilizer, with increased potassium during fruiting.\n7. Harvesting: Ripeness indicated by a sweet aroma, rind changing color (often to beige or yellow under the netting), and the melon easily detaching from the vine ('full slip').",
    "growthDuration": "70-90 days from sowing to harvest.",
    "sustainabilityTips": [
        "Store uncut muskmelons at room temperature until ripe, then refrigerate.",
        "Wash the rind thoroughly before cutting to prevent transferring bacteria to the flesh.",
        "Compost the rind and seeds."
    ],
    "carbonFootprintInfo": "Generally low to moderate (0.3-0.6 kg CO2e/kg) if field-grown. Transport and out-of-season greenhouse production increase this.",
    "staticRecipes": [
      {
        "name": "Cantaloupe and Prosciutto",
        "description": "A classic Italian appetizer balancing sweet cantaloupe with salty prosciutto.",
        "ingredients": ["1 ripe cantaloupe (muskmelon)", "4-6 oz thinly sliced prosciutto"],
        "steps": ["Wash the cantaloupe rind thoroughly. Cut the cantaloupe in half and scoop out the seeds.", "Slice the cantaloupe flesh into wedges or cubes.", "Wrap each cantaloupe piece with a slice of prosciutto.", "Arrange on a platter and serve immediately or chilled. A drizzle of balsamic glaze or fresh basil can be added if desired."]
      },
      {
        "name": "Chilled Cantaloupe Soup",
        "description": "A refreshing and light cold soup, perfect for a hot summer day.",
        "ingredients": ["1 medium ripe cantaloupe, peeled, seeded, and cubed (about 4 cups)", "1/2 cup orange juice", "1/4 cup plain yogurt or coconut milk", "1 tbsp fresh lime juice", "1 tsp grated fresh ginger (optional)", "Fresh mint leaves for garnish"],
        "steps": ["Combine cubed cantaloupe, orange juice, yogurt/coconut milk, lime juice, and ginger (if using) in a blender.", "Blend until completely smooth.", "Taste and adjust sweetness or tanginess if needed (a little honey can be added if cantaloupe isn't very sweet).", "Chill the soup in the refrigerator for at least 30 minutes, or until well-chilled.", "Serve in bowls or glasses, garnished with fresh mint leaves."]
      },
      {
        "name": "Muskmelon (Kharbooja) Shake",
        "description": "A sweet and refreshing Indian-style milkshake.",
        "ingredients": ["2 cups cubed ripe muskmelon (cantaloupe/kharbooja)", "1 cup chilled milk (dairy or non-dairy)", "2-3 tbsp sugar (or to taste)", "1/4 tsp cardamom powder (optional)", "A few ice cubes"],
        "steps": ["Combine cubed muskmelon, chilled milk, sugar, and cardamom powder (if using) in a blender.", "Blend until smooth and frothy.", "Add ice cubes and blend again briefly until the shake is cold and slightly thickened.", "Pour into glasses and serve immediately. Can be garnished with a small melon wedge or a sprinkle of cardamom."]
      }
    ]
  },
  {
    "id": "pineapple",
    "commonName": "Pineapple",
    "scientificName": "Ananas comosus",
    "image": "https://placehold.co/600x416.png",
    "description": "A tropical plant with an edible fruit, consisting of coalesced berries. It's known for its tough, spiky exterior and sweet, tangy yellow flesh.",
    "origin": "South America (Brazil, Paraguay)",
    "localNames": ["Piña (Spanish)", "Ananas (French/German/many other languages)"],
    "regions": ["Costa Rica", "Philippines", "Indonesia", "Thailand", "India", "Brazil"],
    "seasons": ["Year-round availability due to different growing regions, peak varies"],
    "nutrition": {
      "calories": "50 kcal per 100g",
      "macronutrients": [
        { "name": "Protein", "value": 0.5, "unit": "g" },
        { "name": "Carbohydrates", "value": 13, "unit": "g" },
        { "name": "Fat", "value": 0.1, "unit": "g" },
        { "name": "Fiber", "value": 1.4, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 47.8, "unit": "mg", "rdi": "80%" },
        { "name": "Manganese", "value": 0.9, "unit": "mg", "rdi": "46%" }
      ],
      "minerals": [
        { "name": "Potassium", "value": 109, "unit": "mg", "rdi": "3%" }
      ]
    },
    "healthBenefits": [
      "Rich in Vitamin C, an antioxidant that boosts the immune system.",
      "Contains bromelain, an enzyme mixture that aids digestion and has anti-inflammatory properties.",
      "Good source of manganese, important for bone health and metabolism.",
      "May help reduce inflammation and swelling."
    ],
    "potentialAllergies": [
      { "name": "Oral Allergy Syndrome (OAS)", "severity": "Mild", "details": "Can cause itching or tingling in the mouth due to bromelain, especially with very ripe or raw pineapple." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Propagation: Commonly grown from the crown (top) of a mature pineapple fruit, or from slips or suckers.\n2. Climate: Tropical plant, needs warm temperatures, high humidity, and full sun.\n3. Soil: Well-drained, acidic (pH 4.5-6.5), sandy loam soil rich in organic matter.\n4. Planting: Plant the crown after allowing the cut base to dry for a few days. Can be grown in pots or ground.\n5. Watering: Requires regular watering but dislikes waterlogged conditions.\n6. Fertilizing: Feed with a balanced liquid fertilizer every few months during the growing season.\n7. Fruiting: Takes a long time to fruit, often 18-24 months or more from planting a crown.\n8. Harvesting: Fruit is ready when it develops a golden-yellow color at the base and has a strong sweet fragrance.",
    "growthDuration": "18-24 months from planting a crown to first fruit. Plants typically produce one fruit at a time.",
    "sustainabilityTips": [
        "You can grow a new pineapple plant from the top of a store-bought pineapple.",
        "Use pineapple core in smoothies or to infuse water (it's tougher but still flavorful).",
        "Compost pineapple skin and leaves."
    ],
    "carbonFootprintInfo": "High carbon footprint if transported long distances, especially by air (can be 1.5-5 kg CO2e/kg). Canned pineapple generally has a lower footprint than air-freighted fresh pineapple.",
    "staticRecipes": [
      {
        "name": "Grilled Pineapple Slices",
        "description": "Grilling pineapple caramelizes its sugars and enhances its sweetness, perfect as a side or dessert.",
        "ingredients": ["1 ripe pineapple, peeled, cored, and sliced into rings or wedges", "1-2 tbsp melted butter or coconut oil (optional)", "1-2 tsp brown sugar (optional)", "Pinch of cinnamon or chili powder (optional)"],
        "steps": ["Preheat grill to medium-high heat.", "If using, brush pineapple slices lightly with melted butter or coconut oil. If desired, sprinkle with brown sugar and cinnamon/chili powder.", "Place pineapple slices directly on the grill grates.", "Grill for 3-5 minutes per side, or until pineapple is heated through and has nice grill marks.", "Serve warm, on its own, with ice cream, or as a side for grilled meats."]
      },
      {
        "name": "Pineapple Fried Rice",
        "description": "A flavorful and visually appealing fried rice dish, often served in a pineapple shell.",
        "ingredients": ["1 tbsp cooking oil", "2 cloves garlic, minced", "1/2 cup diced chicken, shrimp, or tofu (optional)", "2 cups cooked and chilled rice (day-old rice works best)", "1/2 cup diced fresh pineapple", "1/4 cup peas", "1/4 cup diced carrots", "2 tbsp soy sauce", "1 tbsp fish sauce (optional)", "1 egg, lightly beaten", "Chopped green onions and cashews for garnish"],
        "steps": ["Heat oil in a large skillet or wok over medium-high heat. Add garlic and cook until fragrant (about 30 seconds).", "If using protein, add chicken/shrimp/tofu and cook until done. Remove and set aside.", "Push rice to one side of the wok. Pour beaten egg onto the empty side and scramble until cooked. Mix with the rice.", "Add cooked protein (if used), diced pineapple, peas, and carrots to the wok. Stir-fry for 2-3 minutes.", "Add soy sauce and fish sauce (if using). Stir well to combine all ingredients.", "Serve hot, garnished with chopped green onions and cashews. For a fancier presentation, serve in a hollowed-out pineapple half."]
      },
      {
        "name": "Classic Piña Colada (Non-alcoholic version option)",
        "description": "A sweet and creamy tropical cocktail (or mocktail) featuring pineapple and coconut.",
        "ingredients": ["1 1/2 cups pineapple juice", "1 cup coconut cream or full-fat coconut milk", "1 cup crushed ice", "1/2 cup fresh or frozen pineapple chunks", "(Optional for alcoholic version: 3-4 oz white rum)", "Pineapple wedges and maraschino cherries for garnish"],
        "steps": ["Combine pineapple juice, coconut cream/milk, crushed ice, and pineapple chunks in a blender.", "If making an alcoholic version, add the rum.", "Blend until smooth and frothy.", "Pour into chilled glasses.", "Garnish with a pineapple wedge and a maraschino cherry. Serve immediately."]
      }
    ]
  },
  {
    "id": "pomegranate",
    "commonName": "Pomegranate",
    "scientificName": "Punica granatum",
    "image": "https://placehold.co/600x417.png",
    "description": "A fruit-bearing deciduous shrub or small tree. The fruit is known for its tough reddish rind and hundreds of edible seeds (arils) encased in juicy, gem-like pulp.",
    "origin": "Iran to northern India",
    "localNames": ["Granada (Spanish)", "Grenade (French)", "Anar (Hindi)"],
    "regions": ["India", "China", "Iran", "Turkey", "United States (California)", "Spain"],
    "seasons": ["Autumn", "Early Winter"],
    "nutrition": {
      "calories": "83 kcal per 100g (arils)",
      "macronutrients": [
        { "name": "Protein", "value": 1.7, "unit": "g" },
        { "name": "Carbohydrates", "value": 19, "unit": "g" },
        { "name": "Fat", "value": 1.2, "unit": "g" },
        { "name": "Fiber", "value": 4, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 10.2, "unit": "mg", "rdi": "17%" },
        { "name": "Vitamin K", "value": 16.4, "unit": "µg", "rdi": "21%" },
        { "name": "Folate", "value": 38, "unit": "µg", "rdi": "10%" }
      ],
      "minerals": [
        { "name": "Potassium", "value": 236, "unit": "mg", "rdi": "7%" }
      ]
    },
    "healthBenefits": [
      "Rich in powerful antioxidants, particularly punicalagins and punicic acid.",
      "May have anti-inflammatory effects.",
      "Can contribute to heart health by improving cholesterol levels and blood pressure.",
      "Some research suggests benefits for memory and brain health."
    ],
    "potentialAllergies": [
      { "name": "Pomegranate Allergy", "severity": "Rare", "details": "Allergies are uncommon but can cause reactions in sensitive individuals." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Pomegranates prefer climates with hot, dry summers and cool winters. They are relatively drought-tolerant once established.\n2. Soil: Adaptable to various soils but thrive in well-drained, deep loamy soil. Slightly acidic to neutral pH.\n3. Propagation: Can be grown from seeds, cuttings, or suckers. Plant in full sun.\n4. Watering: Water deeply but infrequently. Allow soil to dry out somewhat between waterings.\n5. Fertilizing: Light fertilization in spring. Avoid over-fertilizing, which can reduce fruit yield.\n6. Pruning: Prune to shape, remove suckers, and thin out dense growth to improve air circulation and light penetration.\n7. Harvesting: Fruits are ready when they develop full color (typically deep red) and make a metallic sound when tapped. They do not ripen further after picking.",
    "growthDuration": "Trees may start bearing fruit in 2-3 years, with good production by 5-6 years.",
    "sustainabilityTips": [
        "Store pomegranates at room temperature for a few days or in the refrigerator for several weeks.",
        "Learn efficient ways to de-seed a pomegranate to avoid waste.",
        "Pomegranate juice can be frozen for later use."
    ],
    "carbonFootprintInfo": "Moderate, depending on origin and transport (0.5-1.0 kg CO2e/kg).",
    "staticRecipes": [
      {
        "name": "How to De-seed a Pomegranate",
        "description": "A simple guide to easily remove the arils (seeds) from a pomegranate.",
        "ingredients": ["1 ripe pomegranate"],
        "steps": [
          "Cut off the crown (flower end) of the pomegranate.",
          "Lightly score the rind vertically from top to bottom in 4-6 sections, without cutting too deep into the fruit.",
          "Submerge the pomegranate in a large bowl of water. Gently break apart the sections under water. The arils will sink to the bottom, and the white membrane will float.",
          "Scoop out the floating membrane and discard. Drain the water and collect the arils.",
          "Alternatively, hold a section over a bowl, cut-side down, and firmly tap the rind with a wooden spoon. The arils should fall out easily."
        ]
      },
      {
        "name": "Pomegranate and Walnut Salad (e.g., Gavurdagi Salatasi variation)",
        "description": "A refreshing and crunchy salad featuring pomegranate seeds and walnuts.",
        "ingredients": ["1 cup pomegranate arils", "1/2 cup chopped walnuts, toasted", "1 cucumber, diced", "2 ripe tomatoes, diced", "1/2 small red onion, thinly sliced or finely chopped", "1/4 cup chopped fresh parsley", "Dressing: 2 tbsp olive oil, 1 tbsp lemon juice, 1 tsp pomegranate molasses (optional), salt and pepper to taste"],
        "steps": ["In a large bowl, combine pomegranate arils, toasted walnuts, diced cucumber, diced tomatoes, red onion, and chopped parsley.", "In a small bowl, whisk together olive oil, lemon juice, pomegranate molasses (if using), salt, and pepper.", "Pour the dressing over the salad and toss gently to combine.", "Serve immediately or chill for 30 minutes to allow flavors to meld."]
      },
      {
        "name": "Pomegranate Molasses Glazed Chicken or Salmon",
        "description": "A tangy and slightly sweet glaze perfect for chicken or fish.",
        "ingredients": ["For the glaze: 1/4 cup pomegranate molasses, 1 tbsp olive oil, 1 tbsp honey or maple syrup, 1 clove garlic (minced), 1/2 tsp Dijon mustard, pinch of salt and pepper", "4 chicken breasts or salmon fillets"],
        "steps": ["Preheat oven to 400°F (200°C) or prepare grill.", "In a small bowl, whisk together all glaze ingredients: pomegranate molasses, olive oil, honey/maple syrup, minced garlic, Dijon mustard, salt, and pepper.", "Season chicken or salmon with additional salt and pepper if desired.", "Brush the chicken/salmon generously with half of the pomegranate glaze.", "Bake or grill the chicken/salmon until cooked through (internal temperature of 165°F for chicken). Basting with remaining glaze during the last few minutes of cooking.", "Let rest for a few minutes before serving. Drizzle with any remaining pan juices or extra glaze."]
      }
    ]
  },
  {
    "id": "sapota",
    "commonName": "Sapota (Chikoo)",
    "scientificName": "Manilkara zapota",
    "image": "https://placehold.co/600x418.png",
    "description": "A long-lived, evergreen tree native to southern Mexico, Central America and the Caribbean. It produces a sweet, fleshy fruit with a grainy texture, often brown on the outside and inside.",
    "origin": "Southern Mexico, Central America, Caribbean",
    "localNames": ["Chikoo (Hindi)", "Nispero (Spanish - can be ambiguous)", "Sapodilla"],
    "regions": ["India", "Thailand", "Mexico", "Indonesia", "Bangladesh", "Pakistan"],
    "seasons": ["Varies, often two crops per year, peak in late winter/spring and late summer/autumn"],
    "nutrition": {
      "calories": "83 kcal per 100g",
      "macronutrients": [
        { "name": "Protein", "value": 0.4, "unit": "g" },
        { "name": "Carbohydrates", "value": 20, "unit": "g" },
        { "name": "Fat", "value": 1.1, "unit": "g" },
        { "name": "Fiber", "value": 5.3, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 14.7, "unit": "mg", "rdi": "25%" },
        { "name": "Folate", "value": 14, "unit": "µg", "rdi": "4%" }
      ],
      "minerals": [
        { "name": "Potassium", "value": 193, "unit": "mg", "rdi": "6%" },
        { "name": "Iron", "value": 0.8, "unit": "mg", "rdi": "4%" }
      ]
    },
    "healthBenefits": [
      "Good source of dietary fiber, promoting digestive health and preventing constipation.",
      "Contains tannins, which have anti-inflammatory and antioxidant properties.",
      "Provides some Vitamin C, supporting the immune system.",
      "Natural sugars offer a quick energy boost."
    ],
    "potentialAllergies": [
      { "name": "Latex Sensitivity", "severity": "Rare", "details": "Unripe fruit contains latex which can cause mouth irritation in some individuals." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Tropical and subtropical, thrives in warm, humid conditions. Drought tolerant once established but needs protection from frost.\n2. Soil: Well-drained, sandy loam or lateritic soils are ideal. Tolerates a range of soil types.\n3. Propagation: Usually by seeds, grafting, or air layering. Seeds may take a long time to fruit and may not be true to type.\n4. Planting: Plant in full sun, providing ample space for growth.\n5. Watering: Young trees require regular watering. Mature trees are drought-resistant but benefit from irrigation during dry spells, especially during fruit development.\n6. Fertilizing: Apply balanced fertilizer during active growth, typically twice a year.\n7. Harvesting: Fruits are picked when they are fully mature but still firm. Maturity is judged by a dull brown color and sometimes a slight give. They ripen off the tree.",
    "growthDuration": "Seedling trees can take 5-8 years to bear fruit. Grafted trees may start in 2-4 years.",
    "sustainabilityTips": [
      "Store unripe sapotas at room temperature until they soften. Ripe ones can be refrigerated for a few days.",
      "Sapota seeds are not edible and should be discarded.",
      "Compost the peel after consuming the fruit."
    ],
    "carbonFootprintInfo": "Moderate, similar to other tropical fruits, depending on transport (0.7-1.4 kg CO2e/kg).",
    "staticRecipes": [
      {
        "name": "Sapota (Chikoo) Milkshake",
        "description": "A creamy and sweet milkshake, popular in South Asia.",
        "ingredients": ["2 ripe sapotas (chikoo), peeled, seeded, and chopped", "1 cup chilled milk", "1-2 tbsp sugar (or to taste)", "1/4 tsp cardamom powder (optional)", "Few ice cubes"],
        "steps": ["Combine chopped sapota, milk, sugar, and cardamom powder (if using) in a blender.", "Blend until smooth and creamy.", "Add ice cubes and blend again briefly.", "Pour into glasses and serve immediately."]
      },
      {
        "name": "Fresh Sapota Slices",
        "description": "The simplest way to enjoy the unique flavor of sapota.",
        "ingredients": ["2-3 ripe sapotas (chikoo)"],
        "steps": ["Wash the sapotas.", "Peel the fruit. The skin is typically not eaten.", "Slice the fruit in half and remove the black, shiny seeds from the center.", "Cut the flesh into slices or wedges.", "Serve immediately. Some enjoy a sprinkle of chaat masala for a tangy twist."]
      },
      {
        "name": "Sapota Kheer (Pudding)",
        "description": "A sweet Indian dessert made with sapota pulp, milk, and nuts.",
        "ingredients": ["1 cup sapota pulp (from 3-4 ripe sapotas, peeled and seeded)", "2 cups full-fat milk", "1/4 cup sugar (adjust to taste)", "2 tbsp chopped mixed nuts (almonds, cashews, pistachios)", "A few strands of saffron (optional)", "1/4 tsp cardamom powder"],
        "steps": ["In a heavy-bottomed pan, bring the milk to a boil. Reduce heat and simmer, stirring occasionally, until the milk thickens slightly (about 15-20 minutes).", "Add sugar and saffron (if using) to the milk. Stir until sugar dissolves.", "Add the sapota pulp and cardamom powder. Mix well and cook for another 5-7 minutes, stirring continuously, until the kheer thickens to desired consistency.", "Remove from heat and let it cool slightly. Garnish with chopped nuts.", "Serve warm or chilled."]
      }
    ]
  },
  {
    "id": "lychee",
    "commonName": "Lychee",
    "scientificName": "Litchi chinensis",
    "image": "https://placehold.co/600x419.png",
    "description": "A tropical tree native to the Guangdong and Fujian provinces of southeastern China. The fruit is a drupe, with a rough, red rind and sweet, translucent white flesh.",
    "origin": "Southeastern China",
    "localNames": ["Lichi (Spanish)", "Litchi (French)", "Leechee"],
    "regions": ["China", "India", "Thailand", "Vietnam", "Madagascar", "South Africa", "Australia", "United States (Florida, Hawaii)"],
    "seasons": ["Early to Mid Summer"],
    "nutrition": {
      "calories": "66 kcal per 100g",
      "macronutrients": [
        { "name": "Protein", "value": 0.8, "unit": "g" },
        { "name": "Carbohydrates", "value": 17, "unit": "g" },
        { "name": "Fat", "value": 0.4, "unit": "g" },
        { "name": "Fiber", "value": 1.3, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 71.5, "unit": "mg", "rdi": "119%" }
      ],
      "minerals": [
        { "name": "Potassium", "value": 171, "unit": "mg", "rdi": "5%" },
        { "name": "Copper", "value": 0.148, "unit": "mg", "rdi": "16%" }
      ]
    },
    "healthBenefits": [
      "Excellent source of Vitamin C, an antioxidant that boosts immunity.",
      "Contains oligonol, a polyphenol with antioxidant and anti-influenza virus activities.",
      "Good source of copper, important for red blood cell formation and nerve function.",
      "Provides B-complex vitamins like riboflavin and niacin."
    ],
    "potentialAllergies": [
      { "name": "Lychee Allergy", "severity": "Rare", "details": "Uncommon, but can cause reactions like itching or hives in sensitive individuals." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Subtropical to tropical, requiring warm, humid summers and cool, dry, frost-free winters for good fruit set.\n2. Soil: Prefers well-drained, slightly acidic (pH 5.5-6.5) soil rich in organic matter.\n3. Propagation: Usually by air layering (marcotting) for true-to-type fruit. Seeds can be grown but are unreliable.\n4. Planting: Plant in full sun with protection from strong winds.\n5. Watering: Requires regular and abundant watering, especially during flowering and fruit development. Do not let soil dry out completely.\n6. Fertilizing: Feed with a balanced fertilizer suitable for fruit trees, especially during active growth phases.\n7. Pruning: Prune after harvest to shape the tree and encourage new growth for the next season's fruit.\n8. Harvesting: Fruits are harvested in bunches when the skin turns bright red and the fruit is plump and fragrant. They do not ripen further after picking.",
    "growthDuration": "Air-layered trees can start bearing fruit in 3-5 years. Fruit matures 60-100 days after flowering.",
    "sustainabilityTips": [
      "Store lychees in the refrigerator in a plastic bag; they lose quality quickly at room temperature.",
      "Lychee skin is not edible; compost it.",
      "Enjoy fresh during their short season; canned lychees are also available."
    ],
    "carbonFootprintInfo": "Can be high if air-freighted due to their perishability and short season (1.0-3.0 kg CO2e/kg or more).",
    "staticRecipes": [
      {
        "name": "Fresh Lychees",
        "description": "The best way to enjoy the delicate flavor of lychees is fresh and chilled.",
        "ingredients": ["1 lb fresh lychees"],
        "steps": ["Wash lychees gently under cold water.", "To eat, gently peel away the rough red skin with your fingers or a small knife. The skin should come off easily if the fruit is ripe.", "The translucent white flesh is edible. There is a single, dark brown seed in the center which is not edible and should be discarded.", "Serve chilled for best flavor."]
      },
      {
        "name": "Lychee Martini (or Mocktail)",
        "description": "An elegant and fragrant cocktail showcasing the sweet taste of lychee.",
        "ingredients": ["For Martini: 2 oz vodka or gin, 1 oz lychee liqueur or lychee syrup (from canned lychees), 1/2 oz dry vermouth (optional), 1-2 fresh or canned lychees for garnish", "For Mocktail: 3 oz lychee juice or puree, 1 oz lime juice, sparkling water or club soda to top, 1-2 lychees for garnish"],
        "steps": ["For Martini: Chill a martini glass. Combine vodka/gin, lychee liqueur/syrup, and vermouth (if using) in a shaker with ice. Shake well until chilled. Strain into the chilled martini glass. Garnish with a lychee.", "For Mocktail: Fill a glass with ice. Add lychee juice/puree and lime juice. Stir. Top with sparkling water or club soda. Garnish with a lychee."]
      },
      {
        "name": "Lychee and Coconut Panna Cotta",
        "description": "A creamy Italian dessert with a tropical twist of lychee and coconut.",
        "ingredients": ["1 can (13.5 oz) full-fat coconut milk", "1/2 cup heavy cream", "1/4 cup sugar", "1 tsp agar-agar powder (or 1 tbsp gelatin bloomed in 2 tbsp water)", "1 cup lychee pulp (fresh or canned, drained and pureed)", "1 tsp vanilla extract", "Fresh lychees and mint for garnish"],
        "steps": ["In a saucepan, combine coconut milk, heavy cream, and sugar. Whisk in agar-agar powder (if using gelatin, bloom it first and add later).", "Bring the mixture to a gentle simmer over medium heat, whisking constantly until sugar and agar-agar are dissolved. Simmer for 2 minutes.", "Remove from heat. If using gelatin, stir it in now until dissolved.", "Stir in lychee pulp and vanilla extract.", "Pour the mixture into individual ramekins or a serving dish.", "Chill in the refrigerator for at least 4 hours, or until set.", "To serve, garnish with fresh lychee halves and mint leaves."]
      }
    ]
  },
  {
    "id": "custard-apple",
    "commonName": "Custard Apple (Sitaphal)",
    "scientificName": "Annona squamosa",
    "image": "https://placehold.co/600x420.png",
    "description": "A tropical fruit with a knobby, greenish skin and sweet, creamy white flesh segmented around numerous black seeds. It has a custard-like texture and flavor.",
    "origin": "Tropical Americas and West Indies",
    "localNames": ["Sitaphal (Hindi)", "Sugar Apple", "Sweetsop", "Anón (Spanish)"],
    "regions": ["India", "Thailand", "Philippines", "Indonesia", "Brazil", "Australia", "United States (Florida)"],
    "seasons": ["Late Summer to Early Winter"],
    "nutrition": {
      "calories": "101 kcal per 100g",
      "macronutrients": [
        { "name": "Protein", "value": 1.7, "unit": "g" },
        { "name": "Carbohydrates", "value": 25, "unit": "g" },
        { "name": "Fat", "value": 0.6, "unit": "g" },
        { "name": "Fiber", "value": 2.4, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 19.2, "unit": "mg", "rdi": "32%" },
        { "name": "Vitamin B6", "value": 0.221, "unit": "mg", "rdi": "13%" }
      ],
      "minerals": [
        { "name": "Potassium", "value": 382, "unit": "mg", "rdi": "11%" },
        { "name": "Magnesium", "value": 21, "unit": "mg", "rdi": "5%" }
      ]
    },
    "healthBenefits": [
      "Good source of Vitamin C, boosting the immune system.",
      "Contains Vitamin B6, important for brain health and development.",
      "Rich in potassium, which helps regulate blood pressure.",
      "Provides dietary fiber, aiding in digestion."
    ],
    "potentialAllergies": [
      { "name": "Seed Toxicity", "severity": "Moderate", "details": "Custard apple seeds contain neurotoxins and should not be consumed. Always remove seeds." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Tropical and subtropical, requires warm temperatures and is sensitive to frost.\n2. Soil: Well-drained, fertile soil with good organic matter. Tolerates a range of soil types but prefers pH 6.0-7.5.\n3. Propagation: Primarily by seeds, which germinate readily. Grafting is used for superior varieties.\n4. Planting: Plant in full sun. Trees can grow quite large.\n5. Watering: Regular watering is needed, especially for young trees and during dry periods. Avoid waterlogging.\n6. Fertilizing: Apply balanced fertilizer during growth periods.\n7. Pollination: May require hand pollination in some areas for good fruit set due to dichogamy (male and female parts mature at different times).\n8. Harvesting: Fruits are harvested when they are mature (skin turns lighter green, segments slightly separate) but still firm. They ripen quickly off the tree.",
    "growthDuration": "Seedling trees may bear fruit in 3-5 years. Fruit ripens 3-4 months after flowering.",
    "sustainabilityTips": [
      "Store unripe custard apples at room temperature until they yield to gentle pressure. Ripe fruit can be refrigerated for 1-2 days.",
      "The fruit is typically broken open, and the fleshy segments are eaten, spitting out the seeds.",
      "Compost the skin and discarded seeds."
    ],
    "carbonFootprintInfo": "Moderate, typical for tropical fruits needing specific climates and transport (0.8-1.5 kg CO2e/kg).",
    "staticRecipes": [
      {
        "name": "Eating Fresh Custard Apple",
        "description": "The most common way to enjoy this fruit is by eating its creamy flesh directly.",
        "ingredients": ["1 ripe custard apple"],
        "steps": ["Select a custard apple that yields slightly to gentle pressure.", "Wash the fruit.", "Gently break or cut the fruit open. The segments of creamy white flesh will be visible, each surrounding a black seed.", "Scoop out the fleshy segments with a spoon or your fingers. Eat the flesh and discard the black seeds (do not eat the seeds).", "The skin is not typically eaten."]
      },
      {
        "name": "Custard Apple (Sitaphal) Milkshake",
        "description": "A delicious and creamy milkshake made from the pulp of custard apple.",
        "ingredients": ["Pulp of 1-2 ripe custard apples (seeds removed)", "1 cup chilled milk", "1-2 tbsp sugar (or to taste, custard apples are quite sweet)", "A few ice cubes", "Pinch of cardamom powder (optional)"],
        "steps": ["Carefully scoop out the flesh from the ripe custard apple and remove all black seeds. This might take some patience.", "Combine the deseeded custard apple pulp, chilled milk, sugar, and cardamom powder (if using) in a blender.", "Blend until smooth and creamy.", "Add ice cubes and blend again briefly.", "Pour into glasses and serve immediately."]
      },
      {
        "name": "Custard Apple Rabri (Sitaphal Rabri)",
        "description": "A rich Indian dessert where custard apple pulp is added to thickened, sweetened milk.",
        "ingredients": ["4 cups full-fat milk", "1/2 cup sugar (adjust to taste)", "Pulp of 2 ripe custard apples (seeds removed)", "1/4 tsp cardamom powder", "2 tbsp chopped mixed nuts (almonds, pistachios) for garnish", "A few strands of saffron (optional)"],
        "steps": ["In a heavy, wide pan, bring the milk to a boil. Reduce heat to medium-low.", "Simmer the milk, stirring frequently to prevent scorching and a skin from forming on top. Scrape the sides of the pan regularly and add the collected cream back into the milk. Continue to simmer until the milk reduces to about half its original volume and thickens (this can take 30-45 minutes).", "Add sugar and saffron (if using). Stir until the sugar dissolves completely.", "Stir in the cardamom powder.", "Remove from heat and let the thickened milk (rabri) cool down completely.", "Once cooled, gently fold in the deseeded custard apple pulp.", "Chill in the refrigerator for at least 2-3 hours.", "Serve chilled, garnished with chopped nuts."]
      }
    ]
  },
  {
    "id": "lemon",
    "commonName": "Lemon",
    "scientificName": "Citrus limon",
    "image": "https://placehold.co/600x421.png",
    "description": "A species of small evergreen trees in the flowering plant family Rutaceae, native to Asia, primarily Northeast India (Assam), Northern Myanmar or China. The tree's ellipsoidal yellow fruit is used for culinary and non-culinary purposes throughout the world.",
    "origin": "Northeast India, Northern Myanmar or China",
    "localNames": ["Limón (Spanish)", "Citron (French)", "Zitrone (German)"],
    "regions": ["India", "Mexico", "China", "Argentina", "Brazil", "Spain", "Turkey", "United States (California, Arizona)"],
    "seasons": ["Year-round, with peaks depending on variety and region"],
    "nutrition": {
      "calories": "29 kcal per 100g (raw fruit without peel)",
      "macronutrients": [
        { "name": "Protein", "value": 1.1, "unit": "g" },
        { "name": "Carbohydrates", "value": 9.3, "unit": "g" },
        { "name": "Fat", "value": 0.3, "unit": "g" },
        { "name": "Fiber", "value": 2.8, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 53, "unit": "mg", "rdi": "88%" }
      ],
      "minerals": [
        { "name": "Potassium", "value": 138, "unit": "mg", "rdi": "4%" }
      ]
    },
    "healthBenefits": [
      "Excellent source of Vitamin C, a powerful antioxidant that supports the immune system and skin health.",
      "May aid in digestion and relieve indigestion.",
      "Citric acid content may help prevent kidney stones.",
      "Antioxidants in lemons can help protect against cell damage."
    ],
    "potentialAllergies": [
      { "name": "Citrus Allergy", "severity": "Mild", "details": "Can cause skin irritation (contact dermatitis) or oral allergy symptoms in sensitive individuals. Usually mild." },
      { "name": "Tooth Enamel Erosion", "severity": "Varies", "details": "High acidity can erode tooth enamel over time if consumed frequently in large amounts without dilution or rinsing."}
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Subtropical, thrives in warm climates but can tolerate cooler temperatures better than other citrus. Needs full sun.\n2. Soil: Well-drained, slightly acidic (pH 6.0-7.0) loamy soil. Good drainage is crucial.\n3. Propagation: Usually by grafting or budding onto rootstock. Can be grown from seed, but may not be true to type and takes longer to fruit.\n4. Planting: Plant in a sunny, sheltered location. Can be grown in containers.\n5. Watering: Regular, deep watering, especially during dry periods and fruit development. Allow soil to dry slightly between waterings.\n6. Fertilizing: Feed regularly with a balanced citrus fertilizer, especially during active growth and fruiting seasons.\n7. Pruning: Prune to shape, remove dead or crossing branches, and improve air circulation.\n8. Harvesting: Lemons can be harvested at various stages of ripeness, often when they reach full size and have a good yellow color (some varieties are picked green). They can often be left on the tree for extended periods.",
    "growthDuration": "Grafted trees can start bearing fruit in 2-3 years. Lemons often fruit year-round in suitable climates, with peak harvest seasons.",
    "sustainabilityTips": [
      "Store lemons at room temperature for about a week, or in the refrigerator for several weeks.",
      "Use the entire lemon: zest for flavoring, juice for drinks and cooking. Lemon peels can be candied or used in cleaning.",
      "Freeze lemon juice in ice cube trays for later use."
    ],
    "carbonFootprintInfo": "Generally moderate (0.4-0.8 kg CO2e/kg), depending on origin, transport, and whether greenhouse-grown.",
    "staticRecipes": [
      {
        "name": "Classic Lemonade",
        "description": "A refreshing and tangy homemade drink, perfect for a hot day.",
        "ingredients": ["1 cup freshly squeezed lemon juice (about 4-6 lemons)", "1 cup granulated sugar (or to taste)", "4-5 cups cold water", "Ice cubes", "Lemon slices and mint sprigs for garnish (optional)"],
        "steps": ["In a small saucepan, combine sugar and 1 cup of water. Heat over medium heat, stirring, until the sugar is completely dissolved. This is your simple syrup. Let it cool.", "In a large pitcher, combine lemon juice, cooled simple syrup, and the remaining 3-4 cups of cold water. Stir well.", "Taste and adjust sweetness or tartness by adding more sugar/syrup or lemon juice/water as needed.", "Serve over ice, garnished with lemon slices and mint sprigs if desired."]
      },
      {
        "name": "Lemon Herb Roasted Chicken",
        "description": "A flavorful and juicy roasted chicken infused with lemon and herbs.",
        "ingredients": ["1 whole chicken (3-4 lbs)", "1-2 lemons, halved or quartered", "4-5 sprigs fresh rosemary or thyme (or 1-2 tsp dried)", "3-4 cloves garlic, smashed", "2 tbsp olive oil", "Salt and freshly ground black pepper to taste"],
        "steps": ["Preheat oven to 400°F (200°C).", "Rinse the chicken inside and out, and pat dry with paper towels.", "Stuff the chicken cavity with half of the lemon pieces, garlic cloves, and herb sprigs.", "Place the chicken in a roasting pan. Rub the outside of the chicken with olive oil. Squeeze the juice of the remaining lemon over the chicken and place the squeezed lemon pieces around/under the chicken.", "Season generously with salt and pepper. Scatter remaining herbs over the chicken.", "Roast for 1 hour to 1 hour 30 minutes, or until the internal temperature reaches 165°F (74°C) in the thickest part of the thigh and juices run clear. Baste occasionally with pan juices.", "Let the chicken rest for 10-15 minutes before carving and serving."]
      },
      {
        "name": "Simple Lemon Vinaigrette",
        "description": "A bright and versatile salad dressing.",
        "ingredients": ["1/4 cup extra virgin olive oil", "2 tbsp freshly squeezed lemon juice", "1 tsp Dijon mustard", "1/2 tsp honey or maple syrup (optional, for sweetness)", "1 small clove garlic, minced (optional)", "Salt and freshly ground black pepper to taste"],
        "steps": ["In a small bowl or jar, combine olive oil, lemon juice, Dijon mustard, honey/maple syrup (if using), and minced garlic (if using).", "Whisk well or shake the jar vigorously until the dressing is emulsified (thickened and well-combined).", "Season with salt and pepper to taste.", "Use immediately on salads or store in an airtight container in the refrigerator for up to a week."]
      }
    ]
  },
  {
    "id": "sweet-lime",
    "commonName": "Sweet Lime (Mosambi)",
    "scientificName": "Citrus limetta",
    "image": "https://placehold.co/600x422.png",
    "description": "A citrus fruit, typically round to oval, with a greenish-yellow rind when ripe and a sweet, mild, low-acid pulp. It's less tart than a lemon.",
    "origin": "Southeast Asia (likely India or Malaysia)",
    "localNames": ["Mosambi (Hindi)", "Mausambi", "Musambi", "Limu Shirin (Persian)"],
    "regions": ["India", "Pakistan", "Egypt", "Vietnam", "Mediterranean basin"],
    "seasons": ["Primarily Summer and Monsoon season (in India)"],
    "nutrition": {
      "calories": "43 kcal per 100g",
      "macronutrients": [
        { "name": "Protein", "value": 0.8, "unit": "g" },
        { "name": "Carbohydrates", "value": 9.3, "unit": "g" },
        { "name": "Fat", "value": 0.3, "unit": "g" },
        { "name": "Fiber", "value": 0.5, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 50, "unit": "mg", "rdi": "83%" }
      ],
      "minerals": [
        { "name": "Potassium", "value": 490, "unit": "mg", "rdi": "14%" }
      ]
    },
    "healthBenefits": [
      "Excellent source of Vitamin C, boosting the immune system.",
      "High in potassium, which can help manage blood pressure.",
      "Aids in hydration due to high water content.",
      "May improve digestion and relieve constipation due to its mild acidity and flavonoids."
    ],
    "potentialAllergies": [
      { "name": "Citrus Allergy", "severity": "Mild", "details": "Less common than with more acidic citrus, but can cause oral allergy symptoms or skin irritation in sensitive individuals." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Subtropical, prefers warm climates with distinct summers and winters, but is sensitive to frost.\n2. Soil: Well-drained, loamy soil is ideal. pH 6.0-7.5.\n3. Propagation: Usually by budding or grafting onto suitable rootstock. Can be grown from seeds, but may not be true to type.\n4. Planting: Plant in full sun with good air circulation.\n5. Watering: Regular watering, especially during dry periods and fruit development. Avoid waterlogging.\n6. Fertilizing: Requires regular fertilization with a balanced citrus fertilizer.\n7. Pruning: Prune to shape the tree, remove dead wood, and improve light penetration.\n8. Harvesting: Fruits are picked when they reach full size and the skin turns from green to light greenish-yellow. They should feel slightly soft to the touch.",
    "growthDuration": "Grafted trees may start bearing fruit in 3-4 years. Fruit typically matures in 6-9 months after flowering.",
    "sustainabilityTips": [
      "Store at room temperature for a few days or in the refrigerator for longer life.",
      "Sweet lime juice is best consumed fresh as it can turn bitter if stored for too long.",
      "Compost the peels."
    ],
    "carbonFootprintInfo": "Moderate, similar to other citrus fruits, depending on origin and transport (0.4-0.9 kg CO2e/kg).",
    "staticRecipes": [
      {
        "name": "Fresh Mosambi (Sweet Lime) Juice",
        "description": "A popular and refreshing juice, especially in India.",
        "ingredients": ["3-4 ripe sweet limes (mosambi)", "Pinch of black salt (kala namak) or regular salt (optional)", "1/2 tsp sugar (optional, if limes are not very sweet)"],
        "steps": ["Wash the sweet limes.", "Cut them in half.", "Extract the juice using a citrus juicer (manual or electric). Avoid pressing too hard on the peel to prevent bitterness.", "Strain the juice if desired.", "Add salt and sugar (if using) to taste. Stir well.", "Serve immediately, chilled or with ice."]
      },
      {
        "name": "Sweet Lime and Mint Cooler",
        "description": "A refreshing drink with sweet lime and fresh mint.",
        "ingredients": ["1 cup fresh sweet lime juice", "1/4 cup fresh mint leaves", "1 tbsp sugar or honey (optional)", "1/2 cup sparkling water or club soda", "Ice cubes"],
        "steps": ["Gently muddle mint leaves with sugar/honey (if using) in a sturdy glass or shaker.", "Add sweet lime juice and ice cubes. Stir or shake well.", "Strain into a serving glass filled with fresh ice.", "Top with sparkling water or club soda.", "Garnish with a mint sprig and a slice of sweet lime."]
      },
      {
        "name": "Sweet Lime Salad with Chaat Masala",
        "description": "A simple fruit salad highlighting the flavor of sweet lime with a tangy twist.",
        "ingredients": ["2 ripe sweet limes, peeled and segmented (membranes removed if desired)", "1/2 apple, diced (optional)", "1/2 cucumber, diced (optional)", "1/4 tsp chaat masala", "Pinch of black salt (optional)"],
        "steps": ["Gently combine sweet lime segments, diced apple (if using), and diced cucumber (if using) in a bowl.", "Sprinkle chaat masala and black salt (if using) over the fruits.", "Toss gently to coat.", "Serve immediately or chilled."]
      }
    ]
  },
  {
    "id": "jackfruit",
    "commonName": "Jackfruit",
    "scientificName": "Artocarpus heterophyllus",
    "image": "https://placehold.co/600x423.png",
    "description": "A species of tree in the fig, mulberry, and breadfruit family. Its fruit is the largest tree-borne fruit, reaching as much as 55 kg in weight. Ripe jackfruit is sweet, while unripe jackfruit has a neutral flavor and meat-like texture, often used in savory dishes.",
    "origin": "Southwestern India (Western Ghats)",
    "localNames": ["Kathal (Hindi)", "Jaca (Spanish/Portuguese)", "Nangka (Malay/Indonesian)"],
    "regions": ["India", "Bangladesh", "Thailand", "Indonesia", "Vietnam", "Brazil", "Sri Lanka"],
    "seasons": ["Primarily Summer, can vary with region and type"],
    "nutrition": {
      "calories": "95 kcal per 100g (ripe fruit pulp)",
      "macronutrients": [
        { "name": "Protein", "value": 1.7, "unit": "g" },
        { "name": "Carbohydrates", "value": 23, "unit": "g" },
        { "name": "Fat", "value": 0.6, "unit": "g" },
        { "name": "Fiber", "value": 1.5, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 13.7, "unit": "mg", "rdi": "23%" },
        { "name": "Vitamin B6", "value": 0.329, "unit": "mg", "rdi": "19%" }
      ],
      "minerals": [
        { "name": "Potassium", "value": 448, "unit": "mg", "rdi": "13%" },
        { "name": "Magnesium", "value": 29, "unit": "mg", "rdi": "7%" }
      ]
    },
    "healthBenefits": [
      "Good source of dietary fiber, aiding digestion.",
      "Contains Vitamin C and B6, supporting immunity and brain function.",
      "Rich in potassium, which helps regulate blood pressure.",
      "Unripe jackfruit is a popular meat substitute for vegetarians and vegans due to its texture."
    ],
    "potentialAllergies": [
      { "name": "Latex Allergy Cross-Reactivity", "severity": "Mild", "details": "Some individuals with latex allergy may experience reactions, though less common than with fruits like banana or avocado." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Tropical and subtropical, thrives in warm, humid climates. Sensitive to frost.\n2. Soil: Deep, well-drained, alluvial or loamy soils are best. Tolerates a variety of soils but not waterlogged conditions.\n3. Propagation: Primarily grown from seeds, which should be planted fresh. Grafting is used for select cultivars.\n4. Planting: Plant in full sun with ample space for a large tree.\n5. Watering: Young trees require regular watering. Mature trees are relatively drought-tolerant but benefit from irrigation during dry periods, especially during fruit development.\n6. Fertilizing: Benefit from regular application of organic manure and balanced fertilizers.\n7. Harvesting: Jackfruit is harvested at different stages. Young, unripe fruit for vegetable use is picked when small and green. Ripe fruit is harvested when it emits a strong aroma, the skin turns slightly yellowish-brown, and the spines flatten or yield to pressure.",
    "growthDuration": "Seedling trees can take 3-8 years to bear fruit. Fruits take 3-8 months to mature on the tree.",
    "sustainabilityTips": [
      "Jackfruit is a large fruit; one fruit can provide many meals. Plan accordingly to avoid waste.",
      "Unripe jackfruit can be stored at room temperature for a few days. Ripe jackfruit or its pods should be refrigerated.",
      "Jackfruit seeds are edible when cooked (boiled or roasted) and are nutritious."
    ],
    "carbonFootprintInfo": "Moderate to high, depending on transport due to its size and weight (0.8-2.0 kg CO2e/kg).",
    "staticRecipes": [
      {
        "name": "Pulled Jackfruit (BBQ Sandwich Filling)",
        "description": "A popular vegetarian alternative to pulled pork, using unripe jackfruit.",
        "ingredients": ["2 cans (20 oz each) young green jackfruit in brine or water, drained and rinsed", "1 tbsp olive oil", "1 onion, chopped", "2 cloves garlic, minced", "1 cup BBQ sauce", "1 tbsp apple cider vinegar", "1 tsp smoked paprika", "Salt and pepper to taste", "Burger buns or rolls for serving"],
        "steps": ["Rinse and drain the jackfruit. Remove the core and any tough outer pieces. Shred the jackfruit pieces with your fingers or two forks.", "Heat olive oil in a large skillet over medium heat. Add onion and cook until softened, about 5 minutes. Add garlic and cook for 1 minute more.", "Add the shredded jackfruit to the skillet. Cook for 5-7 minutes, stirring occasionally, until it starts to brown slightly.", "In a small bowl, mix BBQ sauce, apple cider vinegar, and smoked paprika.", "Pour the sauce over the jackfruit. Stir well to coat. Reduce heat to low, cover, and simmer for 15-20 minutes, allowing the jackfruit to absorb the flavors. Add a little water if it becomes too dry.", "Uncover and cook for another 5-10 minutes, stirring, until some of the liquid has evaporated and the jackfruit is tender and easily shreddable. Season with salt and pepper to taste.", "Serve hot on buns as a sandwich filling, often with coleslaw."]
      },
      {
        "name": "Ripe Jackfruit Pods (Fresh)",
        "description": "Enjoying the sweet, aromatic flesh of ripe jackfruit pods.",
        "ingredients": ["1 section of ripe jackfruit"],
        "steps": ["Handling ripe jackfruit can be sticky due to latex. It's advisable to oil your hands and knife before cutting.", "Cut the ripe jackfruit section open. You will see large, fleshy pods (bulbs) surrounding seeds.", "Carefully extract the yellow to orange fleshy pods. Each pod contains a large seed.", "The fleshy pod is eaten raw. It has a sweet, tropical flavor. The seeds are not eaten raw but can be boiled or roasted separately.", "Store unused pods in an airtight container in the refrigerator."]
      },
      {
        "name": "Jackfruit Seed Curry (Side Dish)",
        "description": "A South Indian style curry made with nutritious jackfruit seeds.",
        "ingredients": ["1 cup jackfruit seeds, outer white skin removed", "1 onion, chopped", "1 tomato, chopped", "1 inch ginger, grated", "2 cloves garlic, minced", "1/2 tsp turmeric powder", "1 tsp red chili powder (or to taste)", "1 tsp coriander powder", "1/2 tsp cumin powder", "1/4 cup grated coconut (optional)", "Salt to taste", "1 tbsp oil", "Mustard seeds, curry leaves for tempering"],
        "steps": ["Boil or pressure cook the jackfruit seeds until tender (they should be easily mashable). Peel off the thin brown inner skin once cooled slightly. Roughly chop or halve the cooked seeds.", "Heat oil in a pan. Add mustard seeds; when they splutter, add curry leaves.", "Add chopped onion and sauté until golden brown. Add ginger and garlic, sauté for a minute.", "Add chopped tomato and cook until soft.", "Add turmeric powder, chili powder, coriander powder, cumin powder, and salt. Sauté for a minute.", "Add the cooked jackfruit seeds and grated coconut (if using). Mix well. Add about 1/2 cup of water, cover, and simmer for 5-7 minutes, allowing flavors to combine.", "Serve hot as a side dish with rice or roti."]
      }
    ]
  },
  {
    "id": "starfruit",
    "commonName": "Starfruit (Carambola)",
    "scientificName": "Averrhoa carambola",
    "image": "https://placehold.co/600x424.png",
    "description": "A tropical fruit with a distinctive star shape when sliced. The fruit has a waxy skin and can range from tart to sweet, with a juicy, crisp texture.",
    "origin": "Southeast Asia (likely Sri Lanka or Moluccas, Indonesia)",
    "localNames": ["Carambola (Spanish/Portuguese/English)", "Kamrakh (Hindi)"],
    "regions": ["Malaysia", "Indonesia", "Philippines", "India", "Thailand", "Taiwan", "Brazil", "United States (Florida, Hawaii)"],
    "seasons": ["Varies, can fruit multiple times a year, often in fall and winter"],
    "nutrition": {
      "calories": "31 kcal per 100g",
      "macronutrients": [
        { "name": "Protein", "value": 1, "unit": "g" },
        { "name": "Carbohydrates", "value": 6.7, "unit": "g" },
        { "name": "Fat", "value": 0.3, "unit": "g" },
        { "name": "Fiber", "value": 2.8, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 34.4, "unit": "mg", "rdi": "57%" }
      ],
      "minerals": [
        { "name": "Potassium", "value": 133, "unit": "mg", "rdi": "4%" }
      ]
    },
    "healthBenefits": [
      "Good source of Vitamin C, an antioxidant supporting the immune system.",
      "Contains dietary fiber, aiding in digestion.",
      "Low in calories and sugar, making it a healthy snack option.",
      "Provides antioxidants that help combat free radicals."
    ],
    "potentialAllergies": [
      { "name": "Oxalic Acid Content", "severity": "Moderate", "details": "Contains high levels of oxalic acid. Individuals with kidney problems (especially kidney failure or those on dialysis) should avoid starfruit as it can cause nephrotoxicity and neurotoxicity (starfruit poisoning)." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Tropical and subtropical, needs warm, humid conditions. Sensitive to frost and strong winds.\n2. Soil: Prefers well-drained, fertile, loamy soil rich in organic matter. Slightly acidic pH (5.5-6.5).\n3. Propagation: Can be grown from seeds, but grafting or budding onto seedling rootstock is common for better varieties.\n4. Planting: Plant in full sun to partial shade. Ensure good drainage.\n5. Watering: Requires regular watering, especially during dry periods and fruit development. Do not overwater.\n6. Fertilizing: Apply balanced fertilizer suitable for fruit trees during active growth.\n7. Pruning: Light pruning to shape the tree and remove dead or crowded branches.\n8. Harvesting: Fruits are harvested when they are fully grown, and the color changes from green to yellow or yellowish-orange (depending on variety). They are picked by hand.",
    "growthDuration": "Trees may start bearing fruit in 2-4 years. Fruits mature 60-75 days after flowering.",
    "sustainabilityTips": [
      "Store starfruit at room temperature until ripe, then refrigerate for a few days.",
      "The entire fruit is edible, including the waxy skin. Just wash, slice, and eat.",
      "Can be juiced, added to salads, or used as a garnish."
    ],
    "carbonFootprintInfo": "Moderate, depending on transport from tropical regions (0.7-1.5 kg CO2e/kg).",
    "staticRecipes": [
      {
        "name": "Fresh Starfruit Slices",
        "description": "The easiest way to enjoy starfruit is by slicing it to reveal its star shape.",
        "ingredients": ["1-2 ripe starfruits"],
        "steps": ["Wash the starfruit thoroughly under running water.", "Trim off the greenish or brownish edges of the five ridges if they are tough or discolored.", "Slice the fruit crosswise into 1/4 to 1/2 inch thick slices. Each slice will look like a star.", "Remove any visible seeds if desired (though small seeds are often edible).", "Serve fresh. They can be eaten as is, added to fruit salads, or used as a garnish."]
      },
      {
        "name": "Starfruit Juice",
        "description": "A refreshing and slightly tangy juice.",
        "ingredients": ["2-3 ripe starfruits, washed and roughly chopped (ends trimmed)", "1/2 cup water", "1-2 tbsp sugar or honey (to taste, optional)", "Pinch of salt (optional)"],
        "steps": ["Combine chopped starfruit and water in a blender.", "Blend until smooth.", "Strain the mixture through a fine-mesh sieve or cheesecloth to remove pulp and any seeds.", "Stir in sugar/honey and salt if using. Taste and adjust sweetness.", "Serve chilled over ice."]
      },
      {
        "name": "Starfruit and Ginger Relish",
        "description": "A zesty relish that can be served with grilled meats or fish.",
        "ingredients": ["2 ripe starfruits, finely diced", "1 tbsp finely grated fresh ginger", "1 small red chili, minced (optional)", "1/4 cup chopped fresh cilantro", "2 tbsp lime juice", "1 tbsp rice vinegar", "1 tsp sugar", "Pinch of salt"],
        "steps": ["In a medium bowl, combine diced starfruit, grated ginger, minced chili (if using), and chopped cilantro.", "In a small bowl, whisk together lime juice, rice vinegar, sugar, and salt until the sugar is dissolved.", "Pour the dressing over the starfruit mixture and toss gently to combine.", "Let the relish sit for at least 15-20 minutes at room temperature to allow flavors to meld before serving."]
      }
    ]
  },
  {
    "id": "fig",
    "commonName": "Fig (Anjeer)",
    "scientificName": "Ficus carica",
    "image": "https://placehold.co/600x425.png",
    "description": "A species of flowering plant in the mulberry family, known as the common fig. It is the source of the fruit also called the fig and as such is an important crop in those areas where it is grown commercially. Native to the Mediterranean and western Asia.",
    "origin": "Western Asia and Mediterranean region",
    "localNames": ["Anjeer (Hindi)", "Higo (Spanish)", "Figue (French)"],
    "regions": ["Turkey", "Egypt", "Morocco", "Iran", "Spain", "Greece", "United States (California)"],
    "seasons": ["Late Summer to Early Autumn (fresh figs have a short season)"],
    "nutrition": {
      "calories": "74 kcal per 100g (fresh)",
      "macronutrients": [
        { "name": "Protein", "value": 0.8, "unit": "g" },
        { "name": "Carbohydrates", "value": 19, "unit": "g" },
        { "name": "Fat", "value": 0.3, "unit": "g" },
        { "name": "Fiber", "value": 2.9, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin K", "value": 4.7, "unit": "µg", "rdi": "6%" },
        { "name": "Vitamin B6", "value": 0.113, "unit": "mg", "rdi": "7%" }
      ],
      "minerals": [
        { "name": "Potassium", "value": 232, "unit": "mg", "rdi": "7%" },
        { "name": "Calcium", "value": 35, "unit": "mg", "rdi": "4%" }
      ]
    },
    "healthBenefits": [
      "Good source of dietary fiber, promoting digestive health and preventing constipation.",
      "Contains minerals like potassium and calcium, important for bone health and blood pressure regulation.",
      "Rich in antioxidants, which can help protect against chronic diseases.",
      "Dried figs are a concentrated source of nutrients and energy."
    ],
    "potentialAllergies": [
      { "name": "Fig Allergy / Latex Sensitivity", "severity": "Mild", "details": "Some people may be allergic to figs, possibly due to cross-reactivity with birch pollen or latex. Symptoms can include itching or oral allergy syndrome." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Temperate to subtropical, thrives in areas with long, hot summers and mild winters. Some varieties are more cold-hardy.\n2. Soil: Adaptable to various soils but prefers well-drained, fertile loam. Tolerates slightly alkaline conditions.\n3. Propagation: Easily propagated from cuttings. Can also be grown from seeds, but quality may vary.\n4. Planting: Plant in full sun. Can be grown in containers, especially in colder regions.\n5. Watering: Young trees require regular watering. Mature trees are relatively drought-tolerant but produce better fruit with consistent moisture, especially during fruit development.\n6. Fertilizing: Generally light feeders. A balanced fertilizer in spring may be beneficial.\n7. Pruning: Prune during dormancy to shape the tree, remove dead wood, and encourage fruit production (figs often fruit on new and old wood, depending on variety).\n8. Harvesting: Figs are harvested when they are soft to the touch, droop slightly on the stem, and have fully developed color. They do not ripen much after picking.",
    "growthDuration": "Trees from cuttings can start bearing fruit in 1-3 years. Figs typically have two crops per year in suitable climates (breba crop on old wood, main crop on new wood).",
    "sustainabilityTips": [
      "Fresh figs are highly perishable; store in the refrigerator and consume within a few days.",
      "Dried figs have a long shelf life and are a good way to preserve the fruit.",
      "Enjoy fresh figs with their skin; wash thoroughly.",
      "Compost any unused parts."
    ],
    "carbonFootprintInfo": "Moderate. Fresh figs can have a higher footprint if air-freighted due to perishability (0.8-2.0 kg CO2e/kg). Dried figs generally have a lower footprint.",
    "staticRecipes": [
      {
        "name": "Fresh Figs with Prosciutto and Balsamic Glaze",
        "description": "An elegant appetizer combining sweet figs, salty prosciutto, and tangy balsamic.",
        "ingredients": ["8-12 ripe fresh figs, halved or quartered", "4-6 slices prosciutto, torn into pieces", "2 tbsp balsamic glaze (store-bought or homemade by reducing balsamic vinegar)", "Fresh basil leaves or microgreens for garnish (optional)"],
        "steps": ["Wash figs gently and pat dry. Cut them in half or quarters depending on size.", "Arrange fig pieces on a serving platter.", "Drape pieces of prosciutto around or over the figs.", "Drizzle generously with balsamic glaze.", "Garnish with fresh basil or microgreens if desired. Serve immediately."]
      },
      {
        "name": "Baked Figs with Goat Cheese and Honey",
        "description": "A warm, delicious dessert or appetizer featuring sweet figs and creamy goat cheese.",
        "ingredients": ["8 ripe fresh figs", "4 oz soft goat cheese (chèvre)", "2 tbsp honey (plus more for drizzling)", "1 tbsp chopped walnuts or pecans, toasted (optional)"],
        "steps": ["Preheat oven to 375°F (190°C).", "Wash figs. Cut a small 'X' into the top of each fig, about halfway down, without cutting all the way through.", "Gently open the fig slightly at the cuts to create a small pocket.", "Stuff each fig with a small amount of goat cheese.", "Arrange the stuffed figs in a small baking dish.", "Drizzle with honey.", "Bake for 10-15 minutes, or until the figs are softened and the goat cheese is warm and slightly melted.", "Sprinkle with toasted nuts (if using) and an extra drizzle of honey before serving warm."]
      },
      {
        "name": "Fig and Almond Smoothie",
        "description": "A nutritious and flavorful smoothie made with fresh or dried figs.",
        "ingredients": ["4-5 fresh ripe figs (or 3-4 dried figs, soaked in hot water for 15 mins and drained)", "1 cup almond milk (or other milk)", "1/2 banana, frozen (for creaminess)", "1 tbsp almond butter", "1/2 tsp vanilla extract", "Pinch of cinnamon", "Ice cubes (optional)"],
        "steps": ["If using fresh figs, remove stems and roughly chop. If using dried figs, ensure they are soft from soaking.", "Combine figs, almond milk, frozen banana, almond butter, vanilla extract, and cinnamon in a blender.", "Blend until smooth and creamy. Add ice cubes if a colder, thicker smoothie is desired and blend again.", "Pour into a glass and serve immediately."]
      }
    ]
  },
  {
    "id": "peach",
    "commonName": "Peach",
    "scientificName": "Prunus persica",
    "image": "https://placehold.co/600x426.png",
    "description": "A deciduous tree native to Northwest China. It bears an edible juicy fruit also called a peach or a nectarine (nectarines are a variety of peach that lack fuzz).",
    "origin": "Northwest China",
    "localNames": ["Melocotón (Spanish)", "Pêche (French)", "Pfirsich (German)"],
    "regions": ["China", "Spain", "Italy", "United States (California, Georgia, South Carolina)", "Greece", "Turkey"],
    "seasons": ["Summer"],
    "nutrition": {
      "calories": "39 kcal per 100g",
      "macronutrients": [
        { "name": "Protein", "value": 0.9, "unit": "g" },
        { "name": "Carbohydrates", "value": 9.5, "unit": "g" },
        { "name": "Fat", "value": 0.3, "unit": "g" },
        { "name": "Fiber", "value": 1.5, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 6.6, "unit": "mg", "rdi": "11%" },
        { "name": "Vitamin A (from carotenoids)", "value": 16, "unit": "µg RAE", "rdi": "2%" }
      ],
      "minerals": [
        { "name": "Potassium", "value": 190, "unit": "mg", "rdi": "5%" }
      ]
    },
    "healthBenefits": [
      "Good source of Vitamin C, supporting immune function.",
      "Contains antioxidants that can help protect cells from damage.",
      "Provides dietary fiber, which aids in digestion.",
      "May contribute to skin health due to vitamin content."
    ],
    "potentialAllergies": [
      { "name": "Oral Allergy Syndrome (OAS)", "severity": "Mild", "details": "Often linked to birch pollen allergy. Symptoms include itching or swelling of the mouth, lips, and throat." },
      { "name": "Peach Fuzz Sensitivity", "severity": "Mild", "details": "Some people find the fuzz on peach skin irritating, though it's not a true allergy. Nectarines are a fuzz-free alternative."}
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Temperate climates with sufficient winter chill hours for bud break, followed by warm summers for fruit ripening. Protect from late spring frosts.\n2. Soil: Well-drained, sandy loam soil with good organic content. pH 6.0-7.0.\n3. Propagation: Usually grafted onto rootstock to ensure variety characteristics and disease resistance.\n4. Planting: Plant bare-root trees in late winter or early spring. Container-grown trees can be planted more flexibly. Full sun is essential.\n5. Watering: Regular, deep watering, especially during fruit development and dry spells. Avoid waterlogged soil.\n6. Fertilizing: Apply balanced fertilizer in early spring and possibly again in early summer.\n7. Pruning: Prune annually during dormancy to maintain an open center or vase shape, remove dead/diseased wood, and encourage fruit production on one-year-old wood.\n8. Thinning: Thin young fruits to 6-8 inches apart to ensure larger, higher-quality mature fruits.\n9. Harvesting: Peaches are harvested when they reach full color (yellow/red, depending on variety), soften slightly, and have a sweet aroma. They are typically picked by hand.",
    "growthDuration": "Grafted trees can start bearing fruit in 2-4 years. Fruits mature 3-5 months after flowering.",
    "sustainabilityTips": [
      "Store unripe peaches at room temperature. Once ripe, they can be refrigerated for a few days.",
      "Peaches bruise easily; handle with care.",
      "Freeze sliced peaches for later use in smoothies, pies, or cobblers.",
      "Compost peach pits."
    ],
    "carbonFootprintInfo": "Moderate. Locally grown peaches in season have a lower footprint (0.4-0.8 kg CO2e/kg). Transport significantly increases this.",
    "staticRecipes": [
      {
        "name": "Classic Peach Cobbler",
        "description": "A warm and comforting dessert with sweet, juicy peaches and a buttery biscuit topping.",
        "ingredients": ["For filling: 5-6 ripe peaches, peeled, pitted, and sliced", "1/4 cup granulated sugar", "1 tbsp lemon juice", "1/4 tsp cinnamon", "For topping: 1 cup all-purpose flour, 1/4 cup granulated sugar, 1 tsp baking powder, 1/4 tsp salt, 1/4 cup cold butter (cubed), 1/4 cup milk", "1 tbsp melted butter for brushing (optional)"],
        "steps": ["Preheat oven to 375°F (190°C).", "Filling: In a large bowl, gently toss sliced peaches with sugar, lemon juice, and cinnamon. Pour into a 9x9 inch baking dish or similar.", "Topping: In another bowl, whisk together flour, sugar, baking powder, and salt. Cut in cold butter until mixture resembles coarse crumbs. Stir in milk until just combined.", "Drop spoonfuls of the topping mixture over the peaches.", "If desired, brush the topping with melted butter.", "Bake for 30-40 minutes, or until the topping is golden brown and the peach filling is bubbly. Let cool slightly before serving warm, perhaps with vanilla ice cream."]
      },
      {
        "name": "Grilled Peaches with Honey and Yogurt",
        "description": "Grilling brings out the sweetness of peaches, perfect for a light dessert or breakfast.",
        "ingredients": ["2-3 ripe but firm peaches, halved and pitted", "1 tbsp olive oil or melted butter", "2 tbsp honey or maple syrup", "1 cup plain Greek yogurt", "Chopped nuts or granola for topping (optional)"],
        "steps": ["Preheat grill to medium heat. Clean and lightly oil the grates.", "Brush the cut sides of the peach halves with olive oil or melted butter.", "Place peaches cut-side down on the grill. Grill for 3-5 minutes per side, or until they have nice grill marks and are slightly softened.", "Remove peaches from the grill. Serve warm topped with a dollop of Greek yogurt, a drizzle of honey or maple syrup, and a sprinkle of nuts or granola if desired."]
      },
      {
        "name": "Fresh Peach Salsa",
        "description": "A sweet and savory salsa, great with grilled chicken, fish, or tortilla chips.",
        "ingredients": ["2 ripe peaches, peeled, pitted, and diced", "1/2 red bell pepper, diced", "1/4 red onion, finely chopped", "1 jalapeño, minced (optional, seeds removed for less heat)", "1/4 cup chopped fresh cilantro", "Juice of 1 lime", "Salt and pepper to taste"],
        "steps": ["In a medium bowl, combine diced peaches, red bell pepper, red onion, jalapeño (if using), and cilantro.", "Add lime juice and season with salt and pepper to taste.", "Stir gently to combine all ingredients.", "For best flavor, cover and refrigerate for at least 15-30 minutes to allow flavors to meld before serving."]
      }
    ]
  },
  {
    "id": "plum",
    "commonName": "Plum",
    "scientificName": "Prunus domestica",
    "image": "https://placehold.co/600x427.png",
    "description": "A fruit of some species in Prunus subg. Prunus. Mature plum fruits may have a dusty-white waxy coating that gives them a glaucous appearance. This is an epicuticular wax coating and is known as 'wax bloom'.",
    "origin": "Caucasus Mountains, Eastern Europe or Western Asia",
    "localNames": ["Ciruela (Spanish)", "Prune (French - also means dried plum)", "Pflaume (German)"],
    "regions": ["China", "Romania", "Serbia", "United States", "Turkey", "Chile"],
    "seasons": ["Summer", "Early Autumn"],
    "nutrition": {
      "calories": "46 kcal per 100g",
      "macronutrients": [
        { "name": "Protein", "value": 0.7, "unit": "g" },
        { "name": "Carbohydrates", "value": 11.4, "unit": "g" },
        { "name": "Fat", "value": 0.3, "unit": "g" },
        { "name": "Fiber", "value": 1.4, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 9.5, "unit": "mg", "rdi": "16%" },
        { "name": "Vitamin K", "value": 6.4, "unit": "µg", "rdi": "8%" },
        { "name": "Vitamin A", "value": 17, "unit": "µg RAE", "rdi": "2%" }
      ],
      "minerals": [
        { "name": "Potassium", "value": 157, "unit": "mg", "rdi": "5%" }
      ]
    },
    "healthBenefits": [
      "Good source of dietary fiber, aiding digestion and preventing constipation.",
      "Rich in antioxidants, including phenols and anthocyanins.",
      "May help improve bone health and reduce risk of osteoporosis.",
      "Can help regulate blood sugar levels due to their low glycemic index."
    ],
    "potentialAllergies": [
      { "name": "Oral Allergy Syndrome (OAS)", "severity": "Mild", "details": "Can occur in individuals allergic to birch pollen." },
      { "name": "Sorbitol Content", "severity": "Mild", "details": "Can have a laxative effect if consumed in large quantities, especially dried plums (prunes)." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Temperate climates. Different varieties have different chilling requirements.\n2. Soil: Well-drained, fertile loamy soil. Slightly acidic to neutral pH (6.0-7.0).\n3. Propagation: Usually by grafting onto rootstock.\n4. Planting: Plant in full sun. Allow adequate space for tree growth.\n5. Watering: Regular watering, especially during dry periods and fruit development.\n6. Fertilizing: Apply balanced fertilizer in early spring.\n7. Pruning: Prune to maintain shape, remove dead/diseased wood, and encourage fruit production.\n8. Thinning: Thin fruits to prevent branch breakage and ensure larger fruit size.",
    "growthDuration": "Grafted trees can start bearing fruit in 3-5 years. Fruit matures in late summer to early autumn.",
    "sustainabilityTips": [
      "Store ripe plums in the refrigerator for a few days.",
      "Plums can be eaten fresh, dried (prunes), or used in jams, jellies, and baked goods.",
      "Compost plum pits."
    ],
    "carbonFootprintInfo": "Moderate (0.4-0.9 kg CO2e/kg). Locally grown plums in season have a lower footprint.",
    "staticRecipes": [
      {
        "name": "Simple Plum Compote",
        "description": "A sweet and slightly tart compote, perfect over yogurt, ice cream, or pancakes.",
        "ingredients": ["1 lb plums, pitted and sliced or quartered", "1/4 cup sugar (or to taste)", "1/4 cup water", "1 cinnamon stick (optional)", "1 star anise (optional)", "1 tsp lemon juice"],
        "steps": ["Combine plums, sugar, water, cinnamon stick (if using), and star anise (if using) in a saucepan.", "Bring to a simmer over medium heat, then reduce heat to low.", "Cook for 15-20 minutes, or until plums are soft and the sauce has thickened slightly. Stir occasionally.", "Remove from heat, discard cinnamon stick and star anise. Stir in lemon juice.", "Serve warm or chilled."]
      },
      {
        "name": "Plum Crumble",
        "description": "A delicious dessert with a sweet plum filling and a buttery crumble topping.",
        "ingredients": ["For filling: 2 lbs plums, pitted and sliced", "1/2 cup granulated sugar", "1 tbsp cornstarch", "1/2 tsp cinnamon", "For topping: 1 cup all-purpose flour, 1/2 cup brown sugar, 1/2 cup cold butter (cubed), 1/2 cup rolled oats (optional)"],
        "steps": ["Preheat oven to 375°F (190°C).", "Filling: In a large bowl, toss sliced plums with granulated sugar, cornstarch, and cinnamon. Transfer to a baking dish.", "Topping: In another bowl, combine flour and brown sugar. Cut in butter until mixture resembles coarse crumbs. Stir in oats if using.", "Sprinkle topping evenly over the plums.", "Bake for 30-40 minutes, or until topping is golden brown and filling is bubbly. Let cool slightly before serving."]
      },
      {
        "name": "Fresh Plum Salad with Mint",
        "description": "A refreshing and simple salad showcasing the flavor of fresh plums.",
        "ingredients": ["4-5 ripe plums, pitted and sliced", "1 tbsp honey", "1 tbsp lime juice", "1/4 cup fresh mint leaves, chopped", "Optional: A sprinkle of feta cheese or toasted almonds"],
        "steps": ["In a bowl, gently combine sliced plums.", "In a small bowl, whisk together honey and lime juice.", "Drizzle the honey-lime mixture over the plums.", "Sprinkle with fresh chopped mint.", "If desired, add feta cheese or toasted almonds. Toss gently and serve immediately."]
      }
    ]
  },
  {
    "id": "pear",
    "commonName": "Pear",
    "scientificName": "Pyrus communis",
    "image": "https://placehold.co/600x428.png",
    "description": "A sweet, bell-shaped fruit that has been enjoyed since ancient times. It can be eaten crisp or soft.",
    "origin": "Central Asia and Europe",
    "localNames": ["Pera (Spanish/Italian)", "Poire (French)", "Birne (German)"],
    "regions": ["China", "United States", "Argentina", "Italy", "Turkey"],
    "seasons": ["Late Summer", "Autumn", "Winter"],
    "nutrition": {
      "calories": "57 kcal per 100g",
      "macronutrients": [
        { "name": "Protein", "value": 0.4, "unit": "g" },
        { "name": "Carbohydrates", "value": 15, "unit": "g" },
        { "name": "Fat", "value": 0.1, "unit": "g" },
        { "name": "Fiber", "value": 3.1, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 4.3, "unit": "mg", "rdi": "7%" },
        { "name": "Vitamin K", "value": 4.4, "unit": "µg", "rdi": "6%" }
      ],
      "minerals": [
        { "name": "Potassium", "value": 116, "unit": "mg", "rdi": "3%" }
      ]
    },
    "healthBenefits": [
      "Good source of dietary fiber, promoting digestive health.",
      "Contains antioxidants, including flavonoids.",
      "May help reduce inflammation and risk of chronic diseases.",
      "Hypoallergenic properties make it a good fruit for weaning babies."
    ],
    "potentialAllergies": [
      { "name": "Oral Allergy Syndrome (OAS)", "severity": "Mild", "details": "Can occur in individuals allergic to birch pollen." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Temperate climates. Require chilling hours for bud development.\n2. Soil: Deep, well-drained loamy soil. pH 6.0-7.0.\n3. Propagation: Usually by grafting specific varieties onto rootstock.\n4. Planting: Plant in full sun. Provide support for young trees.\n5. Watering: Regular watering, especially during dry spells and fruit development.\n6. Fertilizing: Apply balanced fertilizer in spring.\n7. Pruning: Prune to maintain shape, remove dead wood, and encourage fruiting spurs.\n8. Thinning: Thin young fruit to improve size and quality of remaining pears.",
    "growthDuration": "Grafted trees start bearing fruit in 3-5 years. Fruit matures in late summer to autumn.",
    "sustainabilityTips": [
      "Store pears at room temperature to ripen; refrigerate ripe pears to slow further ripening.",
      "Pears ripen from the inside out; check for ripeness near the stem.",
      "Compost pear cores."
    ],
    "carbonFootprintInfo": "Moderate (0.4-0.8 kg CO2e/kg). Local and seasonal pears are best.",
    "staticRecipes": [
      {
        "name": "Poached Pears in Spiced Syrup",
        "description": "Elegant and flavorful poached pears, perfect as a dessert.",
        "ingredients": ["4 firm ripe pears (e.g., Bosc or Anjou), peeled, halved, and cored", "3 cups water or red/white wine", "1 cup sugar", "1 cinnamon stick", "2-3 cloves", "1 star anise", "Peel of 1 lemon"],
        "steps": ["In a saucepan large enough to hold pears in a single layer, combine water/wine, sugar, cinnamon stick, cloves, star anise, and lemon peel.", "Bring to a simmer over medium heat, stirring until sugar dissolves.", "Add pear halves to the simmering syrup. Ensure they are mostly submerged (add more water if needed).", "Reduce heat to low, cover, and simmer gently for 15-25 minutes, or until pears are tender when pierced with a knife. Cooking time varies with pear ripeness and variety.", "Carefully remove pears from syrup. If desired, boil the syrup for another 10-15 minutes to reduce and thicken it slightly.", "Serve pears warm or chilled, drizzled with the syrup. Great with yogurt or ice cream."]
      },
      {
        "name": "Pear and Blue Cheese Salad",
        "description": "A sophisticated salad balancing sweet pears, tangy blue cheese, and crunchy nuts.",
        "ingredients": ["5 oz mixed greens (arugula, spinach)", "2 ripe pears, cored and thinly sliced", "1/2 cup crumbled blue cheese (Gorgonzola, Roquefort)", "1/4 cup toasted walnuts or pecans, chopped", "For dressing: 3 tbsp olive oil, 1 tbsp balsamic vinegar, 1 tsp Dijon mustard, 1 tsp honey, salt and pepper to taste"],
        "steps": ["In a large salad bowl, combine mixed greens, sliced pears, crumbled blue cheese, and toasted nuts.", "In a small bowl, whisk together olive oil, balsamic vinegar, Dijon mustard, honey, salt, and pepper.", "Drizzle dressing over the salad and toss gently to combine.", "Serve immediately."]
      },
      {
        "name": "Simple Pear Crisp",
        "description": "A warm and comforting dessert with a sweet pear filling and a crispy oat topping.",
        "ingredients": ["For filling: 5-6 ripe pears, peeled, cored, and sliced", "1/4 cup sugar", "1 tbsp lemon juice", "1/2 tsp cinnamon", "For topping: 3/4 cup all-purpose flour, 1/2 cup brown sugar, 1/2 tsp cinnamon, 1/4 cup cold butter (cubed), 1/2 cup rolled oats"],
        "steps": ["Preheat oven to 375°F (190°C).", "Filling: In a bowl, toss sliced pears with sugar, lemon juice, and 1/2 tsp cinnamon. Transfer to a baking dish.", "Topping: In another bowl, combine flour, brown sugar, and 1/2 tsp cinnamon. Cut in butter until mixture resembles coarse crumbs. Stir in oats.", "Sprinkle topping evenly over the pears.", "Bake for 30-35 minutes, or until topping is golden and filling is bubbly. Let cool slightly before serving."]
      }
    ]
  },
  {
    "id": "ber",
    "commonName": "Ber (Indian Jujube)",
    "scientificName": "Ziziphus mauritiana",
    "image": "https://placehold.co/600x429.png",
    "description": "A tropical fruit tree species belonging to the family Rhamnaceae. The fruit is a drupe, varying in shape from round to oblong, and in size from a cherry to a plum. The flesh is white and crisp.",
    "origin": "Indo-Malaysian region of South-East Asia",
    "localNames": ["Indian Plum", "Chinee Apple", "Jujube", "Bor (Bengali)", "Badri (Sanskrit)"],
    "regions": ["India", "Pakistan", "Bangladesh", "Parts of Africa and Middle East"],
    "seasons": ["Winter", "Early Spring"],
    "nutrition": {
      "calories": "79 kcal per 100g",
      "macronutrients": [
        { "name": "Protein", "value": 1.2, "unit": "g" },
        { "name": "Carbohydrates", "value": 20.2, "unit": "g" },
        { "name": "Fat", "value": 0.2, "unit": "g" },
        { "name": "Fiber", "value": 0.6, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 69, "unit": "mg", "rdi": "115%" }
      ],
      "minerals": [
        { "name": "Potassium", "value": 250, "unit": "mg", "rdi": "7%" },
        { "name": "Phosphorus", "value": 23, "unit": "mg", "rdi": "3%" }
      ]
    },
    "healthBenefits": [
      "Rich in Vitamin C, boosting immunity and skin health.",
      "Contains antioxidants that help fight free radicals.",
      "Traditionally used for digestive issues and to improve sleep.",
      "Good source of energy due to natural sugars."
    ],
    "potentialAllergies": [
      { "name": "Ber Allergy", "severity": "Rare", "details": "Allergies are very uncommon." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Thrives in tropical and subtropical climates; drought-resistant.\n2. Soil: Adaptable to a wide range of soils, including poor, alkaline, or saline soils, but prefers well-drained sandy loam.\n3. Propagation: Usually by seeds, budding, or grafting.\n4. Planting: Plant in full sun.\n5. Watering: Young plants need regular watering. Mature trees are very drought-tolerant.\n6. Fertilizing: Responds well to organic manure. Light fertilization may be needed.\n7. Pruning: Prune annually to encourage new growth, as fruits are borne on new shoots.\n8. Harvesting: Fruits are harvested when they turn yellowish-green to reddish-brown, depending on variety.",
    "growthDuration": "Starts bearing fruit in 2-3 years. Fruits mature in winter to early spring.",
    "sustainabilityTips": [
      "Ber can be eaten fresh, dried, or pickled.",
      "Store fresh ber at room temperature for a few days or refrigerate for longer.",
      "Dried ber has a long shelf life."
    ],
    "carbonFootprintInfo": "Relatively low, especially if grown locally. (0.3-0.7 kg CO2e/kg)",
    "staticRecipes": [
      {
        "name": "Fresh Ber (Indian Jujube)",
        "description": "Enjoyed fresh, often with a sprinkle of salt and chili powder.",
        "ingredients": ["1 cup fresh Ber (Indian Jujube)", "Pinch of salt (optional)", "Pinch of red chili powder (optional)"],
        "steps": ["Wash the ber fruits thoroughly.", "They can be eaten whole, like a small apple. The skin is edible, and the flesh is crisp around a central stone.", "If desired, sprinkle with a little salt and/or red chili powder for a tangy and spicy flavor.", "Discard the stone."]
      },
      {
        "name": "Dried Ber (Sukha Ber)",
        "description": "Ber fruits are often sun-dried for preservation and eaten as a snack.",
        "ingredients": ["Fresh Ber fruits"],
        "steps": ["Wash fresh ber fruits thoroughly.", "Spread them on a clean cloth or tray in direct sunlight.", "Allow them to dry completely, which may take several days depending on the sun's intensity. Turn them occasionally for even drying.", "Once fully dried, they will be shriveled and hard. Store in an airtight container.", "Dried ber can be eaten as is or used in traditional preparations."]
      },
      {
        "name": "Ber Pickle (Achar)",
        "description": "A tangy and spicy pickle made from fresh Ber fruits.",
        "ingredients": ["1 lb fresh Ber, washed and slit", "1/4 cup mustard oil", "2 tbsp fennel seeds (saunf)", "1 tbsp mustard seeds (rai)", "1 tsp fenugreek seeds (methi dana)", "1/2 tsp asafoetida (hing)", "1 tbsp turmeric powder", "2 tbsp red chili powder (or to taste)", "Salt to taste", "2 tbsp vinegar (optional, for longer shelf life)"],
        "steps": ["Sun-dry the slit ber fruits for a day or two to remove some moisture.", "Dry roast fennel seeds, mustard seeds, and fenugreek seeds separately. Coarsely grind them.", "Heat mustard oil in a pan until it smokes lightly, then let it cool completely.", "In a large mixing bowl, combine the sun-dried ber, ground spice mixture, turmeric powder, red chili powder, asafoetida, and salt.", "Pour the cooled mustard oil over the mixture and mix well.", "If using, add vinegar and mix again.", "Transfer the pickle to a sterilized, dry glass jar. Cover and keep in the sun for 4-5 days, shaking the jar daily.", "The pickle is ready to eat once the ber softens and absorbs the flavors. Store in a cool, dry place."]
      }
    ]
  },
  {
    "id": "jamun",
    "commonName": "Jamun (Java Plum)",
    "scientificName": "Syzygium cumini",
    "image": "https://placehold.co/600x430.png",
    "description": "An evergreen tropical tree in the flowering plant family Myrtaceae. The fruit is oblong, ovoid, starts green and turns pink to shining crimson black as it matures. It has a sweet, sour, and astringent flavor.",
    "origin": "Indian subcontinent and Southeast Asia",
    "localNames": ["Java Plum", "Black Plum", "Jambolan", "Kala Jamun (Hindi)"],
    "regions": ["India", "Pakistan", "Indonesia", "Philippines", "Brazil", "Suriname"],
    "seasons": ["Summer (May-July in India)"],
    "nutrition": {
      "calories": "60 kcal per 100g",
      "macronutrients": [
        { "name": "Protein", "value": 0.7, "unit": "g" },
        { "name": "Carbohydrates", "value": 15.6, "unit": "g" },
        { "name": "Fat", "value": 0.2, "unit": "g" },
        { "name": "Fiber", "value": 0.9, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 14.3, "unit": "mg", "rdi": "24%" }
      ],
      "minerals": [
        { "name": "Iron", "value": 0.2, "unit": "mg", "rdi": "1%" },
        { "name": "Magnesium", "value": 15, "unit": "mg", "rdi": "4%" },
        { "name": "Potassium", "value": 79, "unit": "mg", "rdi": "2%" }
      ]
    },
    "healthBenefits": [
      "Traditionally used in Ayurvedic medicine for managing diabetes due to its potential to lower blood sugar.",
      "Rich in antioxidants, including anthocyanins, which give it its dark color.",
      "Good source of Vitamin C and iron.",
      "May aid in digestion and improve liver function."
    ],
    "potentialAllergies": [
      { "name": "Jamun Allergy", "severity": "Rare", "details": "Allergies are very uncommon." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Tropical and subtropical. Tolerates a range of conditions but prefers distinct dry and wet seasons.\n2. Soil: Grows well in a variety of soils, from sandy loam to clayey soils, but prefers deep, well-drained loamy soil.\n3. Propagation: Commonly grown from seeds. Grafting or budding can be used for superior varieties.\n4. Planting: Plant in full sun.\n5. Watering: Young trees require regular watering. Mature trees are relatively drought-tolerant but benefit from irrigation during fruit development.\n6. Fertilizing: Generally does not require heavy fertilization. Organic manure can be beneficial.\n7. Harvesting: Fruits are harvested when they turn deep purple or black and detach easily from the tree.",
    "growthDuration": "Seedling trees may take 8-10 years to fruit. Grafted trees start earlier (4-5 years). Fruits mature in summer.",
    "sustainabilityTips": [
      "Jamun stains easily; handle with care.",
      "The fruit is perishable; consume fresh or make juice, vinegar, or wine.",
      "Seeds can be dried and powdered for medicinal uses (consult an expert)."
    ],
    "carbonFootprintInfo": "Relatively low to moderate (0.4-0.8 kg CO2e/kg), especially if consumed locally.",
    "staticRecipes": [
      {
        "name": "Fresh Jamun with Black Salt",
        "description": "The simplest way to enjoy jamun, enhancing its unique flavor.",
        "ingredients": ["1 cup fresh Jamun (Java Plum)", "A pinch of black salt (kala namak)"],
        "steps": ["Wash the jamun fruits thoroughly.", "Place them in a bowl.", "Sprinkle a pinch of black salt over the fruits.", "Toss gently and enjoy. The fruit is eaten whole, and the seed is discarded."]
      },
      {
        "name": "Jamun Juice",
        "description": "A refreshing and nutritious juice with a distinct tangy-sweet taste.",
        "ingredients": ["2 cups fresh Jamun, deseeded", "1 cup cold water", "2-3 tbsp sugar or honey (or to taste)", "1/2 tsp black salt (optional)", "Juice of 1/2 lime (optional)"],
        "steps": ["Wash jamun fruits and remove the seeds. This can be done by gently squeezing the pulp off the seed.", "Combine deseeded jamun pulp, cold water, sugar/honey, black salt (if using), and lime juice (if using) in a blender.", "Blend until smooth.", "Strain the juice through a fine-mesh sieve if you prefer a smoother texture, or enjoy it with the pulp.", "Serve chilled or over ice."]
      },
      {
        "name": "Jamun Vinegar (Homemade)",
        "description": "A traditional way to preserve jamun and utilize its health benefits.",
        "ingredients": ["1 lb ripe Jamun fruits", "1/2 cup sugar (or jaggery)", "4 cups water", "A piece of 'mother of vinegar' (optional, for faster fermentation)"],
        "steps": ["Wash jamun fruits thoroughly. Lightly crush them.", "In a clean, sterilized glass or ceramic jar, combine the crushed jamun, sugar/jaggery, and water.", "If using mother of vinegar, add it to the jar.", "Cover the mouth of the jar with a clean cheesecloth or muslin cloth and secure it with a rubber band or string. This allows air to circulate but keeps insects out.", "Keep the jar in a warm, dark place for 2-4 weeks. Stir the mixture every couple of days with a clean wooden or plastic spoon.", "After 2-4 weeks (fermentation time can vary depending on temperature), the mixture will start to smell vinegary. Strain the liquid through a cheesecloth into another clean jar.", "Cover the new jar again with cheesecloth and let it age for another 4-6 weeks, or until the desired acidity is achieved.", "Once ready, the jamun vinegar can be strained again and stored in airtight bottles."]
      }
    ]
  },
  {
    "id": "amla",
    "commonName": "Amla (Indian Gooseberry)",
    "scientificName": "Phyllanthus emblica",
    "image": "https://placehold.co/600x431.png",
    "description": "A deciduous tree of the family Phyllanthaceae. It is known for its edible fruit of the same name. The fruit is nearly spherical, light greenish-yellow, quite smooth and hard on appearance, with six vertical stripes or furrows.",
    "origin": "India and Southeast Asia",
    "localNames": ["Indian Gooseberry", "Nellikkai (Tamil)", "Usirikaya (Telugu)"],
    "regions": ["India", "Sri Lanka", "Thailand", "Malaysia"],
    "seasons": ["Autumn", "Winter"],
    "nutrition": {
      "calories": "44 kcal per 100g",
      "macronutrients": [
        { "name": "Protein", "value": 0.9, "unit": "g" },
        { "name": "Carbohydrates", "value": 10.2, "unit": "g" },
        { "name": "Fat", "value": 0.6, "unit": "g" },
        { "name": "Fiber", "value": 4.3, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 27.7, "unit": "mg", "rdi": "46%" }
      ],
      "minerals": [
        { "name": "Manganese", "value": 0.144, "unit": "mg", "rdi": "7%" }
      ]
    },
    "healthBenefits": [
      "Extremely rich in Vitamin C, a potent antioxidant.",
      "Traditionally used in Ayurveda for boosting immunity, improving hair and skin health, and aiding digestion.",
      "May help regulate blood sugar levels.",
      "Anti-inflammatory properties."
    ],
    "potentialAllergies": [
      { "name": "Amla Allergy", "severity": "Rare", "details": "Very rare, but excessive consumption might cause acidity in some." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Tropical and subtropical. Prefers hot summers and mild winters.\n2. Soil: Adaptable to a wide range of soils but prefers well-drained, loamy to clay-loam soil.\n3. Propagation: Seeds, budding, or grafting.\n4. Planting: Plant in full sun.\n5. Watering: Regular watering for young plants. Mature trees are drought-tolerant.\n6. Fertilizing: Organic manure is beneficial. Light fertilization may be required.\n7. Harvesting: Fruits are harvested when they turn from light green to a dull greenish-yellow.",
    "growthDuration": "Starts fruiting in 3-5 years for grafted plants. Fruits mature in autumn and winter.",
    "sustainabilityTips": [
      "Amla is often preserved as pickles, candies (murabba), or juice due to its tartness.",
      "Dried amla powder is a popular supplement.",
      "Store fresh amla in the refrigerator."
    ],
    "carbonFootprintInfo": "Relatively low (0.3-0.6 kg CO2e/kg), particularly when processed and consumed locally.",
    "staticRecipes": [
      {
        "name": "Amla Juice",
        "description": "A tangy and highly nutritious juice known for its health benefits.",
        "ingredients": ["5-6 fresh Amla (Indian Gooseberries)", "1 cup water", "Pinch of black salt (optional)", "1 tsp honey or jaggery (optional, to taste)"],
        "steps": ["Wash amla thoroughly. Cut them into pieces and remove the seeds.", "Combine amla pieces and water in a blender.", "Blend until smooth. You might need to add a little more water for easier blending.", "Strain the mixture through a fine-mesh sieve or cheesecloth, pressing to extract all the juice.", "Stir in black salt and honey/jaggery if using.", "Serve immediately. Can be diluted further if too strong."]
      },
      {
        "name": "Amla Murabba (Sweet Amla Preserve)",
        "description": "A traditional Indian sweet preserve made from amla, often eaten for its health benefits.",
        "ingredients": ["1 lb Amla (Indian Gooseberries)", "1.5 cups sugar", "1 cup water", "1/2 tsp cardamom powder", "Few strands of saffron (optional)"],
        "steps": ["Wash amla and prick them all over with a fork. This helps them absorb the syrup.", "Blanch the amla in boiling water for 2-3 minutes, or until they soften slightly. Drain.", "In a separate saucepan, make a sugar syrup by dissolving sugar in 1 cup of water. Bring to a boil and cook until the syrup reaches a one-string consistency (a drop of syrup between thumb and forefinger forms a single thread when pulled apart).", "Add the blanched amla to the sugar syrup. Cook on low heat for 20-25 minutes, or until amla pieces become translucent and tender, and the syrup thickens further.", "Stir in cardamom powder and saffron (if using).", "Let it cool completely. Store in a sterilized airtight glass jar. The murabba tastes better after a few days as the amla absorbs the syrup."]
      },
      {
        "name": "Salted Amla (Sun-dried)",
        "description": "A simple way to preserve amla and enjoy its tangy taste.",
        "ingredients": ["1 lb Amla (Indian Gooseberries)", "2-3 tbsp salt", "1 tsp turmeric powder (optional)"],
        "steps": ["Wash amla thoroughly. You can either keep them whole or cut them into segments and deseed.", "If keeping whole, prick them with a fork. If segmenting, remove seeds.", "In a bowl, toss the amla pieces with salt and turmeric powder (if using) until well coated.", "Spread the salted amla on a clean tray or cloth.", "Sun-dry for 4-7 days, or until they are completely dry and shriveled. Bring them indoors at night.", "Once fully dried, store in an airtight container. They can be eaten as a tangy snack."]
      }
    ]
  },
  {
    "id": "wood-apple",
    "commonName": "Wood Apple (Bael)",
    "scientificName": "Aegle marmelos",
    "image": "https://placehold.co/600x432.png",
    "description": "A species of tree native to the Indian subcontinent and Southeast Asia. It has a hard, woody shell and aromatic, sticky pulp with numerous seeds.",
    "origin": "Indian subcontinent and Southeast Asia",
    "localNames": ["Bael (Hindi)", "Stone Apple", "Bengal Quince", "Bilva"],
    "regions": ["India", "Sri Lanka", "Bangladesh", "Thailand", "Myanmar"],
    "seasons": ["Summer (April-June in India)"],
    "nutrition": {
      "calories": "137 kcal per 100g (pulp)",
      "macronutrients": [
        { "name": "Protein", "value": 1.8, "unit": "g" },
        { "name": "Carbohydrates", "value": 31.8, "unit": "g" },
        { "name": "Fat", "value": 0.3, "unit": "g" },
        { "name": "Fiber", "value": 2.9, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 8, "unit": "mg", "rdi": "13%" },
        { "name": "Riboflavin (B2)", "value": 1.19, "unit": "mg", "rdi": "92%" }
      ],
      "minerals": [
        { "name": "Calcium", "value": 85, "unit": "mg", "rdi": "9%" }
      ]
    },
    "healthBenefits": [
      "Traditionally used in Ayurveda for digestive disorders like constipation and diarrhea.",
      "Rich in tannins, which have anti-inflammatory and astringent properties.",
      "Contains antioxidants that help combat oxidative stress.",
      "The pulp is cooling and often consumed as a summer drink."
    ],
    "potentialAllergies": [
      { "name": "Wood Apple Allergy", "severity": "Rare", "details": "Allergies are very uncommon." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Thrives in tropical and subtropical climates with a distinct dry season.\n2. Soil: Adaptable to various soils, including poor or alkaline soils, but prefers well-drained sandy loam.\n3. Propagation: Usually by seeds. Budding and grafting are also practiced.\n4. Planting: Plant in full sun.\n5. Watering: Young plants need regular watering. Mature trees are extremely drought-tolerant.\n6. Fertilizing: Generally does not require much fertilizer. Organic manure is beneficial.\n7. Harvesting: Fruits are harvested when they change from greenish-gray to yellowish. The hard shell needs to be cracked open.",
    "growthDuration": "Seedling trees may take 6-8 years to bear fruit. Fruits mature in summer.",
    "sustainabilityTips": [
      "The hard shell can be challenging to open; use a heavy knife or crack it like a coconut.",
      "The pulp is often mixed with water and sugar to make a refreshing drink (sherbet).",
      "Unripe bael fruit is also used for medicinal purposes."
    ],
    "carbonFootprintInfo": "Relatively low, especially when consumed locally (0.4-0.7 kg CO2e/kg).",
    "staticRecipes": [
      {
        "name": "Bael Sherbet (Wood Apple Drink)",
        "description": "A traditional Indian summer cooler made from wood apple pulp.",
        "ingredients": ["1 medium ripe Wood Apple (Bael)", "2 cups cold water", "4-5 tbsp sugar or jaggery (or to taste)", "1/2 tsp black salt (optional)", "Juice of 1/2 lime (optional)", "Roasted cumin powder (optional, a pinch)"],
        "steps": ["Wash the bael fruit. Crack open the hard shell using a hammer or a heavy pestle.", "Scoop out the fibrous, aromatic pulp into a bowl. Discard the shell and seeds.", "Add about 1 cup of water to the pulp and let it soak for 20-30 minutes. This helps soften the pulp.", "Using your hands, mash the pulp well in the water to extract its flavor and essence. Squeeze out as much liquid as possible.", "Strain the mixture through a sieve into a pitcher, pressing the pulp to get all the juice. Discard the fibrous residue.", "Add the remaining 1 cup of cold water, sugar/jaggery, black salt (if using), lime juice (if using), and roasted cumin powder (if using) to the pitcher. Stir well until the sugar/jaggery is dissolved.", "Taste and adjust sweetness or tanginess. Serve chilled or with ice cubes."]
      },
      {
        "name": "Bael Murabba (Wood Apple Preserve)",
        "description": "A sweet preserve made from wood apple, similar to amla murabba.",
        "ingredients": ["1 large ripe Wood Apple (Bael) pulp", "1.5 cups sugar", "1 cup water", "1/2 tsp cardamom powder"],
        "steps": ["Extract the pulp from the bael fruit and remove seeds.", "In a saucepan, combine sugar and water. Heat until sugar dissolves and forms a syrup of one-string consistency.", "Add the bael pulp to the sugar syrup. Cook on low heat, stirring continuously, until the mixture thickens and the bael pulp becomes translucent (about 20-30 minutes).", "Stir in cardamom powder.", "Let it cool completely. Store in a sterilized airtight glass jar."]
      },
      {
        "name": "Dried Bael Slices for Tea/Infusion",
        "description": "Dried bael fruit slices can be used to make a healthy infusion.",
        "ingredients": ["Ripe Bael fruit"],
        "steps": ["Wash and crack open the bael fruit. Scoop out the pulp.", "Separate the pulp from the seeds and fibers as much as possible.", "Slice the pulp into thin pieces or small chunks.", "Sun-dry these slices on a clean tray for several days until they are completely dry and hard.", "Alternatively, you can dry them in a dehydrator or a very low oven.", "Store the dried bael slices in an airtight container.", "To make an infusion, steep a few dried slices in hot water for 5-10 minutes. Sweeten if desired."]
      }
    ]
  },
  {
    "id": "kokum",
    "commonName": "Kokum",
    "scientificName": "Garcinia indica",
    "image": "https://placehold.co/600x433.png",
    "description": "A fruit-bearing tree that has culinary, pharmaceutical, and industrial uses. The fruit is small, round, and dark purple when ripe. The outer cover is dried and used as a souring agent.",
    "origin": "Western Ghats region of India",
    "localNames": ["Amsol (Marathi/Konkani)", "Brinda (Konkani)", "Murugala Hannu (Kannada)"],
    "regions": ["Western Ghats of India (Maharashtra, Goa, Karnataka, Kerala)"],
    "seasons": ["Summer (April-May for fresh fruit, dried available year-round)"],
    "nutrition": {
      "calories": "60 kcal per 100g (fresh fruit, estimated)",
      "macronutrients": [
        { "name": "Protein", "value": 0.5, "unit": "g" },
        { "name": "Carbohydrates", "value": 14.3, "unit": "g" },
        { "name": "Fat", "value": 0.1, "unit": "g" },
        { "name": "Fiber", "value": 1.6, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 5, "unit": "mg", "rdi": "8%" }
      ],
      "minerals": [
        { "name": "Potassium", "value": 170, "unit": "mg", "rdi": "5%" }
      ]
    },
    "healthBenefits": [
      "Traditionally used as an antacid and to improve digestion.",
      "Rich in antioxidants, including garcinol and anthocyanins.",
      "May have anti-inflammatory and anti-allergic properties.",
      "Kokum butter (from seeds) is used as a moisturizer."
    ],
    "potentialAllergies": [
      { "name": "Kokum Allergy", "severity": "Rare", "details": "Allergies are very uncommon." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Tropical, prefers warm and humid conditions with well-distributed rainfall.\n2. Soil: Grows well in lateritic, alluvial, or sandy loam soils with good drainage.\n3. Propagation: Seeds or grafting.\n4. Planting: Plant in partial shade when young, moving to full sun as it matures.\n5. Watering: Regular watering for young plants. Mature trees are somewhat drought-tolerant.\n6. Fertilizing: Responds well to organic manure.\n7. Harvesting: Fruits are harvested when they turn deep purple. The rind is then typically dried.",
    "growthDuration": "Trees start bearing fruit in 7-10 years. Fruits ripen in summer.",
    "sustainabilityTips": [
      "Dried kokum rind (amsol) has a long shelf life and is a staple souring agent in coastal Indian cuisine.",
      "Kokum sherbet is a popular cooling drink.",
      "Kokum butter is a sustainable alternative to cocoa butter in cosmetics."
    ],
    "carbonFootprintInfo": "Low, as it's primarily consumed locally or in dried form which is light to transport (0.2-0.5 kg CO2e/kg).",
    "staticRecipes": [
      {
        "name": "Kokum Sherbet (Sol Kadi Base)",
        "description": "A refreshing and tangy drink made from dried kokum, often used as a base for Sol Kadi.",
        "ingredients": ["1/2 cup dried Kokum rinds (Amsol)", "2 cups warm water", "1/4 cup sugar or jaggery (or to taste)", "1/2 tsp roasted cumin powder", "Pinch of black salt"],
        "steps": ["Soak dried kokum rinds in 2 cups of warm water for about 1-2 hours. This helps soften them and extract the color and flavor.", "After soaking, squeeze the kokum rinds well in the water to release all their essence. The water will turn deep pink/purple.", "Strain the liquid through a fine-mesh sieve into a pitcher, pressing the rinds to extract maximum juice. Discard the rinds.", "Add sugar or jaggery to the kokum extract and stir until completely dissolved.", "Stir in roasted cumin powder and black salt.", "Chill thoroughly. Serve as a refreshing drink or use as a base for Sol Kadi (by adding coconut milk and spices)."]
      },
      {
        "name": "Using Dried Kokum (Amsol) in Curries",
        "description": "Dried kokum is used as a souring agent in many coastal Indian curries and dals.",
        "ingredients": ["3-4 pieces of dried Kokum rind (Amsol)", "Your curry or dal preparation"],
        "steps": ["Rinse the dried kokum pieces briefly.", "Add the kokum pieces to your curry or dal while it's simmering. They will release their tartness and a beautiful pinkish hue to the dish.", "The amount to use depends on the desired level of sourness and the quantity of the dish. Start with a few pieces and add more if needed.", "Remove the kokum pieces before serving, or leave them in if preferred (they are edible but mainly used for flavor)."]
      },
      {
        "name": "Kokum Infused Water",
        "description": "A simple digestive aid and cooling drink.",
        "ingredients": ["4-5 pieces of dried Kokum rind (Amsol)", "1 liter water", "Optional: pinch of black salt, a few mint leaves"],
        "steps": ["Rinse the dried kokum pieces.", "Add them to a bottle or jar with 1 liter of water.", "Let it infuse for at least 2-3 hours at room temperature, or overnight in the refrigerator.", "The water will turn a light pink and acquire a tangy flavor.", "Strain if desired. Add black salt or mint leaves for extra flavor.", "Drink throughout the day as a cooling and digestive beverage."]
      }
    ]
  },
  {
    "id": "tamarind",
    "commonName": "Tamarind",
    "scientificName": "Tamarindus indica",
    "image": "https://placehold.co/600x434.png",
    "description": "A leguminous tree bearing edible fruit that is indigenous to tropical Africa. The fruit is a pod-like legume, which contains a sweet, tangy pulp.",
    "origin": "Tropical Africa",
    "localNames": ["Imli (Hindi)", "Tamarindo (Spanish/Portuguese)"],
    "regions": ["India", "Thailand", "Mexico", "Other tropical regions worldwide"],
    "seasons": ["Late Winter to Spring (for fresh pods)"],
    "nutrition": {
      "calories": "239 kcal per 100g (pulp)",
      "macronutrients": [
        { "name": "Protein", "value": 2.8, "unit": "g" },
        { "name": "Carbohydrates", "value": 62.5, "unit": "g" },
        { "name": "Fat", "value": 0.6, "unit": "g" },
        { "name": "Fiber", "value": 5.1, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Thiamin (B1)", "value": 0.428, "unit": "mg", "rdi": "36%" }
      ],
      "minerals": [
        { "name": "Iron", "value": 2.8, "unit": "mg", "rdi": "16%" },
        { "name": "Magnesium", "value": 92, "unit": "mg", "rdi": "23%" },
        { "name": "Potassium", "value": 628, "unit": "mg", "rdi": "18%" }
      ]
    },
    "healthBenefits": [
      "Rich in tartaric acid, a potent antioxidant.",
      "Used traditionally as a laxative and to aid digestion.",
      "Contains essential minerals like iron, magnesium, and potassium.",
      "May help lower cholesterol levels."
    ],
    "potentialAllergies": [
      { "name": "Tamarind Allergy", "severity": "Rare", "details": "Allergies are uncommon." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Tropical and subtropical. Drought-resistant once established.\n2. Soil: Grows in a wide variety of soils but prefers deep, well-drained loamy soil.\n3. Propagation: Primarily by seeds. Grafting can be used for superior types.\n4. Planting: Plant in full sun. Trees can grow very large.\n5. Watering: Young trees need regular watering. Mature trees are very drought-tolerant.\n6. Harvesting: Pods are harvested when they turn brown and brittle. The pulp is extracted from the pods.",
    "growthDuration": "Seedling trees may take 6-12 years to bear fruit. Fruits ripen in late winter to spring.",
    "sustainabilityTips": [
      "Tamarind pulp is often sold as a paste or block, which has a long shelf life.",
      "Used extensively as a souring agent in Asian, Latin American, and Caribbean cuisines.",
      "Seeds can be roasted or boiled and eaten, or ground into flour."
    ],
    "carbonFootprintInfo": "Moderate, as it's often transported in processed forms (paste, block) which are dense (0.5-1.0 kg CO2e/kg).",
    "staticRecipes": [
      {
        "name": "Tamarind Paste/Pulp from Block",
        "description": "How to make tamarind paste from a block of tamarind pulp for use in cooking.",
        "ingredients": ["1 block of tamarind pulp (about 200g)", "1.5 - 2 cups hot water"],
        "steps": ["Break the tamarind block into smaller pieces and place it in a heatproof bowl.", "Pour hot (not boiling) water over the tamarind pieces, just enough to cover them. Let it soak for 20-30 minutes, or until the pulp softens.", "Once softened, use your fingers (clean hands!) or a sturdy spoon to mash the pulp thoroughly in the water. Squeeze the pulp to release its essence into the water. The water will turn brown and thick.", "Strain the mixture through a fine-mesh sieve into another bowl. Press down firmly on the solids in the sieve with the back of a spoon to extract as much thick pulp as possible.", "Discard the seeds and fibrous material left in the sieve.", "The resulting thick liquid is tamarind paste/pulp. It can be stored in an airtight container in the refrigerator for a few weeks or frozen for longer storage."]
      },
      {
        "name": "Tamarind Chutney (Imli Chutney)",
        "description": "A sweet and tangy Indian chutney, perfect with snacks like samosas or chaat.",
        "ingredients": ["1/2 cup tamarind paste (see recipe above, or store-bought)", "1 cup water", "1/2 cup jaggery or brown sugar, grated or powdered", "1/2 tsp roasted cumin powder", "1/4 tsp red chili powder (optional)", "1/4 tsp ginger powder (saunth)", "Black salt (kala namak) to taste", "Pinch of asafoetida (hing, optional)"],
        "steps": ["In a saucepan, combine tamarind paste and 1 cup of water. Bring to a simmer and cook for 5-7 minutes, stirring occasionally.", "Add jaggery/brown sugar and continue to cook, stirring, until it dissolves completely.", "Stir in roasted cumin powder, red chili powder (if using), ginger powder, and black salt.", "If using asafoetida, you can temper it in a tiny bit of hot oil and add to the chutney for extra flavor (optional).", "Simmer the chutney for another 5-10 minutes, or until it thickens to your desired consistency. It will thicken more as it cools.", "Let the chutney cool completely. Store in an airtight container in the refrigerator. It lasts for several weeks."]
      },
      {
        "name": "Tamarind Rice (Pulihora/Puliyogare - Simplified)",
        "description": "A tangy and flavorful South Indian rice dish.",
        "ingredients": ["1 cup cooked rice, cooled", "2-3 tbsp tamarind paste", "For tempering: 1 tbsp oil, 1 tsp mustard seeds, 1 tsp chana dal (split chickpeas), 1 tsp urad dal (split black lentils), 2-3 dried red chilies (broken), a few curry leaves, 1/4 tsp asafoetida (hing)", "2 tbsp peanuts or cashews", "1/4 tsp turmeric powder", "Salt to taste", "Optional: 1 tbsp jaggery (for a hint of sweetness)"],
        "steps": ["Heat oil in a pan. Add mustard seeds; when they splutter, add chana dal, urad dal, and peanuts/cashews. Sauté until dals turn golden and nuts are roasted.", "Add dried red chilies, curry leaves, and asafoetida. Sauté for a few seconds.", "Add tamarind paste and turmeric powder. Cook for 2-3 minutes, stirring, until the raw smell of tamarind disappears. If it's too thick, add a little water.", "Add salt and jaggery (if using). Mix well.", "Add the cooked rice to the pan. Gently mix everything together until the rice is well coated with the tamarind mixture.", "Cook for another 2-3 minutes, stirring gently. Serve warm or at room temperature."]
      }
    ]
  },
  {
    "id": "passion-fruit",
    "commonName": "Passion Fruit",
    "scientificName": "Passiflora edulis",
    "image": "https://placehold.co/600x435.png",
    "description": "A vine species of passion flower native to southern Brazil through Paraguay and northern Argentina. It is cultivated commercially in tropical and subtropical areas for its sweet, seedy fruit.",
    "origin": "Southern Brazil, Paraguay, Northern Argentina",
    "localNames": ["Maracuyá (Spanish)", "Fruit de la passion (French)", "Granadilla (some varieties)"],
    "regions": ["Brazil", "Colombia", "Ecuador", "Australia", "New Zealand", "Kenya", "Hawaii"],
    "seasons": ["Varies by region, can fruit year-round in some tropical climates"],
    "nutrition": {
      "calories": "97 kcal per 100g (pulp)",
      "macronutrients": [
        { "name": "Protein", "value": 2.2, "unit": "g" },
        { "name": "Carbohydrates", "value": 23.4, "unit": "g" },
        { "name": "Fat", "value": 0.7, "unit": "g" },
        { "name": "Fiber", "value": 10.4, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 30, "unit": "mg", "rdi": "50%" },
        { "name": "Vitamin A", "value": 64, "unit": "µg RAE", "rdi": "7%" }
      ],
      "minerals": [
        { "name": "Potassium", "value": 348, "unit": "mg", "rdi": "10%" },
        { "name": "Iron", "value": 1.6, "unit": "mg", "rdi": "9%" }
      ]
    },
    "healthBenefits": [
      "Rich in dietary fiber, promoting digestive health and regularity.",
      "Good source of Vitamin C and Vitamin A, supporting immune function and vision.",
      "Contains antioxidants that help combat free radicals.",
      "May have calming effects and aid in sleep due to certain compounds."
    ],
    "potentialAllergies": [
      { "name": "Passion Fruit Allergy", "severity": "Rare", "details": "Allergies are uncommon but can occur." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Tropical and subtropical. Some varieties tolerate cooler conditions.\n2. Soil: Well-drained, fertile soil rich in organic matter. pH 6.5-7.5.\n3. Propagation: Seeds or cuttings.\n4. Planting: Plant in full sun against a trellis, fence, or arbor for support as it's a vigorous vine.\n5. Watering: Requires regular watering, especially during flowering and fruiting.\n6. Fertilizing: Feed regularly with a balanced fertilizer during the growing season.\n7. Pollination: Some varieties are self-pollinating; others require cross-pollination or hand pollination.\n8. Harvesting: Fruits drop from the vine when ripe or can be picked when they change color (purple or yellow, depending on variety) and become slightly wrinkled.",
    "growthDuration": "Vines can start fruiting within 6-12 months from planting. Fruits mature in 70-80 days after pollination.",
    "sustainabilityTips": [
      "Store passion fruit at room temperature until wrinkled (indicating ripeness), then refrigerate.",
      "Pulp can be scooped out and eaten fresh, added to drinks, or used in desserts.",
      "Freeze pulp for later use."
    ],
    "carbonFootprintInfo": "Moderate to high if air-freighted from distant tropical regions (0.8-2.5 kg CO2e/kg).",
    "staticRecipes": [
      {
        "name": "Fresh Passion Fruit Pulp",
        "description": "The simplest way to enjoy the intense, aromatic flavor of passion fruit.",
        "ingredients": ["1-2 ripe Passion Fruits"],
        "steps": ["Wash the passion fruit.", "Cut the fruit in half crosswise.", "Use a spoon to scoop out the aromatic, jelly-like pulp along with the edible black seeds.", "The pulp can be eaten directly, seeds and all. It's tangy, sweet, and highly flavorful. Often used as a topping for yogurt, ice cream, or desserts."]
      },
      {
        "name": "Passion Fruit Juice/Cooler",
        "description": "A refreshing tropical drink bursting with flavor.",
        "ingredients": ["Pulp of 4-5 ripe Passion Fruits", "1 cup cold water (or sparkling water)", "2-4 tbsp sugar or simple syrup (to taste)", "Ice cubes", "Mint sprig for garnish (optional)"],
        "steps": ["Scoop the pulp from the passion fruits into a blender or a bowl.", "If using a blender, add a little water and pulse a few times briefly just to loosen the pulp from the seeds (don't over-blend or you'll crush the seeds too much). If not using a blender, mash the pulp with a fork in a bowl with a little water.", "Strain the mixture through a fine-mesh sieve into a pitcher, pressing down on the pulp to extract as much juice as possible. Discard the seeds and membrane caught in the sieve.", "Add the remaining cold/sparkling water and sugar/simple syrup to the pitcher. Stir well until the sweetener is dissolved.", "Taste and adjust sweetness. Serve chilled over ice, garnished with a mint sprig if desired."]
      },
      {
        "name": "Passion Fruit Mousse",
        "description": "A light and airy dessert with the exotic taste of passion fruit.",
        "ingredients": ["1/2 cup passion fruit pulp (seeds strained if preferred)", "1 cup heavy whipping cream", "1/4 cup powdered sugar (or to taste)", "1 tsp gelatin dissolved in 2 tbsp hot water (or agar-agar for vegetarian)", "Optional: extra passion fruit pulp for topping"],
        "steps": ["If using gelatin, dissolve it in hot water and let it cool slightly. If using agar-agar, prepare according to package instructions with a little liquid and heat.", "In a chilled bowl, whip the heavy cream with powdered sugar until soft peaks form.", "Gently fold the passion fruit pulp into the whipped cream.", "If using gelatin/agar-agar, gently fold the cooled (but still liquid) mixture into the cream and passion fruit mixture until just combined.", "Spoon the mousse into individual serving glasses or a larger bowl.", "Chill in the refrigerator for at least 2-3 hours, or until set.", "Serve chilled, optionally topped with a drizzle of fresh passion fruit pulp."]
      }
    ]
  },
  {
    "id": "kiwi",
    "commonName": "Kiwi (Kiwifruit)",
    "scientificName": "Actinidia deliciosa",
    "image": "https://placehold.co/600x436.png",
    "description": "An edible berry of several species of woody vines in the genus Actinidia. The most common cultivar group of kiwifruit is oval, about the size of a large hen's egg. It has a fibrous, dull greenish-brown skin and bright green or golden flesh with rows of tiny, black, edible seeds.",
    "origin": "Eastern China",
    "localNames": ["Chinese Gooseberry (older name)", "Kiwi (common worldwide)"],
    "regions": ["China", "New Zealand", "Italy", "Chile", "Greece", "France"],
    "seasons": ["Varies by hemisphere; generally late autumn to spring"],
    "nutrition": {
      "calories": "61 kcal per 100g",
      "macronutrients": [
        { "name": "Protein", "value": 1.1, "unit": "g" },
        { "name": "Carbohydrates", "value": 14.7, "unit": "g" },
        { "name": "Fat", "value": 0.5, "unit": "g" },
        { "name": "Fiber", "value": 3, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 92.7, "unit": "mg", "rdi": "155%" },
        { "name": "Vitamin K", "value": 40.3, "unit": "µg", "rdi": "50%" },
        { "name": "Vitamin E", "value": 1.5, "unit": "mg", "rdi": "10%" }
      ],
      "minerals": [
        { "name": "Potassium", "value": 312, "unit": "mg", "rdi": "9%" }
      ]
    },
    "healthBenefits": [
      "Excellent source of Vitamin C, boosting the immune system and skin health.",
      "Rich in Vitamin K, important for blood clotting and bone health.",
      "Good source of dietary fiber, aiding digestion and promoting satiety.",
      "Contains antioxidants and serotonin, which may improve sleep quality."
    ],
    "potentialAllergies": [
      { "name": "Kiwi Allergy", "severity": "Mild", "details": "Can cause oral allergy syndrome (itching of mouth, lips, tongue) in sensitive individuals. Contains actinidin, an enzyme that can be an allergen." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Temperate climates with sufficient winter chill. Requires a long growing season.\n2. Soil: Well-drained, fertile, slightly acidic soil (pH 5.5-6.5) rich in organic matter.\n3. Propagation: Seeds, cuttings, or grafting. Most commercial kiwis are dioecious (separate male and female plants), requiring both for fruit production.\n4. Planting: Plant in full sun on a sturdy trellis or pergola for the vigorous vines.\n5. Watering: Requires consistent moisture, especially during the growing season and fruit development.\n6. Fertilizing: Apply balanced fertilizer regularly during the growing season.\n7. Pruning: Extensive pruning is necessary during dormancy and summer to manage growth and encourage fruiting.\n8. Harvesting: Fruits are harvested when firm and mature. They ripen off the vine.",
    "growthDuration": "Vines typically start bearing fruit in 3-5 years. Fruit matures in late autumn.",
    "sustainabilityTips": [
      "Store kiwis at room temperature to ripen, then refrigerate for longer storage.",
      "Kiwis can be eaten by cutting in half and scooping out the flesh, or by peeling and slicing.",
      "The skin is edible for some varieties if well-washed (and fuzz removed for green kiwis)."
    ],
    "carbonFootprintInfo": "Moderate to high if transported long distances (0.7-1.8 kg CO2e/kg).",
    "staticRecipes": [
      {
        "name": "Fresh Kiwi Slices",
        "description": "The simplest way to enjoy the refreshing taste and vibrant color of kiwi.",
        "ingredients": ["1-2 ripe Kiwis"],
        "steps": ["Wash the kiwi.", "You can either cut the kiwi in half crosswise and scoop out the flesh with a spoon, or peel the kiwi with a knife or vegetable peeler and then slice it into rounds.", "The small black seeds are edible.", "Serve immediately."]
      },
      {
        "name": "Kiwi and Strawberry Smoothie",
        "description": "A vibrant and vitamin-packed smoothie.",
        "ingredients": ["2 ripe kiwis, peeled and chopped", "1 cup fresh or frozen strawberries", "1/2 banana (optional, for creaminess)", "1/2 cup yogurt (plain or vanilla)", "1/4 cup milk or orange juice", "Honey or maple syrup to taste (optional)"],
        "steps": ["Combine chopped kiwi, strawberries, banana (if using), yogurt, and milk/orange juice in a blender.", "Blend until smooth and creamy.", "Taste and add honey or maple syrup if a sweeter smoothie is desired. Blend again briefly.", "Pour into a glass and serve immediately."]
      },
      {
        "name": "Kiwi Fruit Salad with Mint and Lime",
        "description": "A refreshing fruit salad where kiwi takes center stage.",
        "ingredients": ["3 ripe kiwis, peeled and diced or sliced", "1 cup other fruits (e.g., pineapple chunks, grapes, melon balls)", "Juice of 1/2 lime", "1 tbsp honey (optional)", "A few fresh mint leaves, chopped"],
        "steps": ["In a medium bowl, gently combine diced/sliced kiwi and other chosen fruits.", "In a small bowl, whisk together lime juice and honey (if using).", "Drizzle the lime-honey mixture over the fruit salad.", "Sprinkle with fresh chopped mint.", "Toss gently to combine. Serve chilled or at room temperature."]
      }
    ]
  },
  {
    "id": "dragon-fruit",
    "commonName": "Dragon Fruit (Pitaya)",
    "scientificName": "Hylocereus undatus (most common), Selenicereus spp.",
    "image": "https://placehold.co/600x437.png",
    "description": "A fruit from several different cactus species. It has a vibrant pink or yellow skin with green scales and white or red flesh dotted with tiny black seeds. The flavor is mildly sweet.",
    "origin": "Mexico, Central and South America",
    "localNames": ["Pitaya (Spanish)", "Thang Loy (Thai)", "Buah Naga (Indonesian/Malay)"],
    "regions": ["Vietnam", "Thailand", "China", "Mexico", "Israel", "Australia", "United States (Florida, California)"],
    "seasons": ["Summer to early Autumn, varies by region"],
    "nutrition": {
      "calories": "60 kcal per 100g",
      "macronutrients": [
        { "name": "Protein", "value": 1.2, "unit": "g" },
        { "name": "Carbohydrates", "value": 13, "unit": "g" },
        { "name": "Fat", "value": 0.6, "unit": "g" },
        { "name": "Fiber", "value": 2.9, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 2.5, "unit": "mg", "rdi": "4%" }
      ],
      "minerals": [
        { "name": "Iron", "value": 0.74, "unit": "mg", "rdi": "4%" },
        { "name": "Magnesium", "value": 18, "unit": "mg", "rdi": "4%" }
      ]
    },
    "healthBenefits": [
      "Good source of fiber, aiding digestion.",
      "Contains antioxidants like betacyanins (in red-fleshed varieties) and hydroxycinnamates.",
      "May boost the immune system due to its Vitamin C and carotenoid content.",
      "Rich in prebiotics, which feed healthy gut bacteria."
    ],
    "potentialAllergies": [
      { "name": "Dragon Fruit Allergy", "severity": "Rare", "details": "Allergies are very uncommon." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Tropical or subtropical, thrives in warm, humid environments. Needs support for climbing (cactus vine).\n2. Soil: Well-draining soil, sandy loam is ideal. Tolerates poor soils but benefits from organic matter.\n3. Propagation: Easily grown from seeds or stem cuttings.\n4. Planting: Plant cuttings or seedlings near a sturdy trellis, post, or wall for support.\n5. Watering: Water regularly, but allow soil to dry out slightly between waterings. Drought-tolerant once established.\n6. Fertilizing: Apply balanced fertilizer or organic compost during the growing season.\n7. Pollination: Flowers are nocturnal and often require hand pollination or specific pollinators (moths, bats) for good fruit set, especially for some varieties.\n8. Harvesting: Fruit is ready when the skin color is vibrant (pink or yellow) and the 'wings' or scales start to wither slightly. It should detach easily.",
    "growthDuration": "Can start bearing fruit in 1-3 years from cuttings. Fruits mature 30-50 days after flowering.",
    "sustainabilityTips": [
      "Store at room temperature for a few days or refrigerate for longer life.",
      "Eat fresh by scooping out the flesh. The tiny black seeds are edible.",
      "Compost the skin."
    ],
    "carbonFootprintInfo": "Moderate to high if transported from distant tropical regions (0.8-2.0 kg CO2e/kg).",
    "staticRecipes": [
      {
        "name": "Dragon Fruit Smoothie Bowl",
        "description": "A vibrant and healthy smoothie bowl topped with fresh fruits and nuts.",
        "ingredients": ["1 frozen dragon fruit (pink or white flesh), chopped", "1/2 frozen banana", "1/2 cup coconut water or almond milk", "Toppings: Sliced fresh dragon fruit, berries, granola, chia seeds, coconut flakes"],
        "steps": ["Combine frozen dragon fruit, frozen banana, and coconut water/milk in a high-speed blender.", "Blend until thick and smooth, like soft-serve ice cream. Add a little more liquid if needed, but keep it thick.", "Pour the smoothie into a bowl.", "Arrange toppings decoratively over the smoothie bowl.", "Serve immediately."]
      },
      {
        "name": "Dragon Fruit Salad",
        "description": "A refreshing and visually stunning fruit salad.",
        "ingredients": ["1 dragon fruit, peeled and cubed", "1 cup mixed berries (strawberries, blueberries)", "1 kiwi, peeled and sliced", "1/2 mango, peeled and cubed (optional)", "Juice of 1/2 lime", "1 tbsp honey or agave (optional)", "Fresh mint leaves for garnish"],
        "steps": ["In a large bowl, gently combine cubed dragon fruit, mixed berries, sliced kiwi, and mango (if using).", "In a small bowl, whisk together lime juice and honey/agave (if using).", "Drizzle the dressing over the fruit salad.", "Garnish with fresh mint leaves. Toss gently and serve chilled."]
      },
      {
        "name": "Dragon Fruit Lemonade",
        "description": "A colorful and exotic twist on classic lemonade.",
        "ingredients": ["1/4 cup dragon fruit puree (blend flesh of 1/2 dragon fruit)", "1 cup fresh lemon juice", "1/2 cup sugar (or to taste)", "4 cups cold water", "Ice cubes", "Dragon fruit slices and lemon slices for garnish"],
        "steps": ["In a small saucepan, make simple syrup by combining sugar and 1 cup of water. Heat until sugar dissolves, then let cool.", "In a large pitcher, combine lemon juice, cooled simple syrup, dragon fruit puree, and the remaining 3 cups of cold water.", "Stir well to combine. Taste and adjust sweetness if needed.", "Serve over ice, garnished with dragon fruit slices and lemon slices."]
      }
    ]
  },
  {
    "id": "avocado",
    "commonName": "Avocado",
    "scientificName": "Persea americana",
    "image": "https://placehold.co/600x438.png",
    "description": "A large berry containing a single large seed. It has a creamy texture and rich, buttery flavor. Known for its healthy fats.",
    "origin": "South-central Mexico",
    "localNames": ["Aguacate (Spanish)", "Avocat (French)", "Palta (some South American countries)"],
    "regions": ["Mexico", "Dominican Republic", "Peru", "Indonesia", "Colombia", "Brazil", "United States (California)"],
    "seasons": ["Varies by variety and region; often year-round availability due to global sourcing"],
    "nutrition": {
      "calories": "160 kcal per 100g",
      "macronutrients": [
        { "name": "Protein", "value": 2, "unit": "g" },
        { "name": "Carbohydrates", "value": 8.5, "unit": "g" },
        { "name": "Fat", "value": 14.7, "unit": "g" },
        { "name": "Fiber", "value": 6.7, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin K", "value": 21, "unit": "µg", "rdi": "26%" },
        { "name": "Folate", "value": 81, "unit": "µg", "rdi": "20%" },
        { "name": "Vitamin C", "value": 10, "unit": "mg", "rdi": "17%" },
        { "name": "Vitamin B5 (Pantothenic Acid)", "value": 1.4, "unit": "mg", "rdi": "28%" }
      ],
      "minerals": [
        { "name": "Potassium", "value": 485, "unit": "mg", "rdi": "14%" }
      ]
    },
    "healthBenefits": [
      "Rich in monounsaturated fats, particularly oleic acid, beneficial for heart health.",
      "High in fiber, aiding digestion and promoting satiety.",
      "Excellent source of potassium, which helps regulate blood pressure.",
      "Contains various vitamins and antioxidants that support overall health."
    ],
    "potentialAllergies": [
      { "name": "Latex-Fruit Syndrome", "severity": "Mild", "details": "Individuals allergic to latex may also react to avocados." },
      { "name": "Avocado Allergy", "severity": "Rare", "details": "True avocado allergy is rare but can cause oral allergy symptoms or more severe reactions." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Subtropical to tropical. Different varieties have different cold tolerances.\n2. Soil: Well-drained, aerated soil with a pH of 6.0-7.0. Avoid heavy clay soils.\n3. Propagation: Usually by grafting onto rootstock. Growing from seed is possible but fruit quality is unpredictable and takes longer.\n4. Planting: Plant in full sun, protected from strong winds.\n5. Watering: Regular, deep watering, especially for young trees and during fruit development. Allow soil to dry slightly between waterings.\n6. Fertilizing: Apply balanced citrus/avocado fertilizer several times a year.\n7. Harvesting: Avocados do not ripen on the tree. They are harvested when mature (size and oil content) and then ripen at room temperature. Maturity signs vary by variety.",
    "growthDuration": "Grafted trees can start bearing fruit in 3-5 years. Fruits take 6-18 months to mature on the tree, depending on variety.",
    "sustainabilityTips": [
      "Store unripe avocados at room temperature; ripened ones in the refrigerator.",
      "To speed up ripening, place in a paper bag with an apple or banana.",
      "Use lemon/lime juice on cut avocado to prevent browning.",
      "Consider water usage in avocado production; choose sources with sustainable water practices if possible."
    ],
    "carbonFootprintInfo": "Can be high due to water requirements and transportation (0.8-2.5 kg CO2e/kg).",
    "staticRecipes": [
      {
        "name": "Classic Guacamole",
        "description": "A staple Mexican dip made from mashed avocados, lime juice, onions, cilantro, and seasonings.",
        "ingredients": ["3 ripe avocados", "1/2 small onion, finely chopped", "1-2 jalapeños or serrano peppers, minced (optional)", "1/2 cup chopped fresh cilantro", "Juice of 1-2 limes", "Salt to taste", "Optional: 1/2 cup diced tomatoes"],
        "steps": ["Cut avocados in half, remove pits, and scoop flesh into a medium bowl.", "Mash the avocado with a fork to desired consistency (chunky or smooth).", "Add chopped onion, minced jalapeño/serrano (if using), cilantro, and lime juice. Stir to combine.", "Season with salt to taste. If using tomatoes, gently fold them in.", "Serve immediately with tortilla chips or as a topping."]
      },
      {
        "name": "Avocado Toast",
        "description": "A simple and popular breakfast or snack.",
        "ingredients": ["1 ripe avocado", "2 slices of your favorite bread, toasted", "Salt and pepper to taste", "Optional toppings: Red pepper flakes, everything bagel seasoning, a drizzle of olive oil, a squeeze of lemon juice, a fried egg"],
        "steps": ["Toast bread slices to desired crispness.", "Mash avocado in a small bowl with a fork. Season with salt and pepper (and lemon juice if using).", "Spread the mashed avocado evenly over the toasted bread.", "Add any desired toppings. Serve immediately."]
      },
      {
        "name": "Avocado Chocolate Mousse",
        "description": "A surprisingly delicious and healthy dessert that's rich and creamy.",
        "ingredients": ["2 ripe avocados", "1/4 cup unsweetened cocoa powder", "1/4 cup maple syrup or honey (or to taste)", "1/4 cup almond milk or other non-dairy milk", "1 tsp vanilla extract", "Pinch of salt"],
        "steps": ["Combine avocado flesh, cocoa powder, maple syrup/honey, almond milk, vanilla extract, and salt in a food processor or high-speed blender.", "Blend until completely smooth and creamy, scraping down the sides as needed.", "Taste and adjust sweetness if necessary.", "Divide into small serving dishes and chill in the refrigerator for at least 30 minutes to an hour to firm up.", "Serve chilled. Can be topped with berries or chocolate shavings."]
      }
    ]
  },
  {
    "id": "mulberry",
    "commonName": "Mulberry",
    "scientificName": "Morus spp.",
    "image": "https://placehold.co/600x439.png",
    "description": "A fast-growing, small to medium-sized tree native to warm temperate and subtropical regions. The fruit is a multiple fruit, about 2–3 cm long, resembling a blackberry. They can be red, dark purple, or white.",
    "origin": "Asia, North America",
    "localNames": ["Shahtoot (Hindi/Urdu)", "Mora (Spanish)", "Mûre (French - also refers to blackberry)"],
    "regions": ["China", "India", "Turkey", "Iran", "United States", "Southern Europe"],
    "seasons": ["Late Spring to Summer"],
    "nutrition": {
      "calories": "43 kcal per 100g",
      "macronutrients": [
        { "name": "Protein", "value": 1.4, "unit": "g" },
        { "name": "Carbohydrates", "value": 9.8, "unit": "g" },
        { "name": "Fat", "value": 0.4, "unit": "g" },
        { "name": "Fiber", "value": 1.7, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 36.4, "unit": "mg", "rdi": "61%" },
        { "name": "Vitamin K", "value": 7.8, "unit": "µg", "rdi": "10%" }
      ],
      "minerals": [
        { "name": "Iron", "value": 1.85, "unit": "mg", "rdi": "10%" },
        { "name": "Potassium", "value": 194, "unit": "mg", "rdi": "6%" }
      ]
    },
    "healthBenefits": [
      "Rich in Vitamin C and iron.",
      "Contain antioxidants like anthocyanins and resveratrol.",
      "May help lower cholesterol and blood sugar levels.",
      "Traditionally used to improve eyesight and boost immunity."
    ],
    "potentialAllergies": [
      { "name": "Mulberry Pollen Allergy", "severity": "Mild", "details": "Pollen from mulberry trees can be allergenic for some individuals." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Adaptable to a wide range of temperate and subtropical climates. Some varieties are drought-tolerant.\n2. Soil: Prefers well-drained, fertile loamy soil but tolerates various soil types.\n3. Propagation: Easily grown from seeds, cuttings, or grafting.\n4. Planting: Plant in full sun. Trees can grow quite large and spread.\n5. Watering: Water young trees regularly. Established trees are relatively drought-tolerant.\n6. Fertilizing: Generally do not require much fertilization. Organic compost can be beneficial.\n7. Pruning: Prune to maintain shape and size, and to remove dead or diseased wood.\n8. Harvesting: Fruits are harvested when they are fully colored (red, purple, or white depending on variety) and detach easily. They are very soft and perishable.",
    "growthDuration": "Can start bearing fruit in 2-3 years. Fruits ripen in late spring to summer.",
    "sustainabilityTips": [
      "Mulberries are highly perishable; consume or process them quickly after picking.",
      "They stain easily, so be careful when harvesting and eating.",
      "Excellent for jams, jellies, pies, or drying."
    ],
    "carbonFootprintInfo": "Low, especially if foraged or grown locally (0.2-0.5 kg CO2e/kg).",
    "staticRecipes": [
      {
        "name": "Mulberry Jam",
        "description": "A sweet and slightly tart jam made from fresh mulberries.",
        "ingredients": ["4 cups fresh mulberries, rinsed", "2 cups granulated sugar", "2 tbsp lemon juice"],
        "steps": ["Combine mulberries, sugar, and lemon juice in a large, heavy-bottomed pot.", "Mash the mulberries slightly with a potato masher or fork.", "Bring the mixture to a boil over medium-high heat, stirring constantly.", "Reduce heat to medium-low and continue to simmer, stirring frequently, until the jam thickens. This can take 20-30 minutes. To test for doneness, place a small amount of jam on a chilled plate; if it wrinkles when pushed, it's ready.", "Skim off any foam from the surface.", "Ladle hot jam into sterilized jars, leaving 1/4-inch headspace. Seal and process in a boiling water bath for 10 minutes for longer storage, or store in the refrigerator for up to a few weeks."]
      },
      {
        "name": "Fresh Mulberry Parfait",
        "description": "A simple and healthy dessert or breakfast layering mulberries, yogurt, and granola.",
        "ingredients": ["1 cup fresh mulberries", "1 cup plain or vanilla yogurt", "1/2 cup granola", "Honey or maple syrup for drizzling (optional)"],
        "steps": ["In a glass or small bowl, layer ingredients: start with a layer of yogurt, followed by a layer of mulberries, then a layer of granola.", "Repeat the layers if desired.", "Drizzle with honey or maple syrup if using.", "Serve immediately for best texture."]
      },
      {
        "name": "Mulberry Crumble Pie",
        "description": "A comforting pie with a sweet mulberry filling and a buttery crumble topping.",
        "ingredients": ["For filling: 4 cups fresh mulberries", "1/2 cup sugar", "2 tbsp all-purpose flour or cornstarch", "1 tbsp lemon juice", "For crumble: 1 cup all-purpose flour", "1/2 cup brown sugar", "1/2 cup cold butter, cubed", "1/2 cup rolled oats (optional)", "Unbaked 9-inch pie crust"],
        "steps": ["Preheat oven to 375°F (190°C).", "Prepare pie crust in a 9-inch pie dish.", "Filling: In a large bowl, gently toss mulberries with sugar, flour/cornstarch, and lemon juice. Pour into the unbaked pie crust.", "Crumble: In another bowl, combine flour and brown sugar. Cut in cold butter until the mixture resembles coarse crumbs. Stir in oats if using.", "Sprinkle the crumble topping evenly over the mulberry filling.", "Bake for 40-50 minutes, or until the crust is golden brown and the filling is bubbly. Cover edges of crust with foil if they start to brown too quickly.", "Let cool for at least 30 minutes before slicing and serving."]
      }
    ]
  },
  {
    "id": "raspberry",
    "commonName": "Raspberry",
    "scientificName": "Rubus idaeus",
    "image": "https://placehold.co/600x440.png",
    "description": "An edible fruit of a multitude of plant species in the genus Rubus of the rose family. Most are within the subgenus Idaeobatus. The fruit is a delicate aggregate fruit, typically red, but also black, purple, or golden.",
    "origin": "Europe, Northern Asia",
    "localNames": ["Frambuesa (Spanish)", "Framboise (French)", "Himbeere (German)"],
    "regions": ["Russia", "Mexico", "Poland", "United States", "Serbia"],
    "seasons": ["Summer to early Autumn"],
    "nutrition": {
      "calories": "52 kcal per 100g",
      "macronutrients": [
        { "name": "Protein", "value": 1.2, "unit": "g" },
        { "name": "Carbohydrates", "value": 11.9, "unit": "g" },
        { "name": "Fat", "value": 0.7, "unit": "g" },
        { "name": "Fiber", "value": 6.5, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 26.2, "unit": "mg", "rdi": "44%" },
        { "name": "Manganese", "value": 0.67, "unit": "mg", "rdi": "34%" }
      ],
      "minerals": [
        { "name": "Potassium", "value": 151, "unit": "mg", "rdi": "4%" }
      ]
    },
    "healthBenefits": [
      "High in dietary fiber, promoting digestive health.",
      "Rich in Vitamin C and antioxidants like anthocyanins and ellagic acid.",
      "May have anti-inflammatory properties.",
      "Can contribute to brain health and protect against age-related cognitive decline."
    ],
    "potentialAllergies": [
      { "name": "Raspberry Allergy", "severity": "Rare", "details": "Uncommon, but can cause oral allergy symptoms or skin reactions in sensitive individuals." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Temperate climates. Many varieties require winter chill.\n2. Soil: Well-drained, fertile soil rich in organic matter. Slightly acidic pH (5.5-6.5).\n3. Propagation: From suckers or cane cuttings.\n4. Planting: Plant in early spring. Provide support like a trellis or wires for canes.\n5. Watering: Consistent moisture is important, especially during fruit development. Avoid waterlogged soil.\n6. Fertilizing: Apply balanced fertilizer or compost in spring.\n7. Pruning: Pruning methods vary depending on whether they are summer-bearing or everbearing varieties. Generally involves removing old, fruited canes.\n8. Harvesting: Berries are harvested when they are fully colored and detach easily from the receptacle. They are very delicate.",
    "growthDuration": "Canes often produce fruit in their second year. Harvest season is typically summer to early autumn.",
    "sustainabilityTips": [
      "Store unwashed raspberries in the refrigerator in a shallow container; consume within 1-2 days.",
      "Wash gently just before eating.",
      "Freeze excess raspberries on a baking sheet before transferring to a freezer bag."
    ],
    "carbonFootprintInfo": "Moderate, can be higher if air-freighted due to perishability (0.8-2.0 kg CO2e/kg). Local and seasonal are best.",
    "staticRecipes": [
      {
        "name": "Fresh Raspberries with Cream",
        "description": "A simple and elegant dessert highlighting the natural flavor of raspberries.",
        "ingredients": ["1 pint fresh raspberries", "1/4 cup heavy cream or crème fraîche", "1-2 tsp powdered sugar (optional)"],
        "steps": ["Gently rinse raspberries and pat dry.", "Divide raspberries among serving bowls.", "If using powdered sugar, lightly sweeten the heavy cream or crème fraîche.", "Drizzle the cream over the raspberries.", "Serve immediately."]
      },
      {
        "name": "Raspberry Vinaigrette",
        "description": "A vibrant and flavorful dressing for salads.",
        "ingredients": ["1/2 cup fresh or frozen raspberries", "1/4 cup olive oil", "2 tbsp red wine vinegar or apple cider vinegar", "1 tbsp honey or maple syrup", "1 tsp Dijon mustard", "Salt and pepper to taste"],
        "steps": ["If using frozen raspberries, thaw them slightly.", "Combine raspberries, olive oil, vinegar, honey/maple syrup, and Dijon mustard in a blender or food processor.", "Blend until smooth.", "Strain the mixture through a fine-mesh sieve to remove seeds, if desired.", "Season with salt and pepper to taste. Store in an airtight container in the refrigerator."]
      },
      {
        "name": "Raspberry Oatmeal Crumble Bars",
        "description": "Delicious and relatively healthy bars with a raspberry filling and an oat crumble topping.",
        "ingredients": ["For crust/crumble: 1 1/2 cups rolled oats, 1 cup all-purpose flour, 3/4 cup brown sugar, 1/2 tsp cinnamon, 1/2 cup cold butter (cubed)", "For filling: 2 cups fresh or frozen raspberries, 1/4 cup granulated sugar, 1 tbsp cornstarch, 1 tbsp lemon juice"],
        "steps": ["Preheat oven to 375°F (190°C). Grease and flour an 8x8 inch baking pan.", "Crust/Crumble: In a medium bowl, combine rolled oats, flour, brown sugar, and cinnamon. Cut in cold butter using a pastry blender or your fingers until the mixture resembles coarse crumbs. Reserve about 1 cup of the crumble mixture for the topping. Press the remaining mixture firmly into the bottom of the prepared pan to form the crust.", "Bake the crust for 10 minutes.", "Filling: While crust is baking, combine raspberries, granulated sugar, cornstarch, and lemon juice in a saucepan. Cook over medium heat, stirring frequently, until the mixture thickens and raspberries start to break down (about 5-7 minutes).", "Pour the raspberry filling evenly over the partially baked crust.", "Sprinkle the reserved crumble mixture over the filling.", "Bake for another 20-25 minutes, or until the topping is golden brown and the filling is bubbly.", "Let cool completely in the pan before cutting into bars."]
      }
    ]
  },
  {
    "id": "blueberry",
    "commonName": "Blueberry",
    "scientificName": "Vaccinium sect. Cyanococcus",
    "image": "https://placehold.co/600x441.png",
    "description": "A small, round, blue to purple berry, known for its sweet and slightly tart flavor. They are native to North America.",
    "origin": "North America",
    "localNames": ["Arándano (Spanish)", "Myrtille (French - often refers to bilberry, but also blueberry)", "Blaubeere/Heidelbeere (German)"],
    "regions": ["United States", "Canada", "Chile", "Peru", "Poland", "Mexico"],
    "seasons": ["Summer"],
    "nutrition": {
      "calories": "57 kcal per 100g",
      "macronutrients": [
        { "name": "Protein", "value": 0.7, "unit": "g" },
        { "name": "Carbohydrates", "value": 14.5, "unit": "g" },
        { "name": "Fat", "value": 0.3, "unit": "g" },
        { "name": "Fiber", "value": 2.4, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 9.7, "unit": "mg", "rdi": "16%" },
        { "name": "Vitamin K", "value": 19.3, "unit": "µg", "rdi": "24%" },
        { "name": "Manganese", "value": 0.336, "unit": "mg", "rdi": "17%" }
      ],
      "minerals": [],
      "potentialAllergies": [
        { "name": "Blueberry Allergy", "severity": "Rare", "details": "Uncommon, but can occur." }
      ],
      "healthBenefits": [
        "Very high in antioxidants, particularly anthocyanins, which give them their blue color.",
        "May improve brain health and memory.",
        "Can help reduce DNA damage and protect against aging and cancer.",
        "Beneficial for heart health by lowering blood pressure and improving cholesterol levels."
      ]
    },
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Temperate. Require winter chill. Different types (highbush, lowbush, rabbiteye) have different needs.\n2. Soil: Very acidic (pH 4.0-5.0), well-drained, sandy soil rich in organic matter. Amend soil with peat moss or sulfur.\n3. Propagation: From cuttings or nursery plants.\n4. Planting: Plant in early spring in full sun.\n5. Watering: Consistent moisture is crucial, especially during establishment and fruit development. Use rainwater if possible due to acidity preference.\n6. Fertilizing: Use fertilizers formulated for acid-loving plants (e.g., azalea/rhododendron fertilizer).\n7. Mulching: Mulch with pine needles, wood chips, or sawdust to retain moisture, suppress weeds, and maintain soil acidity.\n8. Harvesting: Berries ripen over several weeks. Harvest when they are fully blue, plump, and detach easily.",
    "growthDuration": "Plants typically start producing a good crop 2-3 years after planting. Harvest season is summer.",
    "sustainabilityTips": [
      "Store unwashed blueberries in the refrigerator; consume within a week or two.",
      "Wash just before eating.",
      "Excellent for freezing: spread on a baking sheet to freeze individually, then transfer to a freezer bag."
    ],
    "carbonFootprintInfo": "Moderate, depending on origin and transport (0.7-1.5 kg CO2e/kg).",
    "staticRecipes": [
      {
        "name": "Classic Blueberry Muffins",
        "description": "Moist and fluffy muffins packed with fresh blueberries.",
        "ingredients": ["1 1/2 cups all-purpose flour", "3/4 cup granulated sugar", "1/2 tsp salt", "2 tsp baking powder", "1/3 cup vegetable oil", "1 egg, lightly beaten", "1/3 cup milk", "1 cup fresh or frozen blueberries (if frozen, do not thaw)"],
        "steps": ["Preheat oven to 400°F (200°C). Grease or line a 12-cup muffin tin.", "In a large bowl, combine flour, sugar, salt, and baking powder.", "In a separate small bowl, combine vegetable oil, egg, and milk.", "Pour the wet ingredients into the dry ingredients and mix until just moistened (do not overmix).", "Gently fold in the blueberries.", "Divide batter evenly among the prepared muffin cups.", "Bake for 20-25 minutes, or until a toothpick inserted into the center comes out clean. Let cool in pan for a few minutes before transferring to a wire rack."]
      },
      {
        "name": "Blueberry Pancakes",
        "description": "Fluffy pancakes dotted with juicy blueberries.",
        "ingredients": ["1 1/2 cups all-purpose flour", "2 tbsp sugar", "2 tsp baking powder", "1/2 tsp salt", "1 1/4 cups milk", "1 egg", "2 tbsp melted butter", "1 cup fresh or frozen blueberries"],
        "steps": ["In a large bowl, whisk together flour, sugar, baking powder, and salt.", "In a separate bowl, whisk together milk, egg, and melted butter.", "Pour the wet ingredients into the dry ingredients and stir until just combined (a few lumps are okay).", "Gently fold in the blueberries.", "Heat a lightly oiled griddle or frying pan over medium heat.", "Pour or scoop about 1/4 cup of batter per pancake onto the hot griddle. Cook for 2-3 minutes per side, or until golden brown and cooked through.", "Serve warm with maple syrup and extra blueberries if desired."]
      },
      {
        "name": "Simple Blueberry Sauce (Compote)",
        "description": "A versatile sauce perfect for topping pancakes, yogurt, ice cream, or cheesecake.",
        "ingredients": ["2 cups fresh or frozen blueberries", "1/4 cup sugar (or to taste)", "1 tbsp lemon juice", "2 tbsp water"],
        "steps": ["Combine blueberries, sugar, lemon juice, and water in a medium saucepan.", "Bring to a simmer over medium heat, stirring occasionally.", "Reduce heat to low and cook for 10-15 minutes, or until the blueberries have burst and the sauce has thickened slightly. Mash some of the berries against the side of the pan if you prefer a smoother sauce.", "Remove from heat and let cool. The sauce will thicken more as it cools.", "Serve warm or chilled. Store in an airtight container in the refrigerator."]
      }
    ]
  },
  {
    "id": "cherry",
    "commonName": "Cherry",
    "scientificName": "Prunus spp. (e.g., Prunus avium - sweet, Prunus cerasus - sour)",
    "image": "https://placehold.co/600x442.png",
    "description": "A small, round, fleshy stone fruit that is typically bright or dark red. There are two main types: sweet cherries and sour (or tart) cherries.",
    "origin": "Europe and Western Asia",
    "localNames": ["Cereza (Spanish)", "Cerise (French)", "Kirsche (German)"],
    "regions": ["Turkey", "United States", "Iran", "Chile", "Uzbekistan", "Spain", "Italy"],
    "seasons": ["Late Spring to Summer"],
    "nutrition": {
      "calories": "50 kcal per 100g (sweet cherries)",
      "macronutrients": [
        { "name": "Protein", "value": 1, "unit": "g" },
        { "name": "Carbohydrates", "value": 14, "unit": "g" },
        { "name": "Fat", "value": 0.2, "unit": "g" },
        { "name": "Fiber", "value": 2, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 7, "unit": "mg", "rdi": "12%" }
      ],
      "minerals": [
        { "name": "Potassium", "value": 222, "unit": "mg", "rdi": "6%" }
      ]
    },
    "healthBenefits": [
      "Rich in antioxidants and anti-inflammatory compounds, like anthocyanins and cyanidin.",
      "May help reduce muscle soreness and improve recovery after exercise.",
      "Can promote better sleep due to natural melatonin content (especially tart cherries).",
      "May help lower risk of gout attacks by reducing uric acid levels."
    ],
    "potentialAllergies": [
      { "name": "Cherry Allergy / Oral Allergy Syndrome (OAS)", "severity": "Mild", "details": "Can occur, often linked to birch pollen allergy." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Temperate climates. Sweet cherries require more sun and warmth than sour cherries. Both need winter chill.\n2. Soil: Deep, well-drained, fertile loamy soil. pH 6.0-7.0.\n3. Propagation: Grafting onto rootstock.\n4. Planting: Plant in early spring in full sun.\n5. Watering: Regular watering, especially for young trees and during fruit development.\n6. Fertilizing: Apply balanced fertilizer in early spring.\n7. Pruning: Prune to maintain an open structure for good air circulation and light penetration. Sweet cherries are often trained to a central leader, sour cherries more to an open center.\n8. Harvesting: Cherries are picked when fully ripe and have developed their characteristic color and sweetness. They do not ripen further after picking.",
    "growthDuration": "Grafted trees can start bearing fruit in 3-5 years. Harvest season is typically late spring to summer.",
    "sustainabilityTips": [
      "Store cherries unwashed in the refrigerator; consume within a few days for best quality.",
      "Wash just before eating.",
      "Pit cherries before freezing for easier use in recipes later."
    ],
    "carbonFootprintInfo": "Moderate, transport is a key factor (0.6-1.5 kg CO2e/kg).",
    "staticRecipes": [
      {
        "name": "Classic Cherry Pie",
        "description": "A beloved pie with a sweet or tart cherry filling encased in a flaky crust.",
        "ingredients": ["Double-crust pie dough (for a 9-inch pie)", "5-6 cups fresh or frozen pitted cherries (sweet or sour)", "3/4 to 1 cup granulated sugar (adjust based on cherry sweetness)", "1/4 cup cornstarch or all-purpose flour", "1 tbsp lemon juice", "1/4 tsp almond extract (optional)", "1 tbsp butter, cut into small pieces", "1 egg, beaten (for egg wash, optional)"],
        "steps": ["Preheat oven to 400°F (200°C). Line a 9-inch pie plate with bottom crust.", "In a large bowl, combine cherries, sugar, cornstarch/flour, lemon juice, and almond extract (if using). Toss gently to coat.", "Pour the cherry filling into the prepared pie crust. Dot with pieces of butter.", "Place the top crust over the filling. Crimp edges to seal. Cut vents in the top crust to allow steam to escape. If desired, brush with beaten egg for a golden finish.", "Bake for 40-50 minutes, or until the crust is golden brown and the filling is bubbly. Cover edges with foil if they brown too quickly.", "Let cool for at least 2-3 hours before slicing and serving to allow the filling to set."]
      },
      {
        "name": "Cherry Clafoutis",
        "description": "A rustic French dessert similar to a flan or baked pancake, filled with cherries.",
        "ingredients": ["1 lb fresh sweet cherries, pitted", "3 eggs", "1/2 cup granulated sugar", "1/2 cup all-purpose flour", "Pinch of salt", "1 cup milk (whole or 2%)", "1 tsp vanilla extract", "Powdered sugar for dusting"],
        "steps": ["Preheat oven to 350°F (175°C). Butter a 9-inch pie dish or shallow baking dish.", "Arrange the pitted cherries in a single layer in the prepared dish.", "In a medium bowl, whisk together eggs and sugar until pale and slightly thickened.", "Gradually whisk in flour and salt until smooth.", "Slowly whisk in milk and vanilla extract until the batter is smooth and resembles pancake batter.", "Pour the batter evenly over the cherries in the baking dish.", "Bake for 35-45 minutes, or until the clafoutis is puffed, golden brown, and set (a knife inserted near the center should come out clean).", "Let cool slightly. Dust with powdered sugar before serving warm or at room temperature."]
      },
      {
        "name": "Simple Cherry Sauce for Desserts",
        "description": "A quick and delicious sauce perfect for ice cream, cheesecake, or pancakes.",
        "ingredients": ["2 cups fresh or frozen pitted cherries", "1/4 cup sugar (or to taste)", "2 tbsp water", "1 tsp lemon juice", "1/4 tsp almond extract (optional)"],
        "steps": ["Combine cherries, sugar, water, and lemon juice in a medium saucepan.", "Bring to a simmer over medium heat, stirring occasionally.", "Reduce heat to low and cook for 10-15 minutes, or until the cherries have softened and released their juices, and the sauce has thickened slightly.", "Stir in almond extract if using.", "Serve warm or chilled. Store in an airtight container in the refrigerator."]
      }
    ]
  },
  {
    "id": "blackcurrant",
    "commonName": "Blackcurrant",
    "scientificName": "Ribes nigrum",
    "image": "https://placehold.co/600x443.png",
    "description": "A woody shrub in the family Grossulariaceae grown for its piquant berries. It is native to temperate parts of central and northern Europe and northern Asia.",
    "origin": "Northern Europe and Northern Asia",
    "localNames": ["Cassis (French)", "Schwarze Johannisbeere (German)", "Grosella negra (Spanish)"],
    "regions": ["Poland", "Russia", "Germany", "United Kingdom", "France", "New Zealand"],
    "seasons": ["Mid to Late Summer"],
    "nutrition": {
      "calories": "63 kcal per 100g",
      "macronutrients": [
        { "name": "Protein", "value": 1.4, "unit": "g" },
        { "name": "Carbohydrates", "value": 15.4, "unit": "g" },
        { "name": "Fat", "value": 0.4, "unit": "g" },
        { "name": "Fiber", "value": 4.3, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 181, "unit": "mg", "rdi": "302%" }
      ],
      "minerals": [
        { "name": "Manganese", "value": 0.256, "unit": "mg", "rdi": "13%" },
        { "name": "Potassium", "value": 322, "unit": "mg", "rdi": "9%" }
      ]
    },
    "healthBenefits": [
      "Exceptionally high in Vitamin C, a powerful antioxidant.",
      "Rich in anthocyanins and other polyphenols, which have strong antioxidant and anti-inflammatory effects.",
      "May improve eye health and reduce visual fatigue.",
      "Can boost immune function and support cardiovascular health."
    ],
    "potentialAllergies": [
      { "name": "Blackcurrant Allergy", "severity": "Rare", "details": "Allergies are uncommon." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Temperate, requires winter chill. Tolerates cooler summers.\n2. Soil: Well-drained, fertile soil rich in organic matter. Slightly acidic to neutral pH.\n3. Propagation: Hardwood cuttings are most common.\n4. Planting: Plant in early spring or autumn in full sun or partial shade.\n5. Watering: Regular watering, especially during dry periods and fruit development.\n6. Fertilizing: Apply balanced fertilizer or well-rotted manure in spring.\n7. Pruning: Prune in late winter, removing old, unproductive wood to encourage new growth, as fruit is borne on young wood.\n8. Harvesting: Berries are harvested in clusters (strigs) when they are fully black, plump, and slightly soft. They ripen in mid to late summer.",
    "growthDuration": "Bushes can start fruiting 1-2 years after planting. Productive for 10-15 years.",
    "sustainabilityTips": [
      "Blackcurrants are often used for jams, jellies, syrups (like Ribena), and liqueurs (Crème de Cassis).",
      "They freeze very well.",
      "Consume fresh quickly as they are somewhat perishable."
    ],
    "carbonFootprintInfo": "Moderate, higher if imported (0.7-1.5 kg CO2e/kg).",
    "staticRecipes": [
      {
        "name": "Blackcurrant Jam",
        "description": "A classic, intensely flavored jam with a beautiful deep purple color.",
        "ingredients": ["2 lbs fresh blackcurrants, stemmed", "2 lbs granulated sugar", "1/2 cup water", "Juice of 1 lemon (optional, for pectin boost)"],
        "steps": ["Combine blackcurrants, water, and lemon juice (if using) in a large, heavy-bottomed pot.", "Bring to a simmer and cook gently for 15-20 minutes, or until the blackcurrants are soft and have released their juice.", "Add sugar to the pot. Stir over low heat until the sugar is completely dissolved.", "Increase heat to high and bring the mixture to a rolling boil (a boil that continues even when stirred).", "Boil rapidly for 10-15 minutes, or until the jam reaches setting point (220°F/105°C on a jam thermometer, or when a small amount dropped onto a chilled plate wrinkles when pushed).", "Skim off any foam from the surface.", "Ladle hot jam into sterilized jars, leaving 1/4-inch headspace. Seal and process in a boiling water bath for 10 minutes for longer storage, or store in the refrigerator."]
      },
      {
        "name": "Blackcurrant Cordial (Syrup)",
        "description": "A concentrated syrup that can be diluted with water or sparkling water for a refreshing drink.",
        "ingredients": ["2 lbs fresh blackcurrants, stemmed", "2 cups water", "2 cups granulated sugar (or to taste)"],
        "steps": ["Place blackcurrants and water in a large saucepan. Bring to a boil, then reduce heat and simmer for 20-30 minutes, or until the berries are very soft and have burst.", "Strain the mixture through a jelly bag or several layers of cheesecloth set over a bowl. Allow to drip overnight without squeezing for a clear cordial (or gently squeeze for more yield but a cloudier result).", "Measure the extracted juice. For every 2 cups of juice, add 1 1/2 to 2 cups of sugar (adjust to sweetness preference).", "Combine the juice and sugar in a clean saucepan. Heat gently, stirring, until the sugar is completely dissolved. Do not boil.", "Once sugar is dissolved, pour the hot cordial into sterilized bottles and seal. Store in a cool, dark place or refrigerate after opening."]
      },
      {
        "name": "Blackcurrant Fool",
        "description": "A simple English dessert made by folding stewed blackcurrants into whipped cream.",
        "ingredients": ["1 pint (about 2 cups) fresh blackcurrants, stemmed", "1/4 cup granulated sugar (or to taste)", "2 tbsp water", "1 cup heavy whipping cream", "1-2 tbsp powdered sugar (optional, for cream)"],
        "steps": ["Make a blackcurrant compote: Combine blackcurrants, granulated sugar, and water in a saucepan. Bring to a simmer and cook for 5-10 minutes, until berries are soft and have released their juice. Mash lightly. Let cool completely.", "In a chilled bowl, whip the heavy cream until soft peaks form. If desired, sweeten with powdered sugar during whipping.", "Gently fold the cooled blackcurrant compote into the whipped cream, creating swirls. Do not overmix.", "Spoon into individual serving glasses or bowls.", "Chill for at least 30 minutes before serving."]
      }
    ]
  },
  {
    "id": "longan",
    "commonName": "Longan",
    "scientificName": "Dimocarpus longan",
    "image": "https://placehold.co/600x444.png",
    "description": "A tropical tree species that produces edible fruit. It is one of the better-known tropical members of the soapberry family (Sapindaceae), to which the lychee and rambutan also belong. The fruit is small, round, with a thin brownish shell, translucent white flesh, and a single black seed.",
    "origin": "Southern China, Southeast Asia (Myanmar, India)",
    "localNames": ["Dragon's Eye (literal translation of Chinese name)", "Mata Kucing (Malay/Indonesian - Cat's Eye)"],
    "regions": ["China", "Thailand", "Vietnam", "Taiwan", "India", "Australia", "United States (Florida, Hawaii)"],
    "seasons": ["Summer"],
    "nutrition": {
      "calories": "60 kcal per 100g",
      "macronutrients": [
        { "name": "Protein", "value": 1.3, "unit": "g" },
        { "name": "Carbohydrates", "value": 15.1, "unit": "g" },
        { "name": "Fat", "value": 0.1, "unit": "g" },
        { "name": "Fiber", "value": 1.1, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 84, "unit": "mg", "rdi": "140%" }
      ],
      "minerals": [
        { "name": "Potassium", "value": 266, "unit": "mg", "rdi": "8%" },
        { "name": "Copper", "value": 0.169, "unit": "mg", "rdi": "19%" }
      ]
    },
    "healthBenefits": [
      "Excellent source of Vitamin C, supporting immune function.",
      "Good source of potassium and copper.",
      "Traditionally used in Chinese medicine for its calming effects and to improve sleep.",
      "Contains antioxidants."
    ],
    "potentialAllergies": [
      { "name": "Longan Allergy", "severity": "Rare", "details": "Allergies are uncommon." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Tropical and subtropical. Prefers warm, humid conditions. Sensitive to frost.\n2. Soil: Well-drained, fertile loamy soil rich in organic matter. Slightly acidic pH.\n3. Propagation: Air layering (marcotting) is common for commercial cultivation. Can be grown from seed, but may take longer to fruit.\n4. Planting: Plant in full sun with good air circulation.\n5. Watering: Requires regular watering, especially during flowering and fruit development.\n6. Fertilizing: Apply balanced fertilizer regularly during the growing season.\n7. Pruning: Prune to shape the tree and improve light penetration.\n8. Harvesting: Fruits are harvested in bunches when the skin turns light brown and the fruit is plump. They do not ripen much after picking.",
    "growthDuration": "Air-layered trees can fruit in 2-4 years. Fruits mature in summer.",
    "sustainabilityTips": [
      "Store fresh longans in the refrigerator; they can last for a couple of weeks.",
      "Often eaten fresh by peeling the thin shell.",
      "Dried longans are a popular snack and ingredient in Asian desserts and teas."
    ],
    "carbonFootprintInfo": "Moderate, depending on transport (0.8-1.8 kg CO2e/kg).",
    "staticRecipes": [
      {
        "name": "Eating Fresh Longans",
        "description": "The most common way to enjoy the sweet, juicy flesh of longans.",
        "ingredients": ["A bunch of fresh longans"],
        "steps": ["Wash the longans.", "To open, gently squeeze the fruit near the stem end until the thin shell cracks, or use your fingernail to make a small break in the shell.", "Peel away the shell to reveal the translucent white flesh.", "Eat the flesh and discard the single, hard black seed in the center (it looks like an eye, hence 'dragon's eye').", "Longans are best enjoyed fresh and chilled."]
      },
      {
        "name": "Longan and Coconut Jelly",
        "description": "A refreshing and light Asian-style dessert.",
        "ingredients": ["1 cup fresh longan pulp, seeded (or canned longans, drained)", "1 can (13.5 oz) coconut milk", "1/2 cup sugar (or to taste)", "1 tbsp agar-agar powder", "1 cup water", "Optional: A few pandan leaves for fragrance"],
        "steps": ["If using fresh longans, peel and seed them. Roughly chop the flesh if desired.", "In a saucepan, combine agar-agar powder and water. Let it sit for 5-10 minutes to bloom.", "Add coconut milk, sugar, and pandan leaves (if using) to the saucepan. Heat over medium heat, stirring constantly, until the sugar and agar-agar are completely dissolved. Bring to a gentle simmer, but do not boil vigorously.", "Simmer for 2-3 minutes, stirring. Remove pandan leaves.", "Stir in the longan pulp.", "Pour the mixture into a jelly mold or individual ramekins.", "Let it cool to room temperature, then transfer to the refrigerator to set completely (at least 2-3 hours).", "To serve, unmold the jelly (if using a large mold) or serve directly from ramekins."]
      },
      {
        "name": "Dried Longan Tea (Longan Gui Yuan Cha)",
        "description": "A traditional Chinese herbal tea known for its warming and calming properties.",
        "ingredients": ["1/4 cup dried longan pulp (Gui Yuan Rou)", "2-3 dried red dates (jujubes), pitted and sliced (optional)", "1 small piece of ginger, sliced (optional)", "4 cups water", "Honey or rock sugar to taste (optional)"],
        "steps": ["Rinse the dried longan pulp and red dates (if using).", "In a small pot, combine dried longan, red dates, ginger (if using), and water.", "Bring to a boil, then reduce heat and simmer gently for 20-30 minutes. The longans will plump up, and the tea will become fragrant and slightly sweet.", "Strain the tea into cups.", "Sweeten with honey or rock sugar if desired. The rehydrated longans and dates can also be eaten.", "Serve warm."]
      }
    ]
  },
  {
    "id": "mangosteen",
    "commonName": "Mangosteen",
    "scientificName": "Garcinia mangostana",
    "image": "https://placehold.co/600x445.png",
    "description": "A tropical evergreen tree believed to have originated in the Sunda Islands and the Moluccas of Indonesia. It grows mainly in Southeast Asia, southwest India and other tropical areas such as Colombia, Puerto Rico and Florida. The fruit is sweet and tangy, juicy, somewhat fibrous, with fluid-filled vesicles (like citrus fruit), with an inedible, deep reddish-purple rind when ripe.",
    "origin": "Sunda Islands and Moluccas (Indonesia)",
    "localNames": ["Manggis (Malay/Indonesian)", "Mangkhut (Thai)", "Queen of Fruits"],
    "regions": ["Thailand", "Malaysia", "Indonesia", "Philippines", "India", "Sri Lanka", "Vietnam"],
    "seasons": ["Varies by region, typically a main season in summer/rainy season"],
    "nutrition": {
      "calories": "73 kcal per 100g",
      "macronutrients": [
        { "name": "Protein", "value": 0.4, "unit": "g" },
        { "name": "Carbohydrates", "value": 18, "unit": "g" },
        { "name": "Fat", "value": 0.6, "unit": "g" },
        { "name": "Fiber", "value": 1.8, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 2.9, "unit": "mg", "rdi": "5%" }
      ],
      "minerals": [
        { "name": "Manganese", "value": 0.102, "unit": "mg", "rdi": "5%" }
      ]
    },
    "healthBenefits": [
      "Rich in antioxidants, particularly xanthones found in the rind and fruit.",
      "May have anti-inflammatory, anti-cancer, and anti-aging properties.",
      "Supports immune function.",
      "Traditionally used for various medicinal purposes in Southeast Asia."
    ],
    "potentialAllergies": [
      { "name": "Mangosteen Allergy", "severity": "Rare", "details": "Allergies are very uncommon." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Strictly tropical, requires high humidity, warm temperatures (cannot tolerate below 40°F/4°C or above 100°F/38°C), and ample rainfall.\n2. Soil: Deep, rich, well-drained organic soil. Slightly acidic pH.\n3. Propagation: Very slow growing from seeds. Grafting is difficult. Usually propagated by seedlings.\n4. Planting: Plant in a location with partial shade when young, moving to more sun as it matures. Protect from strong winds.\n5. Watering: Requires consistent moisture and high humidity. Cannot tolerate drought.\n6. Fertilizing: Regular application of organic matter and balanced fertilizer.\n7. Harvesting: Fruits are harvested when the rind turns deep purple and yields slightly to pressure. They are picked by hand. The number of lobes at the bottom of the fruit corresponds to the number of fleshy segments inside.",
    "growthDuration": "Very slow-growing trees, may take 7-10 years or more to bear first fruit from seed. Fruits mature 5-6 months after flowering.",
    "sustainabilityTips": [
      "Mangosteens are highly perishable once ripe. Store at room temperature if consuming soon, or refrigerate for a few days.",
      "The rind is inedible but is studied for its medicinal compounds.",
      "Enjoy the delicate, sweet-tart segments fresh."
    ],
    "carbonFootprintInfo": "High, due to strict tropical growing conditions and often requiring air freight (can be 2.0-5.0 kg CO2e/kg or higher).",
    "staticRecipes": [
      {
        "name": "Eating Fresh Mangosteen",
        "description": "The best way to enjoy the unique flavor of the 'Queen of Fruits'.",
        "ingredients": ["1-2 ripe mangosteens"],
        "steps": ["Select a mangosteen with a vibrant deep purple rind that yields slightly to pressure. The green cap and stem should look fresh.", "Wash the fruit.", "To open, gently make a shallow cut around the equator of the fruit with a small knife, being careful not to cut into the white flesh.", "Alternatively, hold the fruit firmly and twist the top and bottom halves in opposite directions until the rind cracks open.", "Carefully remove the top half of the rind. The white, juicy, segmented flesh will be revealed.", "Use a small fork or your fingers to scoop out the fleshy segments. Usually, one or two larger segments contain a seed, while smaller ones are seedless. The seeds are not eaten.", "Enjoy the sweet, tangy, and aromatic flesh immediately."]
      },
      {
        "name": "Mangosteen and Lychee Salad",
        "description": "A delightful tropical fruit salad combining two exquisite flavors.",
        "ingredients": ["1 cup fresh mangosteen segments (from about 4-5 fruits)", "1 cup fresh lychees, peeled and seeded", "1 tbsp lime juice", "1 tsp honey or agave nectar (optional)", "A few fresh mint leaves, finely chopped"],
        "steps": ["Carefully prepare the mangosteen segments and lychees.", "In a bowl, gently combine the mangosteen segments and lychees.", "In a small separate bowl, whisk together lime juice and honey/agave (if using).", "Drizzle the dressing over the fruits.", "Sprinkle with finely chopped mint leaves.", "Toss very gently and serve chilled."]
      },
      {
        "name": "Mangosteen Sorbet",
        "description": "A refreshing and exotic sorbet highlighting the unique taste of mangosteen.",
        "ingredients": ["2 cups fresh mangosteen pulp (segments, seeds removed from larger ones)", "1/2 cup sugar", "1/2 cup water", "Juice of 1 lime"],
        "steps": ["Make a simple syrup: In a small saucepan, combine sugar and water. Heat over medium heat, stirring, until the sugar is completely dissolved. Let it cool completely.", "If the mangosteen segments are large and have seeds, carefully remove any seeds.", "Combine the mangosteen pulp, cooled simple syrup, and lime juice in a blender or food processor.", "Blend until very smooth.", "Pour the mixture into an ice cream maker and churn according to the manufacturer's instructions.", "If you don't have an ice cream maker, pour the mixture into a freezer-safe container. Freeze for 1-2 hours until partially frozen. Remove from freezer, beat with a hand mixer or whisk vigorously to break up ice crystals, then return to freezer. Repeat this process 2-3 times every hour until the sorbet is firm but scoopable.", "Serve immediately or store in an airtight container in the freezer."]
      }
    ]
  },
  {
    "id": "rambutan",
    "commonName": "Rambutan",
    "scientificName": "Nephelium lappaceum",
    "image": "https://placehold.co/600x446.png",
    "description": "A medium-sized tropical tree in the family Sapindaceae. The name also refers to the edible fruit produced by this tree. The rambutan is native to Southeast Asia. It is closely related to other edible tropical fruits including the lychee, longan, and pulasan. The fruit has a leathery red skin covered with fleshy pliable spines, hence the name, which means 'hairs'.",
    "origin": "Southeast Asia (Malaysia, Indonesia)",
    "localNames": ["Chom Chom (Vietnamese)", "Ngo (Thai)"],
    "regions": ["Thailand", "Malaysia", "Indonesia", "Vietnam", "Philippines", "Sri Lanka"],
    "seasons": ["Mainly June to August, with a smaller season December to February"],
    "nutrition": {
      "calories": "82 kcal per 100g",
      "macronutrients": [
        { "name": "Protein", "value": 0.7, "unit": "g" },
        { "name": "Carbohydrates", "value": 20.9, "unit": "g" },
        { "name": "Fat", "value": 0.2, "unit": "g" },
        { "name": "Fiber", "value": 0.9, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 4.9, "unit": "mg", "rdi": "8%" }
      ],
      "minerals": [
        { "name": "Manganese", "value": 0.343, "unit": "mg", "rdi": "17%" },
        { "name": "Copper", "value": 0.066, "unit": "mg", "rdi": "7%" }
      ]
    },
    "healthBenefits": [
      "Good source of Vitamin C, which aids in immune function.",
      "Contains copper and manganese, important for bone health and metabolism.",
      "Provides dietary fiber, aiding digestion.",
      "Rich in antioxidants that help fight free radicals."
    ],
    "potentialAllergies": [
      { "name": "Rambutan Allergy", "severity": "Rare", "details": "Allergies are uncommon." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Tropical, requires high humidity and warm temperatures, cannot tolerate frost.\n2. Soil: Deep, well-drained loamy soil rich in organic matter. Slightly acidic to neutral pH.\n3. Propagation: Seeds (though fruit quality may vary) or more commonly by budding or grafting for commercial varieties.\n4. Planting: Plant in full sun to partial shade with protection from strong winds.\n5. Watering: Requires consistent moisture, especially during fruit development.\n6. Fertilizing: Regular application of balanced fertilizer.\n7. Harvesting: Fruits are harvested in clusters when they turn bright red or yellow (depending on variety) and the spines are well-developed. They are picked by hand.",
    "growthDuration": "Trees may start bearing fruit in 3-5 years. Fruits mature about 100-120 days after flowering.",
    "sustainabilityTips": [
      "Store fresh rambutans at room temperature for a day or two, or in the refrigerator for up to a week.",
      "The leathery skin is not edible; compost it.",
      "The single seed is also typically not eaten, though some varieties have edible seeds when cooked."
    ],
    "carbonFootprintInfo": "Moderate to high if air-freighted from tropical regions (0.9-2.2 kg CO2e/kg).",
    "staticRecipes": [
      {
        "name": "Eating Fresh Rambutan",
        "description": "The best way to enjoy the sweet, grape-like flesh of rambutan.",
        "ingredients": ["A bunch of fresh rambutans"],
        "steps": ["Wash the rambutans.", "To open, make a shallow cut around the middle of the fruit with a knife, or use your thumbs to pry the skin open if it's soft enough.", "Peel away one half of the leathery skin. The translucent white flesh will be exposed.", "Pop the fleshy fruit into your mouth and eat around the seed. The seed is usually not eaten, although some varieties have edible seeds when cooked.", "Discard the skin and seed."]
      },
      {
        "name": "Rambutan and Lychee Salad",
        "description": "A refreshing tropical fruit salad with similar textures and flavors.",
        "ingredients": ["1 cup fresh rambutan flesh (peeled and seeded)", "1 cup fresh lychees (peeled and seeded)", "1 tbsp lime juice", "1 tsp honey (optional)", "A few mint leaves, chiffonade"],
        "steps": ["Gently combine the rambutan flesh and lychee flesh in a bowl.", "Drizzle with lime juice and honey (if using).", "Sprinkle with mint chiffonade.", "Toss gently and serve chilled."]
      },
      {
        "name": "Rambutan Infused Water",
        "description": "A subtly sweet and refreshing infused water.",
        "ingredients": ["5-6 rambutans, peeled (flesh can be slightly broken)", "1 liter cold water", "Optional: a slice of lime or a few mint sprigs"],
        "steps": ["Peel the rambutans. You can leave the flesh whole or gently break it to release more flavor.", "Add the rambutan flesh to a pitcher with cold water.", "Add lime slices or mint sprigs if desired.", "Refrigerate for at least 2-4 hours to allow the flavors to infuse.", "Serve chilled."]
      }
    ]
  },
  {
    "id": "gooseberry",
    "commonName": "Gooseberry",
    "scientificName": "Ribes uva-crispa",
    "image": "https://placehold.co/600x447.png",
    "description": "A species of Ribes, native to Europe, northwestern Africa and southwestern Asia. It is one of several similar species in the subgenus Grossularia. The fruit is a berry, varying from green to red or purple, and can be tart or sweet depending on ripeness and variety.",
    "origin": "Europe, Northwestern Africa, Southwestern Asia",
    "localNames": ["Groseille à maquereau (French)", "Stachelbeere (German)", "Uva espina (Spanish)"],
    "regions": ["United Kingdom", "Germany", "Poland", "Scandinavia", "North America"],
    "seasons": ["Early to Mid Summer"],
    "nutrition": {
      "calories": "44 kcal per 100g",
      "macronutrients": [
        { "name": "Protein", "value": 0.9, "unit": "g" },
        { "name": "Carbohydrates", "value": 10.2, "unit": "g" },
        { "name": "Fat", "value": 0.6, "unit": "g" },
        { "name": "Fiber", "value": 4.3, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 27.7, "unit": "mg", "rdi": "46%" },
        { "name": "Vitamin A", "value": 15, "unit": "µg RAE", "rdi": "2%" }
      ],
      "minerals": [
        { "name": "Manganese", "value": 0.144, "unit": "mg", "rdi": "7%" }
      ]
    },
    "healthBenefits": [
      "Good source of Vitamin C, an antioxidant supporting the immune system.",
      "High in dietary fiber, aiding digestion and promoting gut health.",
      "Contains various phytonutrients with antioxidant properties.",
      "Low in calories."
    ],
    "potentialAllergies": [
      { "name": "Gooseberry Allergy", "severity": "Rare", "details": "Allergies are uncommon." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Temperate, thrives in cool, moist conditions. Tolerates some shade.\n2. Soil: Well-drained, fertile loamy soil rich in organic matter. Slightly acidic to neutral pH.\n3. Propagation: Usually by hardwood cuttings.\n4. Planting: Plant bare-root bushes in late autumn to early spring.\n5. Watering: Requires consistent moisture, especially during fruit development.\n6. Fertilizing: Apply well-rotted manure or balanced fertilizer in spring.\n7. Pruning: Prune in winter to maintain an open, goblet shape, removing old and crossing branches to encourage new fruiting wood.\n8. Harvesting: Berries can be picked slightly underripe (green) for cooking/tartness or when fully ripe (softer, sweeter, and colored according to variety) for eating fresh. Handle thorny varieties with care.",
    "growthDuration": "Bushes can start fruiting in 1-3 years. Harvest in early to mid-summer.",
    "sustainabilityTips": [
      "Gooseberries are versatile: use for pies, crumbles, fools, jams, or eat fresh when ripe.",
      "They freeze well.",
      "Choose local varieties when in season."
    ],
    "carbonFootprintInfo": "Low to moderate, depending on local availability (0.4-0.8 kg CO2e/kg).",
    "staticRecipes": [
      {
        "name": "Gooseberry Fool",
        "description": "A classic British dessert, creamy and tart-sweet.",
        "ingredients": ["1 lb fresh gooseberries, topped and tailed", "1/4 cup granulated sugar (or to taste)", "2 tbsp water", "1 cup heavy whipping cream", "2 tbsp elderflower cordial (optional)"],
        "steps": ["Combine gooseberries, sugar, and water in a saucepan. Cook over medium-low heat for 10-15 minutes, or until gooseberries are soft and have burst. Mash lightly.", "Let the gooseberry compote cool completely.", "In a chilled bowl, whip the heavy cream until soft peaks form. If using, fold in elderflower cordial.", "Gently fold the cooled gooseberry compote into the whipped cream, creating swirls. Do not overmix.", "Spoon into individual serving glasses and chill for at least 30 minutes before serving."]
      },
      {
        "name": "Gooseberry Crumble",
        "description": "A comforting dessert with tart gooseberries and a sweet, crunchy topping.",
        "ingredients": ["For filling: 1.5 lbs gooseberries, topped and tailed", "1/2 cup granulated sugar", "1 tbsp cornstarch (optional, for thickening)", "For crumble: 1 cup all-purpose flour", "1/2 cup rolled oats", "1/2 cup brown sugar", "1/2 cup cold butter, cubed"],
        "steps": ["Preheat oven to 375°F (190°C).", "Filling: In a bowl, toss gooseberries with sugar and cornstarch (if using). Transfer to an ovenproof dish.", "Crumble: In another bowl, combine flour, oats, and brown sugar. Rub in the cold butter with your fingertips until the mixture resembles coarse breadcrumbs.", "Sprinkle the crumble topping evenly over the gooseberries.", "Bake for 30-40 minutes, or until the topping is golden brown and the fruit is bubbling.", "Serve warm with custard, cream, or ice cream."]
      },
      {
        "name": "Gooseberry Jam",
        "description": "A tart and flavorful jam, excellent on toast or with scones.",
        "ingredients": ["2 lbs gooseberries, topped and tailed", "2 lbs granulated sugar", "1/2 cup water"],
        "steps": ["Combine gooseberries and water in a large, heavy-bottomed pot. Bring to a simmer and cook gently for 15-20 minutes, until the gooseberries are soft.", "Add the sugar to the pot. Stir over low heat until the sugar is completely dissolved.", "Increase heat and bring to a rolling boil. Boil rapidly for about 10-15 minutes, or until setting point is reached (test by dropping a little jam onto a cold saucer; if it wrinkles when pushed, it's ready).", "Skim off any scum from the surface.", "Ladle the hot jam into sterilized jars, seal, and label. Store in a cool, dark place."]
      }
    ]
  },
  {
    "id": "karonda",
    "commonName": "Karonda (Natal Plum)",
    "scientificName": "Carissa carandas",
    "image": "https://placehold.co/600x448.png",
    "description": "A species of flowering shrub in the dogbane family, Apocynaceae. It produces berry-sized fruits that are commonly used as a condiment in Indian pickles and spices. The fruit is a rich source of iron, so it sometimes is used in treatment of anaemia. It contains a fair amount of Vitamin C and is a rich source of pectin.",
    "origin": "India, Nepal, Afghanistan, Himalayas",
    "localNames": ["Kalakai (Tamil)", "Vakkaya (Telugu)", "Christ's Thorn"],
    "regions": ["India", "Pakistan", "Sri Lanka", "Malaysia", "Indonesia"],
    "seasons": ["Rainy season (July-September in India)"],
    "nutrition": {
      "calories": "70 kcal per 100g (estimated)",
      "macronutrients": [
        { "name": "Protein", "value": 0.5, "unit": "g" },
        { "name": "Carbohydrates", "value": 16.5, "unit": "g" },
        { "name": "Fat", "value": 0.2, "unit": "g" },
        { "name": "Fiber", "value": 1.5, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 9, "unit": "mg", "rdi": "15%" }
      ],
      "minerals": [
        { "name": "Iron", "value": 1.3, "unit": "mg", "rdi": "7%" },
        { "name": "Calcium", "value": 21, "unit": "mg", "rdi": "2%" }
      ]
    },
    "healthBenefits": [
      "Rich in iron, traditionally used to combat anemia.",
      "Good source of Vitamin C, supporting immune function.",
      "Contains pectin, which aids in digestion and can help make jellies.",
      "Antioxidant properties."
    ],
    "potentialAllergies": [
      { "name": "Karonda Allergy", "severity": "Rare", "details": "Allergies are very uncommon." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Tropical and subtropical. Drought-tolerant and hardy plant.\n2. Soil: Grows well in a wide range of soils, including poor soils. Prefers well-drained soil.\n3. Propagation: Seeds or cuttings.\n4. Planting: Plant in full sun. Can be grown as a hedge due to its thorny nature.\n5. Watering: Water regularly until established. Mature plants are very drought-resistant.\n6. Fertilizing: Generally does not require much fertilization.\n7. Harvesting: Fruits are harvested when they turn from green to reddish-purple or dark purple/black and are slightly soft. Unripe green fruits are also used for pickles.",
    "growthDuration": "Starts fruiting in 2-3 years. Fruits ripen during the rainy season.",
    "sustainabilityTips": [
      "Karonda is commonly used for pickles, chutneys, jams, and jellies due to its tartness.",
      "Can be eaten fresh when fully ripe, though it's often quite tart.",
      "The plant is thorny and can be used as a natural fence."
    ],
    "carbonFootprintInfo": "Low, as it's a hardy plant often grown locally (0.2-0.5 kg CO2e/kg).",
    "staticRecipes": [
      {
        "name": "Karonda Pickle (Achar)",
        "description": "A tangy and spicy Indian pickle made from Karonda fruits.",
        "ingredients": ["1 lb Karonda, washed, halved, and deseeded (optional)", "1/4 cup mustard oil", "2 tbsp fennel seeds (saunf)", "1 tbsp mustard seeds (rai)", "1 tsp fenugreek seeds (methi dana)", "1/2 tsp asafoetida (hing)", "1 tbsp turmeric powder", "2 tbsp red chili powder (or to taste)", "Salt to taste"],
        "steps": ["If Karondas are very tart, you can blanch them in hot water for 2 minutes and drain to reduce tartness. Pat dry completely.", "Dry roast fennel seeds, mustard seeds, and fenugreek seeds. Coarsely grind them.", "Heat mustard oil in a pan until it smokes lightly, then let it cool completely.", "In a large mixing bowl, combine Karonda, ground spice mixture, turmeric powder, red chili powder, asafoetida, and salt.", "Pour the cooled mustard oil over the mixture and mix well.", "Transfer the pickle to a sterilized, dry glass jar. Cover and keep in the sun for 4-5 days, shaking the jar daily.", "The pickle is ready to eat once Karondas soften and absorb flavors. Store in a cool, dry place."]
      },
      {
        "name": "Sweet Karonda Chutney",
        "description": "A sweet and tangy chutney, great as a condiment.",
        "ingredients": ["1 cup Karonda, halved and deseeded (optional)", "1/2 cup sugar or jaggery", "1/4 cup water", "1/2 inch ginger, grated", "1/4 tsp red chili powder (optional)", "Pinch of salt"],
        "steps": ["Combine Karonda, sugar/jaggery, water, and grated ginger in a saucepan.", "Cook over medium heat, stirring, until Karondas soften and the mixture thickens to a chutney consistency (about 15-20 minutes).", "Stir in red chili powder (if using) and salt.", "Let it cool completely. Store in an airtight container in the refrigerator."]
      },
      {
        "name": "Karonda Sabzi (Stir-fry)",
        "description": "A simple stir-fried dish using green or semi-ripe Karondas.",
        "ingredients": ["1 cup Karonda, washed and slit (or halved)", "1 tbsp oil", "1/2 tsp mustard seeds", "1/2 tsp cumin seeds", "Pinch of asafoetida (hing)", "1-2 green chilies, slit", "1/4 tsp turmeric powder", "Salt to taste", "1 tbsp chopped cilantro for garnish"],
        "steps": ["Heat oil in a pan. Add mustard seeds and cumin seeds. When they splutter, add asafoetida and green chilies. Sauté for a few seconds.", "Add Karonda and turmeric powder. Mix well.", "Cover and cook on low heat for 5-7 minutes, or until Karondas are tender but not mushy. Stir occasionally.", "Add salt and mix.", "Garnish with chopped cilantro and serve hot with roti or rice."]
      }
    ]
  },
  {
    "id": "noni-fruit",
    "commonName": "Noni Fruit",
    "scientificName": "Morinda citrifolia",
    "image": "https://placehold.co/600x449.png",
    "description": "A fruit-bearing tree in the coffee family, Rubiaceae. It is native to Southeast Asia and Australasia, and is cultivated throughout the tropics. The fruit has a strong, pungent odor when ripening, sometimes described as cheesy or vomit-like, and a bitter taste. It is often consumed for its purported health benefits.",
    "origin": "Southeast Asia, Australasia",
    "localNames": ["Indian Mulberry", "Cheese Fruit", "Vomit Fruit", "Bartundi (Hindi)"],
    "regions": ["Polynesia (Hawaii, Tahiti)", "Southeast Asia", "Australia", "India", "Caribbean"],
    "seasons": ["Fruits year-round in tropical climates"],
    "nutrition": {
      "calories": "15 kcal per 100g (juice, estimated)",
      "macronutrients": [
        { "name": "Protein", "value": 0.4, "unit": "g" },
        { "name": "Carbohydrates", "value": 3.4, "unit": "g" },
        { "name": "Fat", "value": 0.1, "unit": "g" },
        { "name": "Fiber", "value": 0.2, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 30, "unit": "mg", "rdi": "50%" }
      ],
      "minerals": [
        { "name": "Potassium", "value": 150, "unit": "mg", "rdi": "4%" }
      ]
    },
    "healthBenefits": [
      "Traditionally used for a wide range of ailments, including pain relief, immune support, and anti-inflammatory effects.",
      "Rich in antioxidants.",
      "Some studies suggest potential benefits for joint health and skin conditions.",
      "Noni juice is a popular health supplement."
    ],
    "potentialAllergies": [
      { "name": "Noni Sensitivity", "severity": "Mild", "details": "Some individuals may experience digestive upset. High potassium content may be a concern for those with kidney disease. Consult a doctor before using as a supplement." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Tropical, thrives in hot, humid conditions. Tolerant of saline soils and drought once established.\n2. Soil: Adaptable to a wide range of soils, but prefers well-drained soil.\n3. Propagation: Seeds or cuttings.\n4. Planting: Plant in full sun to partial shade.\n5. Watering: Water regularly until established.\n6. Harvesting: Fruits are harvested when they are firm and have turned from green to light yellow or whitish. They continue to ripen and soften (and develop strong odor) after picking.",
    "growthDuration": "Trees can start fruiting within a year or two from planting. Fruits year-round.",
    "sustainabilityTips": [
      "Noni is primarily consumed as juice or in powdered form due to its strong taste and odor.",
      "The fruit is often fermented to make juice.",
      "Leaves and roots also have traditional medicinal uses."
    ],
    "carbonFootprintInfo": "Varies greatly depending on processing and transport, especially for juice products.",
    "staticRecipes": [
      {
        "name": "Traditional Noni Juice (Fermented)",
        "description": "A common way Noni fruit is processed for consumption, often for health benefits.",
        "ingredients": ["Ripe Noni fruits"],
        "steps": ["Wash ripe Noni fruits thoroughly. They should be light yellow or whitish and slightly soft.", "Place the whole fruits in a clean, airtight glass jar.", "Seal the jar and leave it in a sunny place for several weeks to a couple of months (e.g., 6-8 weeks). The fruits will ferment and release their juice.", "After the fermentation period, strain the collected juice through a cheesecloth or fine sieve into another clean bottle.", "Store the Noni juice in the refrigerator. It's typically consumed in small amounts (e.g., 1-2 tablespoons daily) due to its strong flavor and potency."]
      },
      {
        "name": "Noni Fruit Leather",
        "description": "A way to preserve Noni and make its flavor more palatable.",
        "ingredients": ["Ripe Noni fruit pulp (seeds removed)", "Optional: sweetener like honey or other fruit purees (e.g., apple, pineapple) to taste"],
        "steps": ["Wash and process ripe Noni fruits to get the pulp. Remove as many seeds as possible.", "Blend the Noni pulp until smooth. If desired, mix with a sweetener or other fruit purees to improve flavor.", "Spread the Noni puree thinly and evenly on a dehydrator sheet lined with parchment paper or a non-stick mat.", "Dehydrate at a low temperature (around 135°F or 57°C) for 6-12 hours, or until the leather is dry to the touch but still pliable (not brittle).", "Once dried, peel the Noni leather off the sheet. Cut into strips or roll it up with parchment paper in between layers.", "Store in an airtight container at room temperature or in the refrigerator."]
      },
      {
        "name": "Noni Leaf Tea",
        "description": "Noni leaves are also used traditionally to make a tea.",
        "ingredients": ["A few fresh or dried Noni leaves", "Hot water", "Optional: honey or lemon to taste"],
        "steps": ["If using fresh Noni leaves, wash them thoroughly.", "Place 1-2 Noni leaves (fresh or dried) in a cup.", "Pour hot (not boiling) water over the leaves.", "Let it steep for 5-10 minutes.", "Strain the tea. Add honey or lemon to taste if desired.", "Consume in moderation. (Note: Always consult with a healthcare professional before using herbal remedies)."]
      }
    ]
  },
  {
    "id": "loquat",
    "commonName": "Loquat",
    "scientificName": "Eriobotrya japonica",
    "image": "https://placehold.co/600x450.png",
    "description": "A species of flowering plant in the family Rosaceae, a native to the cooler hill regions of south-central China. It is a large evergreen shrub or small tree, grown commercially for its yellow or orange fruit, and also cultivated as an ornamental plant.",
    "origin": "South-central China",
    "localNames": ["Níspero japonés (Spanish)", "Nèfle du Japon (French)", "Japanische Wollmispel (German)", "Lokat (Hindi)"],
    "regions": ["China", "Japan", "India", "Pakistan", "Mediterranean countries", "California"],
    "seasons": ["Late Spring to Early Summer"],
    "nutrition": {
      "calories": "47 kcal per 100g",
      "macronutrients": [
        { "name": "Protein", "value": 0.4, "unit": "g" },
        { "name": "Carbohydrates", "value": 12.1, "unit": "g" },
        { "name": "Fat", "value": 0.2, "unit": "g" },
        { "name": "Fiber", "value": 1.7, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin A", "value": 76, "unit": "µg RAE", "rdi": "8%" }
      ],
      "minerals": [
        { "name": "Potassium", "value": 266, "unit": "mg", "rdi": "8%" },
        { "name": "Manganese", "value": 0.148, "unit": "mg", "rdi": "7%" }
      ]
    },
    "healthBenefits": [
      "Good source of Vitamin A, important for vision and immune function.",
      "Contains dietary fiber, aiding digestion.",
      "Provides antioxidants like carotenoids.",
      "Traditionally used in Chinese medicine for coughs and respiratory ailments (especially the leaves)."
    ],
    "potentialAllergies": [
      { "name": "Loquat Seed Caution", "severity": "Mild", "details": "Loquat seeds contain small amounts of cyanogenic glycosides. While accidental ingestion of a few seeds is unlikely to cause harm, they should generally not be consumed in quantity." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Subtropical to mild temperate. Tolerates light frosts once established.\n2. Soil: Well-drained, fertile loamy soil. Adaptable to various soil types.\n3. Propagation: Seeds (germinate easily but may not be true to type) or grafting for superior varieties.\n4. Planting: Plant in full sun to partial shade. Protect from strong winds.\n5. Watering: Water regularly, especially during dry periods and fruit development.\n6. Fertilizing: Apply balanced fertilizer in spring.\n7. Harvesting: Fruits are harvested when they are fully colored (yellow to orange) and slightly soft to the touch. They bruise easily.",
    "growthDuration": "Seedling trees may fruit in 2-3 years. Fruits ripen in late spring to early summer.",
    "sustainabilityTips": [
      "Loquats are best eaten fresh. Peel the skin if desired (it's edible but can be slightly tough).",
      "The fruit is also used for jams, jellies, and pies.",
      "Handle gently as they bruise easily."
    ],
    "carbonFootprintInfo": "Low to moderate, especially if grown locally (0.3-0.7 kg CO2e/kg).",
    "staticRecipes": [
      {
        "name": "Fresh Loquats",
        "description": "Enjoying the sweet and tangy flavor of fresh loquats.",
        "ingredients": ["A handful of ripe loquats"],
        "steps": ["Wash the loquats gently.", "The skin is edible but can be peeled if preferred. To peel, make a small slit and peel it away.", "Cut the loquat in half and remove the large, dark seeds from the center.", "Eat the fleshy part. The flavor is often a mix of peach, citrus, and mild mango."]
      },
      {
        "name": "Loquat Jam",
        "description": "A sweet and slightly tart jam, perfect for preserving the fruit.",
        "ingredients": ["2 lbs ripe loquats, peeled, pitted, and roughly chopped", "2 cups granulated sugar", "Juice of 1 lemon", "1/4 cup water"],
        "steps": ["Combine chopped loquats, sugar, lemon juice, and water in a large, heavy-bottomed pot.", "Bring the mixture to a boil over medium-high heat, stirring until sugar dissolves.", "Reduce heat to medium-low and simmer, stirring occasionally, for 30-45 minutes, or until the jam thickens and reaches the setting point (220°F/105°C on a jam thermometer, or when a small amount on a chilled plate wrinkles when pushed).", "Skim off any foam.", "Ladle hot jam into sterilized jars, leaving 1/4-inch headspace. Seal and process in a boiling water bath for 10 minutes for longer storage, or store in the refrigerator."]
      },
      {
        "name": "Loquat Crumble",
        "description": "A warm dessert with a sweet loquat filling and a crunchy topping.",
        "ingredients": ["For filling: 4 cups loquats, peeled, pitted, and halved", "1/4 cup sugar", "1 tbsp all-purpose flour", "1 tsp lemon juice", "For crumble: 3/4 cup all-purpose flour", "1/2 cup rolled oats", "1/2 cup brown sugar", "1/4 cup cold butter, cubed"],
        "steps": ["Preheat oven to 375°F (190°C).", "Filling: In a bowl, gently toss loquats with sugar, flour, and lemon juice. Pour into a baking dish.", "Crumble: In another bowl, combine flour, oats, and brown sugar. Cut in butter with your fingertips or a pastry blender until the mixture resembles coarse crumbs.", "Sprinkle the crumble topping evenly over the loquats.", "Bake for 25-35 minutes, or until the topping is golden brown and the filling is bubbly.", "Serve warm, perhaps with vanilla ice cream or custard."]
      }
    ]
  },
  {
    "id": "rose-apple",
    "commonName": "Rose Apple",
    "scientificName": "Syzygium jambos",
    "image": "https://placehold.co/600x451.png",
    "description": "A tree originating in Southeast Asia and occurring widely elsewhere, having been introduced as an ornamental and fruit tree. The fruit is bell-shaped, whitish-green to pale yellow or pink, crisp, and has a unique rose-like aroma and slightly sweet, watery taste.",
    "origin": "Southeast Asia (Malaysia, Indonesia)",
    "localNames": ["Jambu Air Mawar (Malay/Indonesian)", "Chomphu Namdokmai (Thai)", "Water Apple", "Wax Apple (related species often grouped)"],
    "regions": ["Southeast Asia", "India", "Caribbean", "Central and South America"],
    "seasons": ["Varies, can fruit multiple times a year, often in spring and fall"],
    "nutrition": {
      "calories": "25 kcal per 100g",
      "macronutrients": [
        { "name": "Protein", "value": 0.6, "unit": "g" },
        { "name": "Carbohydrates", "value": 5.7, "unit": "g" },
        { "name": "Fat", "value": 0.3, "unit": "g" },
        { "name": "Fiber", "value": 0.5, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 22.3, "unit": "mg", "rdi": "37%" }
      ],
      "minerals": [
        { "name": "Calcium", "value": 29, "unit": "mg", "rdi": "3%" }
      ]
    },
    "healthBenefits": [
      "High water content, making it hydrating and refreshing.",
      "Good source of Vitamin C.",
      "Low in calories.",
      "Traditionally used for various medicinal purposes in some cultures."
    ],
    "potentialAllergies": [
      { "name": "Rose Apple Allergy", "severity": "Rare", "details": "Allergies are uncommon." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Tropical and subtropical, thrives in warm, humid conditions.\n2. Soil: Prefers well-drained, fertile loamy soil. Tolerates a range of soils.\n3. Propagation: Seeds, cuttings, or air layering.\n4. Planting: Plant in full sun to partial shade.\n5. Watering: Requires regular watering, especially during dry periods and fruit development.\n6. Harvesting: Fruits are harvested when they are fully colored, crisp, and have a characteristic rose-like fragrance. They are delicate and bruise easily.",
    "growthDuration": "Trees can start fruiting in 3-5 years. Fruits mature quickly after flowering.",
    "sustainabilityTips": [
      "Rose apples are best eaten fresh to enjoy their crisp texture and unique aroma.",
      "They are highly perishable and should be consumed soon after harvesting.",
      "Can be used in salads or lightly stewed."
    ],
    "carbonFootprintInfo": "Moderate, depends on transport from tropical regions (0.7-1.5 kg CO2e/kg).",
    "staticRecipes": [
      {
        "name": "Fresh Rose Apples",
        "description": "The simplest way to enjoy their crisp texture and fragrant aroma.",
        "ingredients": ["A few ripe Rose Apples"],
        "steps": ["Wash the rose apples gently.", "They can be eaten whole, skin and all. The flesh is crisp and watery, with a hollow core that may contain a few small, loose seeds.", "Simply bite into them or slice them. They are very refreshing.", "Best served chilled."]
      },
      {
        "name": "Rose Apple Salad with Honey-Lime Dressing",
        "description": "A light and refreshing salad highlighting the unique fruit.",
        "ingredients": ["2 cups sliced Rose Apples", "1 small cucumber, thinly sliced", "A handful of fresh mint leaves", "For dressing: 2 tbsp lime juice, 1 tbsp honey, pinch of salt"],
        "steps": ["Gently combine sliced rose apples and cucumber in a salad bowl.", "In a small bowl, whisk together lime juice, honey, and salt.", "Pour the dressing over the rose apple and cucumber mixture.", "Garnish with fresh mint leaves. Toss gently and serve immediately."]
      },
      {
        "name": "Candied Rose Apples (Lightly Stewed)",
        "description": "A simple way to sweeten rose apples and use them as a dessert topping.",
        "ingredients": ["2 cups sliced Rose Apples", "1/4 cup sugar", "1/2 cup water", "1 star anise or a small piece of cinnamon stick (optional)"],
        "steps": ["Combine sliced rose apples, sugar, water, and star anise/cinnamon (if using) in a saucepan.", "Bring to a gentle simmer over medium-low heat.", "Cook for 5-10 minutes, or until the rose apples are slightly tender but still hold their shape, and the syrup has slightly thickened.", "Remove from heat and discard the spice.", "Let it cool. Serve warm or chilled over yogurt, ice cream, or pancakes."]
      }
    ]
  },
  {
    "id": "langsat",
    "commonName": "Langsat (Lanzones)",
    "scientificName": "Lansium domesticum",
    "image": "https://placehold.co/600x452.png",
    "description": "A species of tree in the Mahogany family. The plant, which originates from western Southeast Asia, bears edible fruit. The fruit is small, ovoid or round, with a thin, leathery yellowish or brownish skin. Inside, the fruit is divided into translucent, juicy segments, some of which may contain a bitter green seed.",
    "origin": "Western Southeast Asia (Malay Peninsula, Sumatra, Borneo)",
    "localNames": ["Lanzones (Philippines)", "Longkong/Duku (varieties in Thailand/Malaysia/Indonesia)"],
    "regions": ["Thailand", "Malaysia", "Indonesia", "Philippines", "Vietnam", "India"],
    "seasons": ["Varies by region, typically August to October"],
    "nutrition": {
      "calories": "60 kcal per 100g",
      "macronutrients": [
        { "name": "Protein", "value": 1, "unit": "g" },
        { "name": "Carbohydrates", "value": 14.2, "unit": "g" },
        { "name": "Fat", "value": 0.2, "unit": "g" },
        { "name": "Fiber", "value": 0.8, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 1, "unit": "mg", "rdi": "2%" },
        { "name": "Riboflavin (B2)", "value": 0.124, "unit": "mg", "rdi": "9%" }
      ],
      "minerals": [
        { "name": "Phosphorus", "value": 31, "unit": "mg", "rdi": "4%" }
      ]
    },
    "healthBenefits": [
      "Source of carbohydrates for energy.",
      "Contains some B vitamins.",
      "Provides dietary fiber.",
      "Traditional uses in Southeast Asian medicine for various ailments."
    ],
    "potentialAllergies": [
      { "name": "Langsat Allergy", "severity": "Rare", "details": "Allergies are uncommon." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Tropical, requires high humidity, warm temperatures, and ample rainfall.\n2. Soil: Prefers deep, fertile, well-drained loamy soil rich in organic matter.\n3. Propagation: Seeds (slow to fruit) or grafting/marcotting for superior varieties.\n4. Planting: Plant in partial shade when young, gradually exposing to more sun.\n5. Watering: Requires consistent moisture, especially during fruit development.\n6. Harvesting: Fruits are harvested in clusters when the skin turns yellowish-brown and they are slightly soft. They are picked by hand.",
    "growthDuration": "Seedling trees may take 10-15 years to fruit. Grafted trees much sooner (5-7 years).",
    "sustainabilityTips": [
      "Langsat is typically eaten fresh. The skin is peeled to reveal the juicy segments.",
      "Be careful of the bitter green seeds found in some segments; try not to bite into them.",
      "Store at room temperature and consume within a few days as they are perishable."
    ],
    "carbonFootprintInfo": "Moderate to high if transported from Southeast Asia (0.9-2.0 kg CO2e/kg).",
    "staticRecipes": [
      {
        "name": "Eating Fresh Langsat (Lanzones)",
        "description": "The primary way to enjoy this sweet and slightly tangy fruit.",
        "ingredients": ["A cluster of fresh Langsat/Lanzones"],
        "steps": ["Wash the langsat fruits.", "To open, gently pinch or twist the fruit near the stem end, or make a small slit with your fingernail. The leathery skin should break easily.", "Peel away the skin to reveal the translucent, juicy segments (similar to a small peeled garlic clove in appearance).", "Carefully separate the segments. Eat the fleshy segments, being mindful that some larger segments may contain a bitter green seed. Try to eat around the seed or spit it out if bitten.", "The flavor is sweet with a hint of tartness."]
      },
      {
        "name": "Langsat Syrup or Preserve",
        "description": "A way to preserve the fruit's flavor, though less common than eating fresh.",
        "ingredients": ["2 cups Langsat segments (seeds removed from segments that have them)", "1 cup sugar", "1/2 cup water", "Juice of 1/2 lime"],
        "steps": ["Carefully peel and remove seeds from the langsat segments. This can be tedious for some varieties.", "In a saucepan, combine langsat segments, sugar, water, and lime juice.", "Bring to a gentle simmer over medium-low heat. Cook for 15-20 minutes, stirring occasionally, until the fruits are tender and the syrup has slightly thickened.", "Let it cool. The syrup can be used over desserts or diluted to make a drink. The preserved fruits can be eaten as well.", "Store in a sterilized jar in the refrigerator."]
      },
      {
        "name": "Langsat in Fruit Salad",
        "description": "Adding a unique tropical flavor to a mixed fruit salad.",
        "ingredients": ["1 cup Langsat segments (seeds removed)", "1 cup mixed tropical fruits (e.g., pineapple, mango, papaya, rambutan)", "1 tbsp honey or a light syrup (optional)", "A few mint leaves for garnish"],
        "steps": ["Prepare all fruits: peel, seed, and chop as necessary.", "In a large bowl, gently combine the langsat segments with the other mixed tropical fruits.", "If desired, drizzle with a little honey or light syrup for added sweetness.", "Garnish with fresh mint leaves. Serve chilled."]
      }
    ]
  },
  {
    "id": "persimmon",
    "commonName": "Persimmon",
    "scientificName": "Diospyros kaki (most common)",
    "image": "https://placehold.co/600x453.png",
    "description": "An edible fruit of a number of species of trees in the genus Diospyros. The most widely cultivated of these is the Oriental persimmon, Diospyros kaki. Persimmons are typically orange or reddish-orange, and can be astringent (mouth-puckering until fully ripe and soft, like Hachiya) or non-astringent (can be eaten crisp like an apple, like Fuyu).",
    "origin": "China",
    "localNames": ["Caqui (Spanish/Portuguese)", "Kaki (French/German/Japanese)", "Amarphal (Hindi)"],
    "regions": ["China", "South Korea", "Japan", "Brazil", "Azerbaijan", "United States (California)", "Italy", "Spain"],
    "seasons": ["Autumn to Early Winter"],
    "nutrition": {
      "calories": "70 kcal per 100g (Japanese persimmon, raw)",
      "macronutrients": [
        { "name": "Protein", "value": 0.6, "unit": "g" },
        { "name": "Carbohydrates", "value": 18.6, "unit": "g" },
        { "name": "Fat", "value": 0.2, "unit": "g" },
        { "name": "Fiber", "value": 3.6, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin A", "value": 81, "unit": "µg RAE", "rdi": "9%" },
        { "name": "Vitamin C", "value": 7.5, "unit": "mg", "rdi": "13%" }
      ],
      "minerals": [
        { "name": "Manganese", "value": 0.355, "unit": "mg", "rdi": "18%" }
      ]
    },
    "healthBenefits": [
      "Good source of Vitamin A and Vitamin C.",
      "Rich in dietary fiber, aiding digestion.",
      "Contains antioxidants like carotenoids, flavonoids, and tannins.",
      "May help lower cholesterol and support heart health."
    ],
    "potentialAllergies": [
      { "name": "Astringency", "severity": "Mild", "details": "Astringent varieties (like Hachiya) are very unpleasant to eat before fully ripe due to high tannin content, causing a dry, puckering sensation. Non-astringent varieties (like Fuyu) do not have this issue." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Temperate to subtropical. Some varieties require winter chill.\n2. Soil: Well-drained, loamy soil. Adaptable but prefers pH 6.0-7.5.\n3. Propagation: Grafting is common for commercial varieties.\n4. Planting: Plant in full sun.\n5. Watering: Regular watering, especially for young trees and during fruit development.\n6. Harvesting: Harvest when fruits are fully colored. Astringent types must be allowed to soften completely (almost jelly-like) before eating. Non-astringent types can be eaten while firm or slightly soft.",
    "growthDuration": "Trees may start bearing fruit in 3-7 years. Fruits ripen in autumn and early winter.",
    "sustainabilityTips": [
      "Know your persimmon type: Fuyu (non-astringent) can be eaten firm like an apple. Hachiya (astringent) must be very soft before eating.",
      "Store at room temperature to ripen. Ripe persimmons can be refrigerated.",
      "Excellent for drying (Hoshigaki in Japan)."
    ],
    "carbonFootprintInfo": "Moderate, depending on origin and transport (0.5-1.0 kg CO2e/kg).",
    "staticRecipes": [
      {
        "name": "Eating Fresh Persimmons (Fuyu type)",
        "description": "Enjoying crisp, non-astringent Fuyu persimmons.",
        "ingredients": ["1-2 ripe Fuyu persimmons"],
        "steps": ["Wash the Fuyu persimmon. The skin is edible.", "You can eat it like an apple, biting directly into it, or slice it.", "Remove the core/calyx (leafy top) if desired.", "Slices can be added to salads, cheese boards, or eaten as a snack."]
      },
      {
        "name": "Persimmon and Pomegranate Salad",
        "description": "A vibrant autumn salad with sweet persimmons and tart pomegranate seeds.",
        "ingredients": ["2 ripe Fuyu persimmons, peeled (optional) and sliced or diced", "1/2 cup pomegranate arils", "2 cups mixed greens (e.g., arugula, spinach)", "1/4 cup toasted walnuts or pecans", "Optional: crumbled goat cheese", "Dressing: 2 tbsp olive oil, 1 tbsp apple cider vinegar, 1 tsp honey, salt and pepper to taste"],
        "steps": ["In a large bowl, combine mixed greens, persimmon slices/dices, pomegranate arils, and toasted nuts.", "Add goat cheese if using.", "In a small bowl, whisk together olive oil, apple cider vinegar, honey, salt, and pepper.", "Drizzle dressing over the salad and toss gently. Serve immediately."]
      },
      {
        "name": "Baked Persimmon (Hachiya type, when very ripe)",
        "description": "A simple way to enjoy the custardy sweetness of fully ripe astringent persimmons.",
        "ingredients": ["1-2 very ripe Hachiya persimmons (should feel like a water balloon)", "Optional: a sprinkle of cinnamon, a dollop of yogurt or cream"],
        "steps": ["Preheat oven to 350°F (175°C).", "Ensure Hachiya persimmons are extremely soft and ripe to avoid astringency.", "Cut the persimmons in half horizontally or remove the top calyx.", "Place cut-side up in a small baking dish.", "Bake for 15-20 minutes, or until heated through and slightly caramelized.", "Serve warm. You can scoop out the pulp with a spoon. Add cinnamon or serve with yogurt/cream if desired."]
      }
    ]
  },
  {
    "id": "surinam-cherry",
    "commonName": "Surinam Cherry (Pitanga)",
    "scientificName": "Eugenia uniflora",
    "image": "https://placehold.co/600x454.png",
    "description": "A plant in the family Myrtaceae, native to tropical South America’s east coast, ranging from Suriname, French Guiana to southern Brazil, as well as Uruguay and parts of Paraguay and Argentina. It is often used in gardens as a hedge or screen. The fruit is a ribbed berry, typically red to dark crimson or almost black when ripe, with a tart to sweet, resinous flavor.",
    "origin": "Tropical South America (east coast)",
    "localNames": ["Pitanga (Brazil/Portuguese)", "Brazilian Cherry", "Cayenne Cherry"],
    "regions": ["Brazil", "Caribbean", "Florida", "Hawaii", "Southeast Asia (introduced)"],
    "seasons": ["Fruits multiple times a year, often spring and fall peaks"],
    "nutrition": {
      "calories": "33 kcal per 100g",
      "macronutrients": [
        { "name": "Protein", "value": 0.8, "unit": "g" },
        { "name": "Carbohydrates", "value": 7.5, "unit": "g" },
        { "name": "Fat", "value": 0.3, "unit": "g" },
        { "name": "Fiber", "value": 0.9, "unit": "g" }
      ],
      "vitamins": [
        { "name": "Vitamin C", "value": 26.3, "unit": "mg", "rdi": "44%" },
        { "name": "Vitamin A", "value": 75, "unit": "µg RAE", "rdi": "8%" }
      ],
      "minerals": [
        { "name": "Phosphorus", "value": 11, "unit": "mg", "rdi": "2%" }
      ]
    },
    "healthBenefits": [
      "Good source of Vitamin C and Vitamin A.",
      "Contains antioxidants like lycopene and beta-cryptoxanthin.",
      "Traditionally used for its astringent and anti-diarrheal properties.",
      "Low in calories."
    ],
    "potentialAllergies": [
      { "name": "Resinous Flavor", "severity": "Mild", "details": "Some people find the resinous note in the flavor unpleasant. Darker, fully ripe fruits are usually sweeter and less resinous." }
    ],
    "cultivationProcess": "Step-by-Step Growing Guide:\n1. Climate: Tropical and subtropical. Tolerates brief, light frost once established.\n2. Soil: Adaptable to a wide range of soils but prefers well-drained, slightly acidic soil.\n3. Propagation: Seeds (germinate easily) or cuttings.\n4. Planting: Plant in full sun to partial shade. Can be grown as a shrub or small tree, excellent for hedges.\n5. Watering: Water regularly until established. Mature plants are relatively drought-tolerant.\n6. Harvesting: Fruits are harvested when they are fully colored (deep red to almost black) and detach easily from the stem. They are delicate.",
    "growthDuration": "Can start fruiting in 2-3 years from seed. Fruits multiple times a year in suitable climates.",
    "sustainabilityTips": [
      "Eat fresh when fully ripe for the best flavor (less resinous).",
      "Excellent for making jams, jellies, and syrups due to its tartness and pectin content.",
      "The plant is often grown ornamentally or as a hedge."
    ],
    "carbonFootprintInfo": "Low, especially if grown locally or foraged (0.2-0.6 kg CO2e/kg).",
    "staticRecipes": [
      {
        "name": "Fresh Surinam Cherries",
        "description": "Enjoying the unique tart-sweet flavor of ripe Surinam cherries.",
        "ingredients": ["A handful of ripe Surinam cherries"],
        "steps": ["Wash the Surinam cherries gently.", "They are best when deep red to almost black, indicating full ripeness, which reduces the resinous taste some find strong.", "Eat them whole, skin and all. There is usually one or sometimes two small seeds inside, which are typically discarded.", "The flavor is a unique blend of sweet, tart, and slightly resinous or spicy."]
      },
      {
        "name": "Surinam Cherry Jam",
        "description": "A flavorful jam that captures the unique taste of Surinam cherries.",
        "ingredients": ["4 cups Surinam cherries, pitted (can be tedious)", "2 cups sugar", "Juice of 1 lemon"],
        "steps": ["Wash and pit the Surinam cherries. This may take some time as the seeds are small.", "Combine pitted Surinam cherries, sugar, and lemon juice in a large, heavy-bottomed pot.", "Bring the mixture to a boil over medium-high heat, stirring until sugar dissolves.", "Reduce heat and simmer, stirring occasionally, for 30-45 minutes, or until the jam thickens and reaches setting point (220°F/105°C, or wrinkles on a cold plate).", "Skim off any foam.", "Ladle hot jam into sterilized jars and seal. Process in a boiling water bath for 10 minutes if desired for longer shelf life."]
      },
      {
        "name": "Surinam Cherry Cooler",
        "description": "A refreshing drink made from Surinam cherry juice.",
        "ingredients": ["2 cups ripe Surinam cherries, washed", "1 cup water", "1/4 cup sugar or honey (or to taste)", "Sparkling water or club soda", "Ice cubes", "Lime wedges for garnish"],
        "steps": ["In a saucepan, combine Surinam cherries and 1 cup of water. Bring to a simmer and cook for 5-10 minutes, until the fruits are soft and have released their juice. Mash them gently.", "Strain the mixture through a fine-mesh sieve, pressing the fruit to extract as much juice as possible. Discard solids.", "Stir sugar or honey into the warm juice until dissolved. Let it cool.", "To serve, fill glasses with ice. Pour about 1/4 to 1/3 cup of the Surinam cherry syrup into each glass.", "Top with sparkling water or club soda. Stir gently.", "Garnish with a lime wedge."]
      }
    ]
  }
]
